{
  "intro": {
    "title": "Love in the City of Dreams",
    "story": [
      "You never believed in love at first sight. Not until that Tuesday morning at the coffee shop when you locked eyes with Alex across a sea of laptop screens and overpriced lattes. Your heart skipped. Time slowed. And for one perfect moment, nothing else in the world existed.",
      "Three months later, you're living together in a cozy apartment with mismatched furniture and big dreams. Alex got offered a promotion at their company, but there's a catch - they have to choose between two cities. New York means a corner office, a six-figure salary, and rubbing elbows with executives. It also means long hours, constant pressure, and Alex's charming ex, Jordan, who just happens to work at the New York branch.",
      "Paris, on the other hand, is romantic. Intimate. A smaller role, but more work-life balance. You've always talked about living abroad together, sipping wine on balconies, getting lost in cobblestone streets. But Paris also means Alex's childhood friend Riley will be their direct supervisor - and you've seen the old photos. Riley had feelings for Alex once. Maybe they still do.",
      "Tonight, over takeout containers and nervous laughter, Alex turns to you with those eyes you fell for and says, 'I need you to help me decide. Where should we go? What kind of life do you want us to build together?'"
    ],
    "options": [
      {
        "text": "New York is where dreams come true. Sure, Jordan's there, but I trust us. Let's take the promotion and build an empire together.",
        "arc": "new-york"
      },
      {
        "text": "Paris is what we've always wanted. Forget the corporate ladder - let's choose love, adventure, and croissants. Riley won't be a problem.",
        "arc": "paris"
      }
    ]
  },
  "new-york": {
    "title": "The Big Apple Bite",
    "story": [
      "Moving day is chaos. Boxes everywhere, a U-Haul double-parked, your new landlord yelling about blocking the loading zone. But when you finally collapse on the air mattress that night - your furniture won't arrive until tomorrow - Alex pulls you close and whispers, 'We did it. We're really here.' Through the window, the Manhattan skyline glitters like a promise.",
      "The apartment is tiny. A studio in Hell's Kitchen that costs more than your old two-bedroom back home. But it has exposed brick, hardwood floors that creak in the right way, and that view. Alex starts their new position on Monday. You have two weeks before your remote work setup begins. Two weeks to figure out how to be a New Yorker."
    ],
    "options": [
      {
        "text": "Start apartment hunting",
        "arc": "new-york-apartment-choice"
      }
    ]
  },
  "new-york-settling": {
    "title": "Finding Your Rhythm",
    "story": [
      "Three weeks in, you're starting to understand New York. Not love it, not yet. But understand it. The subway rhythm. The bodega etiquette. The way everyone walks like they're late for something important. You're learning the language of this place.",
      "But you're also achingly lonely. Alex leaves at 7 AM and comes home at 7 PM, exhausted but electric with new-job energy. They tell you about their corner office, the view of the Chrysler Building, the free lunch catering. They're thriving.",
      "You're happy for them. You are. But you're also eating dinner alone most nights, scrolling through job postings, wondering if you made the right choice. Your remote work starts next week, but that just means you'll be alone in the apartment even more, talking to people through screens instead of faces.",
      "You need to figure out who you are in this city. You need your own thing."
    ],
    "options": [
      {
        "text": "Join a gym or fitness class. Physical activity might help with the loneliness and anxiety.",
        "arc": "new-york-settling-gym"
      },
      {
        "text": "Look for networking events in your industry. Start building your professional network here.",
        "arc": "new-york-settling-networking"
      },
      {
        "text": "Find a hobby group - book club, cooking class, something social and non-work related.",
        "arc": "new-york-settling-hobby"
      },
      {
        "text": "Lean into Alex's social circle. Ask to be included in more work adjacent events.",
        "arc": "new-york-settling-alex-circle"
      }
    ]
  },
  "new-york-month-one": {
    "title": "Settling In",
    "story": [
      "One month in, Alex's company throws a happy hour. 'You should come,' Alex says over breakfast. 'Meet the team. See my office. It'll be fun.' There's something in their voice - eagerness mixed with... is that nervousness?",
      "You agree, of course. You put on your good outfit, the one that says 'I'm successful and definitely not feeling insecure.' The office is everything Alex described and more. Floor-to-ceiling windows, modern furniture, a coffee bar that would make Starbucks jealous.",
      "Alex introduces you around. Marcus from accounting. Sofia from marketing. Everyone is friendly, polished, confident. Then Alex says, 'Oh, and this is Jordan. We're working on the Morrison account together.'",
      "Jordan is... exactly what you were afraid of. Charming smile, expensive suit, effortless charisma. They shake your hand with perfect pressure. 'I've heard so much about you. Alex talks about you constantly.' But there's something in the way they look at Alex when they say it. Something that makes your stomach twist.",
      "The evening continues. You notice things. The way Jordan touches Alex's arm when they laugh. The inside jokes you're not part of. The way Alex lights up when Jordan walks over. You tell yourself you're being paranoid. You tell yourself these are just coworkers. You tell yourself trust is important.",
      "But doubt plants itself in your chest like a seed, and you know it's only a matter of time before it grows."
    ],
    "options": [
      {
        "text": "Focus on building your own career and social life in New York. You need your own thing.",
        "arc": "new-york-career-focus"
      },
      {
        "text": "Support Alex fully. Attend more work events, get to know their colleagues, be the perfect partner.",
        "arc": "new-york-support-alex"
      },
      {
        "text": "Find a balance. Pursue your own interests while staying connected to Alex's world.",
        "arc": "new-york-balanced"
      }
    ]
  },
  "new-york-career-focus": {
    "title": "Building Your Own Empire",
    "story": [
      "You throw yourself into your own work. Networking events. Coffee meetings. You join a young professionals group, start taking a class at NYU, cultivate your own New York identity separate from being 'Alex's partner.'",
      "It feels good. Empowering. You're not just the person who followed their partner to the city - you're building something of your own. You make friends who don't know Alex, who ask about your day, your dreams, your ambitions.",
      "But there's a cost. You and Alex start operating on parallel tracks. Ships passing in the night. They have their work world; you have yours. Date nights become rare. Conversations become transactional. 'Did you pay the electric bill?' 'Can you grab milk on your way home?'",
      "You notice Jordan's name coming up more and more. 'Jordan and I have to work late.' 'Jordan suggested this new project management system.' But you're too busy with your own life to worry much about it.",
      "Until you're not."
    ],
    "options": [
      {
        "text": "Continue.",
        "arc": "new-york-jordan-intro"
      }
    ]
  },
  "new-york-support-alex": {
    "title": "The Supportive Partner",
    "story": [
      "You become a fixture at Alex's work events. You learn everyone's names, remember their kids' ages, ask thoughtful follow-up questions. You become known as Alex's incredibly supportive partner. The person who always shows up, always smiles, always plays the role perfectly.",
      "Alex appreciates it. They squeeze your hand during presentations, introduce you with pride, thank you for being there. Jordan is often at these events too. You try to befriend them. Try to be the bigger person. Try to believe that your security in the relationship means you can be gracious.",
      "But you notice things. The way Jordan monopolizes Alex's attention. The way they find reasons to pull Alex aside for 'quick work conversations.' The way Alex's energy changes when Jordan is around - more animated, more engaged.",
      "You're present for everything, but somehow you feel invisible. You've made yourself so available, so accommodating, that you're no longer a priority - you're a given. And givens are easy to take for granted.",
      "Your own career stalls. Your own friendships fade. You've built your life around supporting Alex's dreams, and you're starting to wonder what happened to your own."
    ],
    "options": [
      {
        "text": "Continue.",
        "arc": "new-york-jordan-intro"
      }
    ]
  },
  "new-york-balanced": {
    "title": "Walking the Tightrope",
    "story": [
      "You find a middle path. You attend some of Alex's work events, but not all. You build your own career, but you make time for date nights. You make your own friends, but you get to know Alex's colleagues too. It's a balancing act, and some days you nail it. Some days you don't.",
      "Jordan becomes familiar. You see them at the occasional work function. They're always polite, always professional. You even have a few decent conversations - turns out you both love the same obscure podcast. You start to think maybe your initial jealousy was unfounded.",
      "Alex seems happy. Not consumed by work, but engaged with it. Not neglecting you, but not smothering you either. You're building a life together in New York that feels sustainable. Challenging, but sustainable.",
      "You're not perfect. You have moments of insecurity. Moments when you see Alex texting Jordan late at night about work and you wonder if it's really just work. Moments when Alex cancels date night for a work emergency and you bite back resentment. But you communicate. You check in. You try.",
      "And for a while, it seems like trying is enough."
    ],
    "options": [
      {
        "text": "Continue.",
        "arc": "new-york-jordan-intro"
      }
    ]
  },
  "new-york-jordan-intro": {
    "title": "The Second Month",
    "story": [
      "The second month brings changes. Alex is up for a promotion already - their work on the Morrison account caught attention. But it means longer hours, higher stakes, more pressure. And more time with Jordan, who's now being considered for a parallel promotion. They're competing and collaborating simultaneously.",
      "You start noticing the late nights. 'Just drinks with the team,' Alex says, kissing your forehead before heading out at 9 PM. You try not to think about Jordan, but their name comes up constantly. 'Jordan suggested this restaurant.' 'Jordan made the funniest joke today.' 'Jordan thinks I should apply for the director position.'",
      "It's Wednesday night. Alex is home for once, but they're distracted, laptop open, barely listening as you talk about your day. You stop mid-sentence. They don't notice.",
      "'Alex,' you say, a little sharper. They look up, startled. 'Sorry, what?'",
      "You want to say: I miss you. I'm worried about us. Jordan's name is a constant presence in our home and I don't know how to feel about it. But instead you say, 'Nothing. Never mind.' And Alex returns to their screen, the moment lost."
    ],
    "options": [
      {
        "text": "Be friendly to Jordan. Maybe if you get to know them better, you'll feel less threatened.",
        "arc": "new-york-befriend-jordan"
      },
      {
        "text": "Keep your distance. Stay polite but don't engage more than necessary.",
        "arc": "new-york-distance-jordan"
      },
      {
        "text": "Talk to Alex about your discomfort now, before it gets worse.",
        "arc": "new-york-early-talk"
      }
    ]
  },
  "new-york-befriend-jordan": {
    "title": "Keep Your Enemies Closer",
    "story": [
      "You decide to try. You invite Jordan to brunch when they mention liking the same neighborhood you live in. You ask Alex to bring them to game night with your new friend group. You're friendly when you see them at work events, asking about their life, their interests.",
      "Jordan seems surprised but pleased. You learn they're actually pretty funny. They're obsessed with their rescue dog. They volunteer at a community garden. They're a real person, not a villain from your imagination.",
      "For a moment, you feel silly about your jealousy. Jordan is just Alex's coworker. They can both exist in Alex's life without it being a threat to you. You start to relax.",
      "Then one Friday evening, Alex texts: 'Emergency presentation prep. Gonna be another late one. Don't wait up.' You're staring at your phone when it buzzes again. But this time it's not from Alex.",
      "It's a message from an unknown number with a photo attached. The image shows Alex and Jordan at a dimly lit bar, Jordan's hand on Alex's arm, both of them laughing. The message reads: 'Thought you should know what Friday night presentations look like. - A Friend'",
      "Your hands shake. Your stomach drops. You tried to be the bigger person, tried to trust, tried to befriend the threat. And this is what you get.",
      "Everything you've built together suddenly feels like it's constructed on sand."
    ],
    "options": [
      {
        "text": "The photo arrives...",
        "arc": "new-york-photo-arrives"
      }
    ]
  },
  "new-york-distance-jordan": {
    "title": "Professional Distance",
    "story": [
      "You keep Jordan at arm's length. Polite, but cool. When they try to make conversation at events, you keep it brief. When Alex suggests including them in social plans, you find reasons to decline. You don't badmouth them, but you don't warm up either.",
      "Alex notices. 'You don't like Jordan, do you?' they ask one night. You shrug. 'I don't really know them.' 'Well, maybe if you tried...' But you change the subject. You don't want to seem jealous or controlling, so you stay quiet about your discomfort.",
      "The distance you maintain from Jordan creates a small distance from Alex too. There's a part of their life you're not engaging with. A part you're holding yourself separate from. You tell yourself it's healthy boundaries. But it might also be the beginning of a wall.",
      "The late nights continue. Jordan's name continues to pepper Alex's conversations. You notice but don't comment. You trust but verify - checking Alex's phone location, monitoring when they come home, cataloging the excuses.",
      "Then one Friday evening, Alex texts: 'Emergency presentation prep. Gonna be another late one. Don't wait up.' You're staring at your phone, feeling that familiar knot of anxiety, when it buzzes again.",
      "It's a message from an unknown number with a photo attached. The image shows Alex and Jordan at a dimly lit bar, Jordan's hand on Alex's arm, both of them laughing. The message reads: 'Thought you should know what Friday night presentations look like. - A Friend'",
      "Your hands shake. Your stomach drops. Your instinct to keep distance was right. But knowing you were right doesn't make this hurt any less."
    ],
    "options": [
      {
        "text": "The photo arrives...",
        "arc": "new-york-photo-arrives"
      }
    ]
  },
  "new-york-early-talk": {
    "title": "The Difficult Conversation",
    "story": [
      "That night, after Alex finally closes the laptop, you sit down across from them. 'We need to talk.' Four words that make Alex's face tighten with concern.",
      "'What's wrong?'",
      "'I need to be honest with you about something. Jordan's name comes up a lot. You're spending a lot of time together. And I'm trying not to be jealous or controlling, but I'd be lying if I said I was completely comfortable with it.'",
      "Alex is quiet for a moment. Then they reach for your hand. 'Thank you for telling me. I know Jordan and I have been working closely. But it's just work. There's nothing else there.'",
      "'I believe you,' you say. 'But I need you to understand that I'm feeling a little... secondary right now. To your job, to Jordan, to everything else in your new life here.'",
      "Alex's eyes fill with tears. 'God, I'm so sorry. I've been so caught up in proving myself at this job that I haven't been present for us. That's not okay.'",
      "You talk for hours. Alex promises to set better boundaries. To be more intentional about date nights. To be mindful of how much they talk about work - and Jordan - at home. You promise to speak up when you're feeling insecure instead of letting it fester.",
      "It's not a magic fix. But it's a start. For a few weeks, things are better. Alex comes home earlier. You have actual conversations. You feel like partners again.",
      "Then one Friday evening, Alex texts: 'Emergency presentation prep with Jordan. Gonna be another late one. Don't wait up.' The message lands differently now - like a broken promise. Then your phone buzzes again.",
      "It's from an unknown number with a photo attached. The image shows Alex and Jordan at a dimly lit bar, Jordan's hand on Alex's arm, both of them laughing. The message reads: 'Thought you should know what Friday night presentations look like. - A Friend'",
      "You had the conversation. You set the boundaries. Alex promised. And here you are anyway, staring at this photo, wondering if honesty even matters when someone is determined to break your trust."
    ],
    "options": [
      {
        "text": "The photo arrives...",
        "arc": "new-york-photo-arrives"
      }
    ]
  },
  "confrontation": {
    "title": "The Bar Scene",
    "story": [
      "You throw on a jacket and practically run to the address visible in the photo's background. Your heart is hammering so hard you can hear it over the New York traffic. Every block feels like a mile. Every person on the sidewalk is an obstacle between you and the truth.",
      "You're running scenarios in your head. What if they're kissing when you walk in? What if they're holding hands? What if the photo caught the most innocent moment of a very non-innocent evening? You're preparing yourself for heartbreak, armor yourself against the worst.",
      "When you burst through the bar doors, you spot them immediately. Alex and Jordan, sitting close in a corner booth. Your stomach drops. Then you see the rest: papers spread between them, Jordan's laptop open, Alex's reading glasses on (the ones they only wear when they're working), empty coffee cups instead of wine glasses.",
      "They're actually working."
    ],
    "options": [
      {
        "text": "Take a breath and assess...",
        "arc": "confrontation-moment"
      }
    ]
  },
  "confrontation-moment": {
    "title": "Reality Check",
    "story": [
      "Alex looks up, surprised. 'Babe? What are you doing here?' There's genuine confusion on their face, not guilt. No panic. No deer-in-headlights freeze. Just confusion and concern.",
      "Jordan quickly removes their hand from Alex's arm, looking uncomfortable. You realize, with a clarity that makes you feel sick, that Jordan had been pointing at something on the screen. A presentation slide, maybe. A spreadsheet. Something completely professional.",
      "You stand there in your thrown-on jacket, out of breath from running, face flushed with adrenaline and embarrassment. You're the person who just burst into their partner's work meeting because of an anonymous photo. You're the jealous partner in a movie who looks ridiculous in the third act.",
      "Alex excuses themselves from Jordan, walking over to you with concern etched across their features. 'What's wrong? You look like you've seen a ghost.' They touch your arm gently. 'Are you okay? Did something happen?'",
      "The kindness in their voice almost breaks you. You have a choice. You can be honest about your fear and vulnerability. Or you can protect your pride and pretend this was casual, no big deal, you were just in the neighborhood.",
      "But this moment matters. You can feel it. The choice you make right now will set the trajectory for everything that follows."
    ],
    "options": [
      {
        "text": "Show them the photo. Admit you were scared and jealous. Be vulnerable about your fears.",
        "arc": "honest-jealousy"
      },
      {
        "text": "Play it cool. Say you were just in the neighborhood and thought you'd surprise them. Hide your insecurity.",
        "arc": "play-cool"
      }
    ]
  },
  "honest-jealousy": {
    "title": "Vulnerability Wins",
    "story": [
      "With shaking hands, you show Alex the photo and the message. 'I got this tonight. And I know it looks like you're working, but I've been feeling so... distant from you lately. The late nights, Jordan's name constantly coming up. I got scared.'",
      "Alex's expression shifts from confusion to understanding to something tender. They pull you into a hug right there in the middle of the bar. 'I'm so sorry. I've been so focused on proving myself at work that I haven't noticed I've been neglecting us. Jordan is just a colleague - honestly, they're kind of annoying. They talk way too much about cryptocurrency.'",
      "You both laugh through tears. Alex pulls back and looks at you seriously. 'Someone sent this to hurt us. That's messed up. But I'm glad you came here. I'm glad you told me how you felt instead of letting it fester.'",
      "Jordan comes over, concerned. 'Is everything okay?' Alex explains the photo. Jordan's face goes pale. 'Someone's trying to sabotage us. Both of us. We're competing for the same promotion.' The three of you piece it together - one of the other managers, someone with access to both your phone numbers, someone who benefits from both Alex and Jordan being distracted.",
      "Jordan looks at you directly. 'For what it's worth, I'm engaged. My partner's name is Sam. We've been together four years. Alex is a colleague. Period.' They show you their phone background - a picture of them with someone else, both in matching Halloween costumes, both clearly in love."
    ],
    "options": [
      {
        "text": "The next few weeks...",
        "arc": "honest-jealousy-resolution"
      }
    ]
  },
  "honest-jealousy-resolution": {
    "title": "Choosing Each Other",
    "story": [
      "Over the next few weeks, things shift. Alex sets boundaries at work. Date nights become non-negotiable. No work talk after 8 PM. No checking emails in bed. They're present in a way they haven't been since before the move.",
      "You meet Sam, Jordan's partner, at a dinner Alex organizes. Sam is a graphic designer, funny and warm, and clearly head over heels for Jordan. Watching them together, you feel silly about your jealousy. But also validated - Jordan and Alex did spend a lot of time together. Your feelings weren't baseless, just misdirected.",
      "The coworker who sent the photo gets caught sending similar messages to other employees. HR gets involved. There's a small scandal. Both Alex and Jordan get apologies from the company. Jordan gets the promotion. Alex... doesn't.",
      "You expect Alex to be devastated. Instead, they come home thoughtful. 'I don't think I want this anymore,' they say that night, curled up on the couch together. 'The politics, the games, the constant competition. I miss actually liking what I do.'",
      "'What do you want?' you ask.",
      "'I want to build something with you. Something that's ours. Not a job where we're second place to quarterly earnings. An actual partnership.'"
    ],
    "options": [
      {
        "text": "Six months later...",
        "arc": "honest-jealousy-ending"
      }
    ]
  },
  "honest-jealousy-ending": {
    "title": "Brooklyn Bridge",
    "story": [
      "Six months later, you're walking across the Brooklyn Bridge at sunset. The city is bathed in gold light. Your new business - a consulting firm that combines both your skills - just signed its third major client. It's not a corner office or a six-figure salary, but it's yours. Together.",
      "Alex stops mid-bridge and turns to you. 'I need to ask you something.' There's a nervousness in their voice that makes your heart skip.",
      "'The night you showed up at that bar, scared and honest and willing to be vulnerable even though it was terrifying - that's when I knew. Really knew. You could have played it cool. You could have let resentment build until we exploded. But you chose us. You chose honesty. You chose to fight for us instead of against each other.'",
      "They pull out a small box. 'So I'm choosing you. Every day. For the rest of my life. Will you marry me?'",
      "The sunset, the bridge, the city that almost broke you but instead made you stronger - it all becomes background to this moment. To this person who learned to prioritize you. To this choice you're both making, consciously and clearly."
    ],
    "options": [
      {
        "text": "Say yes. Build a life together. This is your happy ending.",
        "arc": "happy-ending"
      }
    ]
  },
  "play-cool": {
    "title": "Pride Before the Fall",
    "story": [
      "You force a smile. 'Oh, I was just grabbing dinner nearby and saw you through the window. Thought I'd say hi.' The lie tastes bitter in your mouth. But you refuse to be that partner - the jealous one, the insecure one, the one who makes scenes.",
      "Alex seems to buy it, though something flickers in their eyes. Disappointment, maybe? Or is that just what you want to see? 'That's sweet, but we've got another hour of work here. Jordan and I are finalizing the Morrison pitch. I'll see you at home?' They kiss your cheek and return to the booth.",
      "You walk home alone, the anonymous photo burning a hole in your phone. You'll never show Alex. You'll never admit you came here because of it. You'll bury this fear like you've buried all the others."
    ],
    "options": [
      {
        "text": "Two weeks later...",
        "arc": "play-cool-deterioration-one"
      }
    ]
  },
  "play-cool-deterioration-one": {
    "title": "The First Cracks",
    "story": [
      "Two weeks pass. Alex keeps working late. You keep saying you're fine with it. The lies are small at first, almost imperceptible. 'How was your day?' 'Fine.' It wasn't fine. You spent two hours staring at your laptop, unable to focus, wondering where Alex was and who they were with.",
      "'Want to talk about it?' 'About what?' Everything. Nothing. The way you're drifting apart and neither of you is willing to name it.",
      "You notice things. A new cologne. Alex says Jordan recommended it. Secretive phone calls that Alex takes in the other room. 'Just work stuff, you wouldn't understand.' The implication being that you're not part of that world. You're just the person waiting at home.",
      "One night, Alex comes home at 11 PM smelling like wine and someone else's perfume. 'Team drinks,' they explain, already heading to the shower. You want to ask: Was Jordan there? Did you sit next to them? Did they make you laugh the way I used to? But you don't. You just say 'okay' and go back to pretending to read your book."
    ],
    "options": [
      {
        "text": "Another month passes...",
        "arc": "play-cool-deterioration-two"
      }
    ]
  },
  "play-cool-deterioration-two": {
    "title": "The Breaking Point",
    "story": [
      "Another month. The distance grows. You're roommates who sometimes have sex and rarely have conversations. Alex is climbing the corporate ladder. You're treading water, trying not to drown in a city that still doesn't feel like home.",
      "You start snooping. You hate yourself for it, but you do it anyway. Going through Alex's phone when they're in the shower. Checking their location. Reading their texts with Jordan. Nothing explicitly inappropriate, but an intimacy that feels worse than a kiss would. Inside jokes. Late-night conversations. 'You get me' and 'I don't know what I'd do without you.'",
      "Where do you fit in Alex's life anymore? Are you the partner or just the person who shares the lease?",
      "Three months after the photo, you're doing laundry and find a receipt in Alex's jacket pocket. Dinner for two at Le Bernardin - the restaurant where you had your first anniversary. The date on the receipt is from last Tuesday. Last Tuesday when Alex said they had a work dinner. Last Tuesday when you ate leftover Chinese food alone.",
      "Your hands shake as you hold the receipt. This is it. The evidence you've been looking for and dreading in equal measure."
    ],
    "options": [
      {
        "text": "Confront Alex tonight. You can't pretend anymore.",
        "arc": "play-cool-confrontation"
      }
    ]
  },
  "play-cool-confrontation": {
    "title": "The Truth",
    "story": [
      "When Alex comes home that night, you're waiting with the receipt on the coffee table. No preamble. No small talk. Just: 'Want to explain this?'",
      "Alex sees it and their face crumbles. 'I can explain.'",
      "'Please do. Because I'm really curious how you explain having dinner at our anniversary restaurant with someone who isn't me.'",
      "'It was Jordan's birthday. The team took them out. I didn't think—'",
      "'You didn't think I'd find out? Or you didn't think I'd care?' Your voice is rising. Months of buried feelings erupting. 'You've been pulling away for months. Late nights. Secret phone calls. That goddamn cologne. And now our restaurant? The place that was supposed to be ours?'",
      "Alex sits down heavily. 'You're right. I'm sorry. Jordan and I... we've gotten close. Too close. Nothing physical happened, I swear. But there's been an emotional intimacy that crossed lines.'",
      "'Why?' The question comes out broken.",
      "'Because they understand the work pressure. Because we're in the trenches together. Because...' Alex trails off.",
      "'Because I'm not enough,' you finish. The truth you've been avoiding. The truth that's been obvious for months.",
      "'Because I made you feel that way,' Alex says quietly. 'And you never told me. That night at the bar, when you showed up - you could have been honest. But you played it cool. And I could have been honest about how Jordan and I were getting too close. But I told myself it was fine because nothing physical happened. We both chose pride over truth. And now here we are.'"
    ],
    "options": [
      {
        "text": "Some bridges, once burned, can't be rebuilt. Walk away and start over.",
        "arc": "tragic-ending"
      },
      {
        "text": "Suggest couples therapy. Maybe you can save this if you both try harder.",
        "arc": "therapy-ending"
      }
    ]
  },
  "patient-talk": {
    "title": "Trust and Communication",
    "story": [
      "You delete the photo without responding. Anonymous troublemakers don't deserve your energy. Instead, you make tea and wait on the couch, a book open but unread in your lap. The words blur together. You're not actually reading; you're thinking. Preparing. Deciding how to approach this.",
      "You could spiral. You could assume the worst. You could pack a bag or show up at that bar or text back demanding explanations. But you've chosen trust. Now you have to follow through."
    ],
    "options": [
      {
        "text": "Midnight arrives...",
        "arc": "patient-talk-conversation"
      }
    ]
  },
  "patient-talk-conversation": {
    "title": "The Talk",
    "story": [
      "Alex comes home at midnight, exhausted and apologetic. 'I'm so sorry, babe. Jordan is a nightmare to work with - they kept changing the presentation every five minutes.' They start to collapse next to you on the couch, then notice your posture. The way you're sitting very still. The cold tea on the table.",
      "'What's wrong?'",
      "You show them the photo calmly. 'I got this tonight. I'm not accusing you of anything, but I need you to know that someone is trying to mess with us. And also, I need you to know that I've been feeling a little lonely lately.'",
      "Alex's face goes through a journey. Confusion. Anger at whoever sent the photo. Then something softer - guilt. 'You've been feeling lonely?'",
      "'Yeah,' you say quietly. 'I have.'",
      "Alex sits up, suddenly very awake. They take your hand. 'I had no idea someone would do this - send a photo like this. But more importantly, I had no idea you were feeling lonely. God, I'm such an idiot. I've been so caught up in work, in proving myself, that I haven't been present for us.'",
      "'I should have said something earlier,' you admit. 'I didn't want to seem unsupportive of your career. So I stayed quiet. That was wrong too.'"
    ],
    "options": [
      {
        "text": "Talk through the night...",
        "arc": "patient-talk-resolution"
      }
    ]
  },
  "patient-talk-resolution": {
    "title": "Building Something Better",
    "story": [
      "That night turns into a long conversation. Alex admits the promotion has been more stressful than expected. The competition with Jordan. The pressure from management. The imposter syndrome of being the new person trying to prove themselves worthy of the opportunity.",
      "You admit you've been afraid to voice your needs. Afraid of being the needy partner. Afraid of being the reason Alex doesn't succeed. Afraid that if you asked for more, you'd be asking for too much.",
      "'You're never too much,' Alex says fiercely. 'You're the reason I'm doing any of this. What's the point of a corner office if I lose you in the process?'",
      "It's not a magic fix. You both know that. But it's a start. A real start.",
      "The next day, Alex goes to HR about the photo. Security gets involved. Turns out it was a coworker named Marcus - someone gunning for the same promotion, trying to create drama that would make both Alex and Jordan look unprofessional. He gets fired. Jordan gets the promotion. Alex doesn't, but they're okay with it.",
      "'I don't think I want to be the person who sacrifices everything for a job,' Alex says that evening. 'I want work-life balance. I want date nights. I want us.'"
    ],
    "options": [
      {
        "text": "The next morning...",
        "arc": "patient-talk-new-normal"
      }
    ]
  },
  "patient-talk-new-normal": {
    "title": "New Boundaries",
    "story": [
      "Alex sets better work boundaries. Home by 7 PM unless there's a genuine emergency. No work talk after 8 PM. No checking emails in bed. Friday nights are sacred - date night, no exceptions.",
      "You both commit to weekly check-ins about your relationship. Sunday morning coffee, just the two of you, talking about what worked this week and what didn't. It feels awkward at first, formal almost. But it becomes a ritual you look forward to.",
      "It's not always perfect. There are still hard days. Alex still gets stressed about work. You still have moments of insecurity. But you have tools now. Communication. Trust. The willingness to be uncomfortable for a little while so you can be comfortable for a long while.",
      "You chose communication over suspicion, patience over reaction. And that choice saves you."
    ],
    "options": [
      {
        "text": "One year later...",
        "arc": "patient-talk-ending"
      }
    ]
  },
  "patient-talk-ending": {
    "title": "Anniversary",
    "story": [
      "One year after moving to New York, Alex takes you back to your apartment building. But you don't go inside. Instead, Alex leads you to the rooftop - a space you didn't even know existed.",
      "There are string lights. Candles in lanterns. A picnic setup with all your favorite foods. The skyline glitters in the background, but Alex only has eyes for you.",
      "'A year ago, we moved to this city thinking it would make us. And it almost broke us instead. But we chose each other. Again and again. Through anonymous photos and long work hours and moments when it would have been easier to walk away.'",
      "Alex drops to one knee. 'I want to keep choosing you. Every single day. In this city or any other. Will you marry me?'",
      "The answer is easy. The answer has always been easy. It's the work of staying together that's hard. But you're willing to do the work. Both of you are."
    ],
    "options": [
      {
        "text": "Say yes. You've earned this happy ending together.",
        "arc": "happy-ending"
      }
    ]
  },
  "space": {
    "title": "Alone in the City",
    "story": [
      "You grab a bag - clothes, toiletries, phone charger. The essentials. You move through the apartment like a ghost, trying not to think, trying not to feel. Just pack. Just leave. Just get space.",
      "You leave a note on the kitchen counter: 'Need some space to think. Don't worry about me.' You stare at the words. They feel inadequate. But you don't know what else to say. You don't know what you're feeling beyond the need to be anywhere but here.",
      "The hotel room is sterile and cold. Generic art on the walls. A bed that's too firm. The kind of space that's designed to be temporary, to be forgotten. You stare at the ceiling, playing out worst-case scenarios in your head. Alex and Jordan kissing. Alex choosing their career over you. Alex laughing when you're not around.",
      "The sun rises. You haven't slept."
    ],
    "options": [
      {
        "text": "Day two...",
        "arc": "space-day-two"
      }
    ]
  },
  "space-day-two": {
    "title": "The Silence",
    "story": [
      "Your phone explodes with messages through the night. Alex is panicking. 'Where are you?' 'Please talk to me.' 'I'm scared.' 'Did I do something wrong?' 'I'm sorry for whatever I did.' 'Please just tell me you're safe.'",
      "You don't respond. You need this silence to figure out what you actually feel. But the silence isn't clarifying - it's suffocating. You order room service you don't eat. You flip through TV channels without watching. You exist in limbo.",
      "What are you doing? The question circles your mind. Are you protecting yourself or punishing Alex? Are you thinking or running away from thinking? Are you strong for setting boundaries or weak for not being able to communicate?",
      "On day two, you go to work because you don't know what else to do. You're going through the motions, answering emails, attending a meeting you won't remember. Around 2 PM, the receptionist calls your desk. 'Someone's here to see you.'",
      "It's Alex. In your office lobby. They look terrible - same clothes as two days ago, wrinkled now. Dark circles under their eyes. Hair unwashed. They've been up all night. Probably both nights.",
      "'I know you needed space,' Alex says, voice raw. 'But I can't do this. I can't not know if you're okay, if we're okay, if there's even a we anymore. Please, just tell me what's wrong. We can fix it. We can fix anything, just please talk to me.'"
    ],
    "options": [
      {
        "text": "Show them the photo. Finally explain.",
        "arc": "space-explanation"
      }
    ]
  },
  "space-explanation": {
    "title": "The Truth",
    "story": [
      "You pull out your phone with shaking hands and show them the photo. 'This is what happened. Friday night. I got this from an unknown number. And I got scared. And I didn't know how to tell you I've been feeling distant from you for weeks. So I ran.'",
      "Alex's face goes through a transformation. Confusion. Then anger - not at you, but at whoever sent the photo. Then devastation. 'That's what this is about? That was a work meeting with Jordan. We were at the bar because it was close to the office and we were both starving. There's nothing between us. There never has been.'",
      "'I believe you,' you say, and you realize you do. 'But I've been lonely. I've been feeling like I'm second place to your job, to Jordan, to everything else in your new life here. The photo was just the final straw.'",
      "Alex reaches for your hand, then stops, unsure if touch is welcome. 'Why didn't you tell me? Why did you just leave?'",
      "'Because I didn't know how. Because I was scared. Because...' You trail off. The truth is ugly. You ran instead of communicating. You punished Alex instead of trusting them. You created this crisis as much as they did through neglect.",
      "The damage might already be done. Walking out without communication created a crack in your foundation. The question hanging between you now is simple and terrifying: can it be repaired?"
    ],
    "options": [
      {
        "text": "Believe Alex. Apologize for running away. Promise to communicate better moving forward.",
        "arc": "reconciliation"
      },
      {
        "text": "The trust is broken. Not because of Jordan, but because you realized you don't feel secure in this relationship.",
        "arc": "amicable-ending"
      }
    ]
  },
  "reconciliation": {
    "title": "Finding Each Other Again",
    "story": [
      "You break down in Alex's arms right there in the office lobby. 'I'm sorry. I got scared and instead of talking to you, I ran. That was wrong.' Your voice cracks. You're crying and you don't care who sees.",
      "Alex holds you tight. 'We both messed up. I've been so focused on work that I made you feel invisible. That's on me. I should have noticed. I should have checked in. I should have prioritized us.' Their voice is thick with emotion too.",
      "Someone from your office walks by, glances at you both, keeps walking. You're making a scene. But maybe some things are worth making a scene for.",
      "'Can we fix this?' you ask into Alex's shoulder.",
      "'I want to try. Do you?'",
      "'Yes.' The word comes out fierce, certain. 'Yes.'"
    ],
    "options": [
      {
        "text": "The first therapy session...",
        "arc": "reconciliation-therapy-one"
      }
    ]
  },
  "reconciliation-therapy-one": {
    "title": "Uncomfortable Truths",
    "story": [
      "The therapist's office is in Brooklyn, up three flights of stairs, with plants in every corner and art that's supposed to be calming. You sit on opposite ends of the couch. Not quite together, not quite apart.",
      "Dr. Martinez is in her fifties, with kind eyes and a direct manner. 'So. Tell me why you're here.'",
      "You both start talking at once. Stop. Look at each other. Alex gestures: you go first.",
      "'I ran away instead of communicating. I let fear control me. I broke trust by leaving without explanation.'",
      "Alex goes next. 'I neglected our relationship for my career. I didn't notice my partner was struggling. I let someone else become a constant presence in our life without setting appropriate boundaries.'",
      "Dr. Martinez nods. 'Good. You both have awareness of your contributions to this crisis. That's a strong starting point. Now the hard part: changing the patterns that got you here.'",
      "The session is uncomfortable. You talk about attachment styles and communication patterns and the ways you've both been avoiding difficult conversations. It's not romantic. It's not easy. But it's necessary."
    ],
    "options": [
      {
        "text": "Three months later...",
        "arc": "reconciliation-progress"
      }
    ]
  },
  "reconciliation-progress": {
    "title": "Two Steps Forward, One Step Back",
    "story": [
      "Three months into therapy, things are better. Not perfect, but better. Alex switched to a different team - Jordan is still at the company, but they're not working together anymore. It was awkward, but it was necessary.",
      "You're learning to speak up about your needs. 'I'm feeling disconnected tonight. Can we put our phones away and just talk?' It feels vulnerable every time, but it gets easier.",
      "Alex is learning to notice. To check in. To say 'I love you' not just when it's easy, but especially when it's hard. To choose you actively instead of passively assuming you'll always be there.",
      "But there are setbacks. One night, Alex comes home late without texting. You spiral immediately - all the old fears flooding back. When Alex finally walks in, you're cold, defensive. 'I had dinner with my parents,' Alex explains, confused. 'I told you this morning.' You'd forgotten. The fear had erased the memory.",
      "You have a fight. Not a productive one. Old patterns creeping back in. But the next morning, you both apologize. You talk it through. You don't let it fester. That's growth too - not avoiding the fights, but repairing after them."
    ],
    "options": [
      {
        "text": "One year later...",
        "arc": "reconciliation-milestone"
      }
    ]
  },
  "reconciliation-milestone": {
    "title": "Choosing Again",
    "story": [
      "One year after the hotel incident, you're stronger. Not invincible, but stronger. There are still hard days. Still moments of insecurity, still moments of miscommunication. But you have tools now. Therapy gave you a language for your feelings, strategies for conflict, ways to repair when things break.",
      "Saturday mornings are yours again. Breakfast in bed. Coffee that Alex makes exactly how you like it. Inside jokes that make strangers on the subway smile. You remember why you fell in love - and you're falling in love again, deeper this time, with full knowledge of each other's flaws and the active choice to love anyway.",
      "Dr. Martinez says you're ready to go from weekly sessions to monthly. 'You're doing the work,' she says. 'Both of you. That's what matters.'",
      "On the one-year anniversary of your first therapy session, Alex takes you to the Brooklyn Bridge at sunset. The same place you once walked, oblivious to how close you were to losing each other."
    ],
    "options": [
      {
        "text": "Two years later...",
        "arc": "reconciliation-wedding"
      }
    ]
  },
  "reconciliation-wedding": {
    "title": "The Vows",
    "story": [
      "Two years after almost losing each other, you're getting married. It's a small ceremony - forty people in a garden in Queens. No fancy venue. No pretense. Just the people who matter and the vows that matter more.",
      "Alex's vows: 'I promise to notice. To check in. To choose you actively every single day. I promise to remember that my career is what I do, but you are who I am. I promise to never take you for granted again. I promise to do the work, especially when it's hard. Especially when it's hard.'",
      "Your vows: 'I promise to speak up. To tell you when I'm scared or lonely or need more. I promise to trust you, and when trust is hard, to talk about why instead of running. I promise to fight for us, not against you. I promise to remember that we're on the same team. Always.'",
      "You exchange rings. You kiss. Everyone cheers. It's not a fairy tale ending because fairy tales don't require therapy and hard conversations and the daily choice to stay. It's better than a fairy tale. It's real.",
      "Especially when it's hard."
    ],
    "options": [
      {
        "text": "Exchange vows and build a beautiful life together. Love wins.",
        "arc": "happy-ending"
      }
    ]
  },
  "amicable-ending": {
    "title": "Different Paths",
    "story": [
      "You take Alex's hand gently. 'I believe you about Jordan. I do. But this whole situation made me realize something - I don't think I'm cut out for this life. The late nights, the corporate pressure, being second place to a career. It's not your fault. It's just not what I want.'",
      "Alex's eyes fill with tears but they nod slowly. 'I love my work. I don't want to resent you for making me choose between you and my ambitions. And you shouldn't have to feel lonely just to be with me.'",
      "The breakup is gentle. Sad. You help each other pack. You cry together one last time. Alex keeps the apartment; you move back to your hometown to be near family. There's no villain in this story, just two people who wanted different things.",
      "A year later, Alex sends you a wedding invitation. They're marrying someone they met at work - someone who understands that world. You're genuinely happy for them.",
      "And you? You've started writing that novel you always talked about. You're dating someone who's a teacher, who's home by four every day, who makes dinner with you and watches terrible reality TV on the couch.",
      "Sometimes love means knowing when to let go. You both found happiness, just not with each other."
    ],
    "options": [
      {
        "text": "Close this chapter and start the next one. Some endings are necessary.",
        "arc": "bittersweet-ending"
      }
    ]
  },
  "paris": {
    "title": "City of Light, City of Shadows",
    "story": [
      "The flight to Paris feels like a dream. Alex holds your hand during takeoff, both of you giddy with exhaustion and possibility. 'We're really doing this,' you whisper. 'We're really doing this,' Alex echoes back, squeezing your fingers.",
      "Your apartment is in the 11th arrondissement, up four flights of narrow stairs that make moving furniture a nightmare. But when you open the shutters and see the view - slate rooftops stretching toward Sacr-Cur, the evening light painting everything gold - the stairs don't matter. Nothing matters except this moment, this city, this choice you made together.",
      "Alex starts work on Monday. You have a month to settle in before your remote contract begins. A month to figure out how to be a Parisian."
    ],
    "options": [
      {
        "text": "Start apartment hunting",
        "arc": "paris-apartment-choice"
      }
    ]
  },
  "paris-settling": {
    "title": "Learning to Be Lost",
    "story": [
      "The first week, everything is an adventure. Getting lost is charming when you stumble upon a perfect bookshop. The language barrier is funny when you accidentally order three coffees instead of one. You wander the Marais, visit museums, sit in Luxembourg Gardens reading books you bought from bouquiniste stalls along the Seine.",
      "But you're also achingly alone. Alex leaves early for work, comes home speaking rapid French about colleagues and projects you don't understand. They're immersed in a whole world you're locked out of. Not because they mean to exclude you, but because you can't access it yet. Your French is limited to 'bonjour' and 'un cafe, s'il vous plat.'",
      "You try. You download Duolingo. You smile at the neighbors in the stairwell. You learn which boulangerie has the best croissants, which Metro line gets you to the grocery store. Small victories that feel both significant and pathetically small.",
      "Alex is flourishing. They come home energized, telling you about the office near Republique, the amazing coffee machine, how nice everyone is. Especially Riley, who's already taken them under their wing. 'Riley's been here three years,' Alex says over dinner. 'They know all the best places. They're going to show us around this weekend.'",
      "Us. But Riley knew Alex first. Riley knew Alex when. And you're the newcomer in more ways than one."
    ],
    "options": [
      {
        "text": "Time passes...",
        "arc": "paris-month-one"
      }
    ]
  },
  "paris-month-one": {
    "title": "Finding Your Place",
    "story": [
      "One month in, Riley invites you both to dinner. Their apartment is in the Marais, perfectly decorated, with a view that makes your place look like a closet. Riley greets you with la bise - the cheek kisses that still make you nervous - and welcomes you in flawless English and equally flawless French.",
      "Over wine and cheese, Riley tells stories about Alex from college. 'Remember when you tried to dye your hair blue and it turned green?' 'Oh my god, that terrible band you were in!' Alex laughs in a way you haven't heard in weeks. Free. Unselfconscious. Young.",
      "You smile and nod, nursing your wine, acutely aware that you have no stories to trade. You met Alex after college, after the experimental hair dye and terrible bands. You're the epilogue, not the origin story.",
      "Riley is charming. Too charming. They ask about your work, your interests, seem genuinely curious about your life. But you notice other things too. The way they touch Alex's arm when they laugh. The inside jokes that leave you on the outside. The way Alex lights up in Riley's presence, like they've come home to a version of themselves they'd forgotten existed.",
      "When you leave that night, Alex is buzzing. 'Riley's amazing, right? I'm so glad you got to meet them properly.' You agree because what else can you say? But doubt has planted itself in your chest, and Paris suddenly feels less romantic and more complicated."
    ],
    "options": [
      {
        "text": "Dive into French culture independently. Build your own Paris separate from Alex's.",
        "arc": "paris-independent"
      },
      {
        "text": "Rely on Alex more. Let them be your guide into this new life.",
        "arc": "paris-dependent"
      },
      {
        "text": "Find expat community. Make friends who understand what it's like to be foreign here.",
        "arc": "paris-expat"
      }
    ]
  },
  "paris-independent": {
    "title": "Your Own Adventure",
    "story": [
      "You throw yourself into becoming Parisian. Intensive French classes four times a week. You join a cooking class, a book club, start volunteering at an English-language library. You're determined not to be the trailing spouse, the one who just tagged along.",
      "It's hard. Your French improves slowly. You make friends but they're surface-level, the kind where you go to events together but don't share your real feelings. You're building a life, but it's exhausting, and some nights you come home to find Alex already asleep, and you're two people living parallel lives in the same tiny apartment.",
      "Riley's name comes up often. 'Riley suggested this cafe.' 'Riley's having a gallery opening.' 'Riley thinks I should apply for that promotion.' You're too busy with your own projects to worry much about it. You're too tired to ask questions. You're too proud to admit you might be lonely even while surrounded by new friends.",
      "You're independent. You're adapting. You're proving you can thrive anywhere. But there's a cost you're not quite ready to calculate."
    ],
    "options": [
      {
        "text": "Continue.",
        "arc": "paris-riley-intro"
      }
    ]
  },
  "paris-dependent": {
    "title": "The Learning Curve",
    "story": [
      "You lean on Alex. They become your translator, your guide, your interpreter of French culture. When Riley invites you both to things, you always go. When Alex's colleagues have gatherings, you're there, smiling and nodding through conversations you only half understand.",
      "Alex is patient, mostly. They explain jokes. They order for you at restaurants. They handle the difficult phone calls with the landlord and the internet company. You're grateful, but you're also increasingly aware of the power imbalance. They're capable. You're dependent.",
      "Riley is often around. Sometimes it feels like Riley is always around. They're kind to you, inclusive, but you can't shake the feeling that you're the third wheel in someone else's friendship. Riley and Alex speak in rapid French sometimes, forgetting to translate. Riley and Alex have inside jokes from college. Riley and Alex have history.",
      "You have now. But now feels precarious when it's competing with then.",
      "Your own career suffers. Working remotely is harder than you expected. The time zone difference makes meetings awkward. Your French isn't good enough to handle client calls. You're falling behind while Alex soars ahead, and the gap between you widens every day."
    ],
    "options": [
      {
        "text": "Continue.",
        "arc": "paris-riley-intro"
      }
    ]
  },
  "paris-expat": {
    "title": "Among Strangers",
    "story": [
      "You find your people at an expat meetup. Other Americans, Brits, Australians, all navigating the same challenges. The language barriers. The cultural confusion. The loneliness of being foreign. For the first time since arriving, you feel seen.",
      "You make real friends. Sarah, who's been here six years and gives you all her tips. Marcus, who's on his third attempt at learning French and makes you feel better about your struggles. Isabel, who's dating a French person and understands the specific challenge of loving someone who belongs here while you don't.",
      "It's comfortable. Maybe too comfortable. You start spending more time with expats than with Alex. It's easier to be with people who get it, who speak your language literally and figuratively. Alex notices. 'You're always out with your expat friends,' they say one night, not quite accusatory but not quite neutral either.",
      "'You're always with Riley,' you want to say, but don't.",
      "You're building a community, which is healthy. But you're also building walls, which might not be."
    ],
    "options": [
      {
        "text": "Continue.",
        "arc": "paris-riley-intro"
      }
    ]
  },
  "paris-riley-intro": {
    "title": "Four Months In",
    "story": [
      "Four months into your Paris life, things have settled into a rhythm. Not always a comfortable rhythm, but a rhythm nonetheless. You have your routines. Alex has theirs. You overlap when you can, exist separately when you can't.",
      "Riley is a constant presence. Dinners. Gallery openings. Weekend trips to the countryside. You've tried everything: liking them, keeping distance, being neutral. None of it changes the fundamental tension you feel when Riley and Alex are together. The way they lean toward each other. The shared language of old friendship that you'll never speak fluently.",
      "Then Alex comes home one evening with news. 'My company is doing a retreat in Lyon this weekend. Team building, strategy sessions, the usual corporate stuff.' They're folding laundry, not quite meeting your eyes. 'It's employees only, so...'",
      "'So I can't come,' you finish. Alex nods, apologetic. 'I wish you could. It would be more fun with you there.'",
      "That night, you're helping Alex pack when their phone buzzes. They glance at it and smile. 'Riley's excited about Lyon. We haven't done a trip together in ages.' Then Riley's text preview flashes on the screen: 'Can't wait for our weekend away! Just like old times'",
      "Just like old times. The words sit heavy in your chest. You know Riley and Alex were close as kids. You know Riley came out to Alex first. You know there was a drunken kiss at a college party that 'didn't mean anything.' You know all of this because Alex told you, back when you chose Paris together.",
      "What you don't know is whether you're being paranoid or whether your gut is trying to warn you about something real."
    ],
    "options": [
      {
        "text": "The Lyon retreat approaches...",
        "arc": "paris-riley-lyon-announced"
      }
    ]
  },
  "boundaries": {
    "title": "Difficult Conversations",
    "story": [
      "That night, after dinner, you pour two glasses of wine. Your hands are shaking slightly. This is vulnerability. This is risk. This is choosing to communicate instead of suffering in silence.",
      "'I need to tell you something,' you start. Alex looks up from their phone, attentive. 'Riley's text made me uncomfortable. The 'just like old times' thing. I know you two have history, and I'm trying not to be jealous, but I need you to hear me when I say this is hard for me.'",
      "Alex is quiet for a moment. You brace yourself for defensiveness. But instead, they reach for your hand. 'I hadn't thought about how that text might sound to you. You're right - that's not appropriate. Riley and I are friends, but you're my partner. You come first. Always.'",
      "'I don't want to control who you're friends with,' you say carefully. 'But this weekend... can you promise me something?'",
      "'Anything.'",
      "'Clear boundaries. No one-on-one time with Riley. No late-night drinks, just the two of you. Nothing that would make me uncomfortable if I saw a photo of it.' You pause. 'Like I made you uncomfortable seeing photos of me and Jordan.'",
      "Alex nods seriously. 'I promise. And thank you for telling me. This is exactly what we should be doing - talking instead of assuming.'"
    ],
    "options": [
      {
        "text": "The weekend begins...",
        "arc": "boundaries-weekend"
      }
    ]
  },
  "boundaries-weekend": {
    "title": "The Longest Weekend",
    "story": [
      "The weekend is hard. You're alone in Paris - a city that's romantic in theory but lonely in practice when you're by yourself. Your French still isn't good enough for real conversation. You try to enjoy the freedom, but mostly you just miss Alex.",
      "Saturday morning, Alex texts a photo: the whole team at breakfast, Riley visible but not next to Alex. 'Day one of boring presentations. Missing you already.'",
      "Saturday evening: 'Just finished dinner with the group. Heading to my room early. Call you in 10?'",
      "They do call. You talk for an hour. About nothing important. About everything important. About how much you miss each other.",
      "Sunday afternoon: 'One more session then I'm done. Can't wait to be home.'",
      "You spend the weekend reading in cafes, walking along the Seine, trying not to check your phone every five minutes. But you do check it. And Alex is always there, checking in, sending photos, keeping you connected even when you're apart."
    ],
    "options": [
      {
        "text": "Sunday evening arrives...",
        "arc": "boundaries-return"
      }
    ]
  },
  "boundaries-return": {
    "title": "The Confession",
    "story": [
      "When Alex returns Sunday evening, something is off. They hug you tight - too tight - and there's tension in their shoulders. You know immediately that something happened.",
      "'We need to talk,' Alex says, and your stomach drops. Those four words. Never good.",
      "You sit on the couch. Alex sits across from you, not next to you. That's how you know it's serious.",
      "'Riley made a move on me.' The words come out in a rush. 'Last night. We were with the group at the hotel bar. Everyone else left around eleven. Riley and I stayed to finish discussing the Q4 strategy - I know, I know, that was already pushing the boundaries you asked for. But it was work, and there were other people around, and then suddenly there weren't.'",
      "Your heart is hammering. 'What happened?'",
      "'Riley tried to kiss me. Just leaned in, sudden and unexpected. I pulled back immediately. I said, 'I'm committed to my partner. This is completely inappropriate. Our friendship needs to be strictly professional from now on.' Riley looked shocked, then embarrassed. They apologized, blamed the wine, said they misread signals.'",
      "Alex finally looks at you directly. 'But I don't think they misread anything. I think they've been waiting for an opportunity. And I'm so sorry I didn't see it sooner. I'm requesting a transfer to a different supervisor. Riley and I can't have the relationship we used to have. Not when they don't respect my boundaries. Not when they don't respect us.'"
    ],
    "options": [
      {
        "text": "Take a moment to process...",
        "arc": "boundaries-decision"
      }
    ]
  },
  "boundaries-decision": {
    "title": "Choosing Trust",
    "story": [
      "You're quiet for a long moment. Processing. Alex stopped it. Alex told you immediately. Alex is requesting a transfer. Alex chose you.",
      "'Are you angry?' Alex asks quietly. 'At me, I mean. For not seeing it coming. For staying at the bar after everyone left.'",
      "'I'm angry at Riley,' you say slowly. 'For trying. For putting you in that position. For not respecting our relationship.' You pause. 'But you handled it exactly right. You set boundaries. You told me immediately. You're taking steps to make sure it doesn't happen again.'",
      "Alex's eyes fill with tears. 'I was so scared you'd think I led them on. Or that you'd make me choose between you and my job here.'",
      "'You already chose,' you say, taking their hand. 'And you chose me. That's what matters. Trust isn't about never being in difficult situations. It's about how you handle them when they happen. And you handled this perfectly.'",
      "Relief washes over Alex's face. They pull you into an embrace. 'You are my priority. Always. I'll never put you in a position to doubt that again.'"
    ],
    "options": [
      {
        "text": "Thank Alex for being honest and setting boundaries. Trust is earned through actions like this.",
        "arc": "trust-built"
      },
      {
        "text": "You're furious. Not at Alex, but at Riley. Confront Riley yourself about trying to sabotage your relationship.",
        "arc": "confront-riley"
      }
    ]
  },
  "trust-built": {
    "title": "Love in Translation",
    "story": [
      "The Riley situation resolves itself. They transfer to the London office a few months later, whether from embarrassment or opportunity, you don't know. You don't care. What matters is that Alex chose you, clearly and without hesitation.",
      "Alex's new supervisor is a woman named Claudette who's been with the company for fifteen years and has zero interest in drama. 'Work is work, home is home,' she says in her perfect French-accented English. 'Alex leaves at six. No exceptions.' You could kiss her."
    ],
    "options": [
      {
        "text": "Autumn arrives in Paris...",
        "arc": "trust-built-seasons"
      }
    ]
  },
  "trust-built-seasons": {
    "title": "Finding Your Paris",
    "story": [
      "Paris becomes yours together. Not the tourist Paris, but the real one. You find your favorite bakery - the one on Rue des Martyrs where the owner, Monsieur Bernard, saves you the best croissants. Your neighborhood wine shop where Sophie teaches you about Bordeaux versus Burgundy. The secret garden in the Marais that tourists never find.",
      "Your French improves. You start freelancing from cafes, actually feeling like a character in your own story instead of a sidekick in someone else's. You make friends - other expats who get it, friendly locals who invite you to dinner parties, Alex's colleagues who are just colleagues, nothing more.",
      "Friday nights become sacred. Alex comes home early. You cook together, attempting recipes from a cookbook Alex's mom sent. Some turn out great - the boeuf bourguignon that simmers all day. Others end in laughter and ordering pizza - the souffle that deflated like your hopes and dreams.",
      "You fall in love with Paris. More importantly, you fall in love with your life in Paris. Your life, not just Alex's."
    ],
    "options": [
      {
        "text": "Your second anniversary...",
        "arc": "trust-built-proposal"
      }
    ]
  },
  "trust-built-proposal": {
    "title": "The Jardines des Tuileries",
    "story": [
      "On your second anniversary of moving to Paris, Alex takes you to the Jardin des Tuileries at sunset. The light is golden, painting everything in that perfect Parisian glow. You're walking hand in hand, talking about maybe getting a cat, when Alex stops by the fountain.",
      "'I need to tell you something,' they say, and your heart does that thing it does - half excitement, half fear.",
      "Before you can spiral, Alex drops to one knee. 'Two years ago, I asked you to choose Paris with me. You said yes even though it was scary. Even though it meant leaving everything familiar behind. And when things got hard - when Riley happened, when I almost lost you - you communicated. You were honest. You trusted me when you had every reason not to.'",
      "Alex pulls out a small velvet box. 'You chose Paris. You chose honesty. You chose us. Now I'm choosing you. Every day. For the rest of my life. Will you marry me?'",
      "Through tears, you say yes. In the background, an accordion player - because of course there's an accordion player - starts playing 'La Vie en Rose.' It's cheesy and perfect and so incredibly Paris.",
      "A group of tourists applauds. An old French woman winks at you. Alex slides the ring onto your finger and kisses you like you're in a movie. Like you're the only two people in the city.",
      "And in this moment, you are."
    ],
    "options": [
      {
        "text": "Plan a wedding in a small chateau outside the city. Live happily ever after.",
        "arc": "happy-ending"
      }
    ]
  },
  "confront-riley": {
    "title": "The Confrontation",
    "story": [
      "You show up at Alex's office the next day and ask to speak with Riley privately. Alex tries to stop you - 'You don't have to do this' - but you need to say your piece.",
      "In a conference room, you face Riley directly. 'I know what you tried to do. I know you think you and Alex have some deep connection that I can't understand. But here's what you need to understand: Alex chose me. Every day, they choose me. Your moment passed years ago, and trying to reclaim it now just makes you look desperate.'",
      "Riley's face flushes. 'You don't understand our history'",
      "'I don't need to. History is the past. I'm their present and their future. Stay professional, stay in your lane, or I promise you'll regret it.'",
      "You walk out before Riley can respond. Alex is waiting outside, eyes wide. 'That was... intense. Are you okay?'",
      "'I'm great,' you say, and you mean it. Sometimes love means fighting for what's yours.",
      "Riley stays away after that. Whether from respect or fear, you don't care. You've drawn your line in the sand, and Alex appreciates it more than they say. Your relationship deepens, forged stronger by the fire of adversity."
    ],
    "options": [
      {
        "text": "Continue building your Paris life together. You've won this battle, and it feels good.",
        "arc": "happy-ending"
      }
    ]
  },
  "silent-suffering": {
    "title": "The Weight of Silence",
    "story": [
      "You kiss Alex goodbye at the train station. 'Have fun,' you say, and it sounds normal. It sounds fine. It sounds like everything isn't slowly unraveling inside you.",
      "'I'll miss you,' Alex says, squeezing your hand. 'It's just two days.'",
      "'I know. It's fine. Go.' You smile. The smile feels like a mask.",
      "You spend the weekend pretending everything is fine. But inside, you're imagining scenarios. Alex and Riley laughing over wine. Inside jokes you're not part of. Accidental touches that linger too long. That drunken kiss from college happening again, except this time they don't stop."
    ],
    "options": [
      {
        "text": "The weekend ends...",
        "arc": "silent-suffering-return"
      }
    ]
  },
  "silent-suffering-return": {
    "title": "The Poison",
    "story": [
      "Alex returns Sunday night, cheerful and oblivious. 'The retreat was so boring! I missed you every second.' They're affectionate, attentive, seemingly unchanged. They bring you a small gift - a book from a Lyon bookshop.",
      "You want to believe everything is fine. You want to ask: 'What happened with Riley? Did they try anything? Did you feel tempted?' But you don't. You smile. You say thank you for the book. You let the moment pass.",
      "But doubt is a poison that spreads slowly. It starts small. Checking where Alex is on Find My Friends. Noting when they come home late. Paying attention to how often Riley's name comes up in conversation.",
      "Then it grows. You start checking Alex's phone when they're in the shower. Just a quick glance. Just to reassure yourself. Except it doesn't reassure you - it feeds the paranoia. Every text from Riley feels suspicious. Every 'lol' feels too familiar. Every 'miss you' feels too intimate, even when it's clearly about work.",
      "You're becoming someone you don't recognize. Someone who snoops. Someone who catalogs evidence. Someone who's building a case instead of having a conversation."
    ],
    "options": [
      {
        "text": "Weeks turn into months...",
        "arc": "silent-suffering-discovery"
      }
    ]
  },
  "silent-suffering-discovery": {
    "title": "The Text Thread",
    "story": [
      "Three months after Lyon, you find it. Alex left their phone on the counter while taking out the trash. A message from Riley appears on the lock screen: 'I need to tell you something.'",
      "You shouldn't look. You know you shouldn't look. But your hands are already opening the phone (you know the passcode, have always known the passcode, back when that was trust instead of surveillance).",
      "The text thread loads. You scroll up. Your heart sinks with every line.",
      "Riley, two weeks ago: 'I can't stop thinking about Lyon. About what almost happened.'",
      "Alex: 'Nothing almost happened. You tried to kiss me. I stopped you. That's what happened.'",
      "Riley: 'But you felt it too. The connection. The chemistry. Tell me you didn't feel it.'",
      "Alex: 'You know I care about you too, but I'm with someone.'",
      "Those words freeze you. 'I care about you too.' Not 'I love my partner' or 'I'm not interested' or 'there's no chemistry.' Just 'I'm with someone.' Like you're an obligation. Like you're the thing standing between Alex and what they really want.",
      "You hear the door open. Alex is back from taking out the trash. You're standing there with their phone in your hand, the evidence of... what? Nothing physical. But an emotional intimacy that guts you just the same."
    ],
    "options": [
      {
        "text": "Confront Alex now. Show them the texts.",
        "arc": "silent-suffering-confrontation"
      }
    ]
  },
  "silent-suffering-confrontation": {
    "title": "The Breaking Point",
    "story": [
      "Alex sees the phone in your hand. Sees your face. Knows immediately. 'How long have you been going through my phone?'",
      "'Does it matter?' you counter. 'You care about Riley too? That's how you shut down someone trying to break up our relationship?'",
      "Alex's face flushes. 'That's not what that meant. You're taking it out of context.'",
      "'Then give me context! What happened in Lyon? What almost happened?'",
      "'Riley tried to kiss me. I stopped her. I told them it was inappropriate. That's it. That's the whole story.'",
      "'And then you've been texting about your connection and chemistry ever since?' Your voice is rising. 'And you never thought to tell me? You never thought to set boundaries? You just kept this whole emotional affair going while I'",
      "'It's not an affair!' Alex shouts. 'Nothing happened! Riley is my friend. I can't help how they feel about me.'",
      "'But you can help how you respond! You could have said you love me. You could have said you're not interested. Instead you said you're 'with someone' like I'm an inconvenient obstacle!'",
      "The silence that follows is deafening. You can see Alex processing, realizing how it sounds. 'You're right,' they say quietly. 'That was wrong. I should have been clearer with Riley. I should have told you.'",
      "'Why didn't you?'",
      "'Because...' Alex trails off. 'Because you never asked. Because you seemed fine. Because I told myself it wasn't a big deal if nothing physical happened.'",
      "'I never asked because I was trying not to be the jealous, controlling partner. I suffered in silence until the silence broke us both.'"
    ],
    "options": [
      {
        "text": "Fight for the relationship. Demand couples therapy and complete transparency moving forward.",
        "arc": "therapy-ending"
      },
      {
        "text": "You're exhausted. The relationship feels like a job you're failing at. End it before it destroys you completely.",
        "arc": "tragic-ending"
      }
    ]
  },
  "surprise-visit": {
    "title": "Unannounced Arrival",
    "story": [
      "Saturday morning. You're alone in the apartment, staring at Riley's text on Alex's behalf. 'Just like old times.' The words eat at you. You try to read. Try to work. Try to do anything other than imagine what's happening in Lyon.",
      "By noon, you've made a decision. You book a last-minute train ticket. Two hours to Lyon. You'll surprise Alex. It'll be romantic. Spontaneous. You're not checking up on them - you're just missing them. That's what you tell yourself.",
      "On the train, you text: 'Surprise! Couldn't stand being away from you. What hotel are you at?'",
      "Three dots appear. Disappear. Appear again. You watch them, your heart racing. Finally, a message: 'Babe, this is such a sweet thought, but it's a work thing. I don't think you can just show up.'",
      "Something hardens in your chest. 'Too late! Already on my way. Can't wait to see you!' You add a heart emoji to keep it light, but there's something sharp underneath. Something that says: I don't need your permission."
    ],
    "options": [
      {
        "text": "The train arrives in Lyon...",
        "arc": "surprise-visit-arrival"
      }
    ]
  },
  "surprise-visit-arrival": {
    "title": "Cold Welcome",
    "story": [
      "When you arrive at the hotel lobby, Alex is waiting. But not the way partners wait for each other. There's no smile. No excited hug. Just Alex standing there with crossed arms and tense shoulders.",
      "'This is... unexpected,' Alex says. The greeting is off. Formal. Cold.",
      "'Surprise,' you say weakly. The word falls flat.",
      "Riley appears from the hotel bar, drink in hand, eyebrows raised. 'Well, this is awkward.' They don't even try to hide their amusement. Or is it satisfaction? You can't tell.",
      "Alex pulls you aside, away from Riley, into a quiet corner of the lobby. 'What are you doing here?' Their voice is low, controlled. Angry. 'You can't just crash a work retreat.'",
      "'I missed you,' you say. It sounds defensive even to your own ears.",
      "'You checked up on me. That's what this is. You didn't trust me to spend a weekend with colleagues, so you decided to show up unannounced and...' Alex gestures helplessly. 'What exactly did you think you'd find?'",
      "The words are harsh but not untrue. You've shown up unannounced because you don't trust your partner. And now you're standing in a hotel lobby in Lyon, and everyone can see exactly what kind of person you are. Jealous. Controlling. Insecure."
    ],
    "options": [
      {
        "text": "The weekend continues...",
        "arc": "surprise-visit-disaster"
      }
    ]
  },
  "surprise-visit-disaster": {
    "title": "The Longest Weekend",
    "story": [
      "The weekend is a disaster. Alex gets you a separate room. 'I can't have you in mine during a work event. It's unprofessional.' You spend Saturday alone while Alex attends sessions. You order room service you don't eat. You watch French TV you don't understand.",
      "Saturday night, Alex agrees to have dinner with you. Just the two of you. But the conversation is stilted. Every topic feels like a minefield. You can't ask about Riley without sounding jealous. You can't talk about why you came without admitting you don't trust them. You can't apologize without admitting you were wrong.",
      "Alex is distant. Professional. Like you're a difficult client they have to manage rather than the person they're building a life with.",
      "Sunday morning, you see Alex at breakfast with the team. Riley is there, sitting next to Alex, laughing at something on Riley's phone. Alex looks relaxed. Happy. More at ease with Riley than they've been with you all weekend.",
      "You've revealed your hand. You're the jealous partner who crashed a work event. The person who can't give their partner space. The person who needs constant reassurance. Alex sees you differently now. You see yourself differently now. And you don't like what you see."
    ],
    "options": [
      {
        "text": "Apologize. Admit you let jealousy cloud your judgment. Ask for a chance to rebuild trust.",
        "arc": "apologize-rebuild"
      },
      {
        "text": "Double down. If Alex has nothing to hide, why are they so angry about you being here?",
        "arc": "double-down"
      }
    ]
  },
  "apologize-rebuild": {
    "title": "Humble Pie in Lyon",
    "story": [
      "That night, you sit on the hotel bed and say the hardest words: 'I'm sorry. I was wrong. I let my insecurity turn me into someone I don't want to be. You didn't deserve this ambush. I should have talked to you instead of showing up like some kind of jealous detective.'",
      "Alex's expression softens. 'I appreciate that. But we need to talk about why you felt this was necessary. Are you not happy in Paris? Do you not trust me?'",
      "You talk until 2 AM. The truth comes out: you've been lonely. Your career is on hold while Alex's flourishes. You've been feeling like a sidekick in someone else's story. Riley was just a symptom of a deeper problem.",
      "Alex holds you. 'Why didn't you tell me? We're supposed to be a team.' 'Because I didn't want to ruin Paris for you,' you admit. 'Because I thought I should be stronger.'",
      "The next morning, Alex skips the retreat sessions. You spend the day exploring Lyon together, having the conversations you should have had months ago. Riley texts asking where Alex is. Alex turns off their phone. 'They can wait. You can't.'",
      "You return to Paris different. Alex helps you find a job in your field. You make friends outside of Alex's circle. You start couples therapy to work on communication. It's not perfect, but it's real. And real is better than perfect any day."
    ],
    "options": [
      {
        "text": "Commit to the work of maintaining a healthy relationship. It's worth it.",
        "arc": "happy-ending"
      }
    ]
  },
  "double-down": {
    "title": "The Point of No Return",
    "story": [
      "Instead of apologizing, something hardens in you. Pride. Self-righteousness. The certainty that you're right and Alex is wrong. 'If you have nothing to hide, why are you acting like I committed some crime by wanting to see my partner?'",
      "Your voice is loud. Too loud. People in neighboring rooms can definitely hear. You don't care.",
      "Alex's face transforms. The concern from earlier is gone, replaced by something cold. 'Because you don't trust me. Because you're checking up on me like I'm a child who can't be left alone for a weekend. This isn't love - this is control.'",
      "'Maybe I wouldn't need to control things if you didn't have an emotional affair partner as your supervisor!'",
      "The words hang in the air like a slap. You see the exact moment something breaks in Alex's eyes. Not breaks like shattering - breaks like giving up.",
      "Alex grabs their jacket. 'I'm staying in Riley's room tonight. We'll talk when you're rational.' They walk to the door.",
      "'Running to Riley? Proving my point?'",
      "Alex turns back. 'I'm staying in their room because they have a couch and I can't be near you right now without saying something I'll regret. But you know what? Think whatever you want. You've already made up your mind about who I am.'"
    ],
    "options": [
      {
        "text": "Alex leaves...",
        "arc": "double-down-aftermath"
      }
    ]
  },
  "double-down-aftermath": {
    "title": "The Spiral",
    "story": [
      "The door closes. You're alone in the hotel room with your anger and your self-righteousness and nothing else. You tell yourself you're right. You tell yourself Alex is gaslighting you. You tell yourself Riley orchestrated this whole thing.",
      "You don't sleep. You pace. You imagine Alex and Riley together. You build elaborate scenarios in your head. By morning, you've convinced yourself the relationship is over and it's all their fault.",
      "Sunday, Alex texts: 'I'm staying for the last retreat session. Take the train back without me. We'll talk when I get home Monday.'",
      "You don't go home. You go to a friend's place in Paris. You vent. They listen, then gently ask: 'But why did you show up without asking?' You don't want to hear it. You leave.",
      "By Monday, you've made your decision. You find a new apartment. You move half your stuff out before Alex gets home. When Alex walks in to see you packing, their face crumbles.",
      "'This is it?' Alex asks quietly. 'You're just leaving?'",
      "'You chose Riley.'",
      "'I chose a couch for one night because you accused me of having an affair and wouldn't listen to reason!'",
      "'I saw how you looked with them at breakfast!'",
      "'Happy? I looked happy? Maybe because I was having one good moment in a nightmare weekend where my partner crashed my work event, accused me of cheating, and refused to apologize for any of it!'"
    ],
    "options": [
      {
        "text": "The fight escalates...",
        "arc": "double-down-breakup"
      }
    ]
  },
  "double-down-breakup": {
    "title": "What We Destroyed",
    "story": [
      "The fight is ugly. Voices raised. Accusations flying. You blame Riley. Alex blames your jealousy. You're both saying things designed to hurt, and succeeding.",
      "'You never trusted me!' Alex shouts.",
      "'You never gave me reason to!' you shout back.",
      "'I came home every night! I answered every call! I was working, building a life for us!'",
      "'For you! You were building a life for you! I was just the person waiting at home!'",
      "The truth hangs there. Maybe you're both right. Maybe you're both wrong. Maybe it doesn't matter anymore because the damage is done.",
      "You finish packing. Alex doesn't stop you. You walk out of the apartment you shared, out of the life you built, out of the love you almost had.",
      "The breakup paperwork is handled through lawyers. You don't see each other again except once, briefly, to divide up the furniture. It's civil. Cold. Like you're strangers who once knew each other's names."
    ],
    "options": [
      {
        "text": "One year later...",
        "arc": "double-down-aftermath-year"
      }
    ]
  },
  "double-down-aftermath-year": {
    "title": "The Aftermath",
    "story": [
      "A year later, you see it on social media. Alex and Riley are together. They're at some company event, Alex's arm around Riley's waist, both of them smiling. The caption: 'One year with this amazing human.'",
      "It hurts. Of course it hurts. But what hurts more is knowing you pushed them together. By showing up in Lyon. By refusing to apologize. By treating Alex like they were guilty before they'd done anything wrong.",
      "Riley probably did warn Alex about you. Probably said you were controlling, insecure, unable to let Alex breathe. And then you proved Riley right. You became exactly the person they warned Alex about.",
      "Sometimes the monster we fear becomes real because we treated our partner like they were already one. Sometimes we create the very reality we're trying to avoid.",
      "You're dating someone new now. Someone patient. Someone who doesn't trigger your jealousy. But sometimes, late at night, you think about that hotel in Lyon. About the choice you made to double down instead of apologize. About how different things might be if you'd chosen differently.",
      "You'll never know. That timeline is closed to you now."
    ],
    "options": [
      {
        "text": "Move on. Learn from this. Become someone better in your next relationship.",
        "arc": "tragic-ending"
      }
    ]
  },
  "happy-ending": {
    "title": "Ever After",
    "story": [
      "Love isn't a fairy tale. It's a choice you make every day. It's communicating when it's hard, trusting when it's scary, and fighting for each other instead of against each other.",
      "You and Alex learned that the hard way. There were moments when you almost lost everything. Moments when jealousy, fear, and pride nearly destroyed what you'd built. But you chose each other. Again and again and again.",
      "Years later, you're hosting dinner at your place. Friends fill your home with laughter and wine and terrible karaoke. Someone asks, 'What's your secret? How do you make it look so easy?'",
      "You and Alex exchange a glance - a whole conversation in a single look. 'It's not easy,' Alex says. 'It never has been.'",
      "'But it's worth it,' you add, taking Alex's hand. 'Every hard conversation, every moment of doubt, every choice to stay and work through it. Worth it.'",
      "Someone proposes a toast. 'To love that isn't perfect but is perfectly yours.'",
      "You raise your glass, kiss your partner, and know in your bones that you're exactly where you're supposed to be.",
      "THE END"
    ],
    "options": []
  },
  "tragic-ending": {
    "title": "What We Lost",
    "story": [
      "Some love stories don't have happy endings. Some relationships fail not because of any single betrayal, but because of a thousand small cuts. A thousand moments of choosing pride over vulnerability, fear over trust, silence over truth.",
      "You and Alex became cautionary tale instead of a love story. You loved each other - that was never in question. But love alone isn't enough. You needed communication, trust, and the courage to be honest even when it was terrifying.",
      "The breakup devastates you both. There's no clean break, no easy villain to blame. Just two people who wanted different things or couldn't navigate wanting the same things together.",
      "Months pass. Then years. You both move on, build new lives, maybe find new love. But sometimes, late at night, you think about what could have been. The alternate universe where you made different choices. Where you spoke up. Where you trusted. Where you fought for each other instead of against each other.",
      "You see Alex once, years later, on a street corner in a city neither of you planned to be in. You lock eyes. You both smile, sad and knowing. A whole conversation passes without words: I'm sorry. Me too. I hope you're happy. You too.",
      "Then you walk away, carrying the ghost of what you were with you forever. Some loves shape us. Some loves break us. Yours did both.",
      "THE END"
    ],
    "options": []
  },
  "therapy-ending": {
    "title": "The Work",
    "story": [
      "Couples therapy is not romantic. It's messy and uncomfortable and sometimes you leave sessions feeling worse than when you arrived. A professional stranger asks you to excavate your deepest fears and resentments while your partner sits three feet away, doing the same.",
      "Some sessions, you make breakthroughs. You understand why you react the way you do, why Alex shuts down during conflict, why communication feels impossible sometimes. You learn tools: active listening, 'I' statements, how to fight fair.",
      "Other sessions, you wonder why you're bothering. The problems feel insurmountable. You're too different, too damaged, too far gone. You watch other couples break up in the waiting room and wonder if you're next.",
      "But you keep showing up. Week after week, month after month. Slowly, things shift. Not perfectly. Not magically. But shift nonetheless. You learn Alex's triggers. Alex learns yours. You develop a shared language for navigating rough waters.",
      "Three years later, you're still together. Still in therapy, actually - now it's monthly maintenance instead of weekly crisis management. Your relationship isn't perfect. You still fight sometimes. But you fight better. You repair faster. You know how to come back to each other.",
      "Someone asks if therapy 'fixed' you. You laugh. 'We didn't need fixing. We needed tools. And time. And the willingness to be uncomfortable long enough to grow.'",
      "It's not the ending you imagined, but it's the ending you earned. And that means something.",
      "THE END"
    ],
    "options": []
  },
  "bittersweet-ending": {
    "title": "Different Kinds of Love",
    "story": [
      "You remain friends with Alex. Not immediately - there's too much heartbreak for that. But eventually, after time and distance and new relationships heal the raw edges, you find your way back to each other as friends.",
      "It's strange at first. Loving someone but not being in love with them. Caring about their happiness even though it doesn't include you. But it's also freeing. You can appreciate Alex without the pressure of romance. You can support their dreams without sacrificing your own.",
      "You attend Alex's wedding. They attend yours years later. Your partners know the history and aren't threatened by it. That's how you know you've found the right people - they understand that your past with Alex shaped you into who you are now.",
      "Sometimes you wonder about the alternate timeline where it worked out. Where you both bent enough to stay together without breaking. But mostly, you're grateful. Grateful for what you had. Grateful for what you learned. Grateful that love can evolve into something new instead of curdling into bitterness.",
      "On a random Tuesday, Alex texts you a meme that makes you laugh until you cry. You send back a gif. No heavy conversation, no rehashing the past. Just two people who once loved each other romantically and now love each other differently.",
      "It's not the ending you wanted, but it's an ending you can live with. And sometimes, that's the best we can hope for.",
      "THE END"
    ],
    "options": []
  },
  "new-york-apartment-choice": {
    "title": "Finding Home",
    "story": [
      "The real estate agent shows you three options, each within your budget but offering different tradeoffs.",
      "Option A: Hell's Kitchen studio. Tiny but walkable to Alex's office. You'd see each other more, but barely have space to breathe. $3,200/month.",
      "Option B: Brooklyn one-bedroom. Actual space, a real kitchen, but Alex would have a 45-minute commute each way. More room to grow, less time together. $2,800/month.",
      "Option C: Queens two-bedroom. Affordable, spacious, but far from everything. You'd have space for guests and a home office, but Alex would spend 2 hours commuting daily. $2,400/month."
    ],
    "options": [
      {
        "text": "Hell's Kitchen studio - Prioritize proximity to Alex's work and seeing each other daily",
        "arc": "new-york-apartment-hells-kitchen"
      },
      {
        "text": "Brooklyn one-bedroom - Balance space and commute time",
        "arc": "new-york-apartment-brooklyn"
      },
      {
        "text": "Queens two-bedroom - Prioritize space and savings, even if it means less time together",
        "arc": "new-york-apartment-queens"
      }
    ]
  },
  "new-york-apartment-hells-kitchen": {
    "title": "Cozy in Hell's Kitchen",
    "story": [
      "You sign the lease on the Hell's Kitchen studio. 450 square feet of exposed brick and possibility. Alex can walk to work in fifteen minutes. You'll see each other every morning and evening. That matters more than space.",
      "Moving day is chaos. Boxes everywhere, a U-Haul double-parked, your new landlord yelling about blocking the loading zone. The apartment is even smaller than you remembered. Your bed takes up half the room. There's barely space to think, let alone breathe.",
      "But when you finally collapse on the air mattress that night - your furniture won't arrive until tomorrow - Alex pulls you close and whispers, 'We did it. We're really here.' Through the window, the Manhattan skyline glitters like a promise.",
      "Close quarters mean you'll be in each other's space constantly. That could be romantic or suffocating, depending on how you handle it."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-morning"
      }
    ]
  },
  "new-york-apartment-brooklyn": {
    "title": "Brooklyn Bound",
    "story": [
      "You choose the Brooklyn one-bedroom. It's a compromise - not too big, not too small, not too close, not too far. The apartment has hardwood floors, a real kitchen, and windows that actually let in light. You can picture a life here.",
      "Moving day is exhausting but manageable. The movers complain about the three-floor walkup, but once everything's inside, it feels like home. You have a bedroom separate from your living space. You have room to breathe.",
      "Alex does the math on their commute: 45 minutes each way, assuming the subway cooperates. An hour and a half out of every day, gone. 'But look at this place,' they say, spinning around in the empty living room. 'Totally worth it.'",
      "That night, you collapse on the air mattress in your actual bedroom. Through the window, you can hear the neighborhood - conversations in multiple languages, music from a nearby bar, the rumble of the subway. This is Brooklyn. This could be home."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-morning"
      }
    ]
  },
  "new-york-apartment-queens": {
    "title": "Space in Queens",
    "story": [
      "You pick the Queens two-bedroom. It's practical. You'll have a home office for your remote work. Space for friends to visit. Room to grow. The money you save can go toward experiences instead of rent.",
      "Moving day is surprisingly smooth. The movers love the elevator, the super is friendly, and the apartment is even bigger than the photos suggested. You have a second bedroom! A real dining area! Closet space!",
      "But as Alex maps out their commute - subway to subway to walking - the reality sets in. Two hours a day. Ten hours a week. That's a part-time job spent underground, just to get to their actual job.",
      "'It's fine,' Alex says, but you can see them doing the math in their head, calculating what they're giving up. 'We have space. That's what matters.' But you both know they're paying the price for that space.",
      "That night, lying on the air mattress in your spacious bedroom, you wonder if you made the right choice. The silence is nice. But will you feel this far apart in other ways too?"
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-morning"
      }
    ]
  },
  "new-york-first-morning": {
    "title": "The First Morning",
    "story": [
      "Your first morning in New York. Alex's alarm goes off at 6:30 AM. They fumble for their phone, silencing it quickly. You feel them trying to slip out of bed without waking you.",
      "You're awake though. You've been awake since 6:00, listening to the unfamiliar sounds of your new city. Car horns. Sirens. Someone yelling in a language you don't recognize. This is home now.",
      "Alex is moving quietly around the apartment, getting ready for their first day. You can tell they're nervous. Excited, but nervous. This job, this city, this whole move - it's all about to become real."
    ],
    "options": [
      {
        "text": "Get up and make breakfast together. Start your first day as a team.",
        "arc": "new-york-breakfast-together"
      },
      {
        "text": "Pretend to sleep. Let Alex have this morning to themselves to focus.",
        "arc": "new-york-pretend-sleep"
      },
      {
        "text": "Get up but stay quiet. Make coffee and be supportive without being intrusive.",
        "arc": "new-york-quiet-support"
      }
    ]
  },
  "new-york-breakfast-together": {
    "title": "Together at Dawn",
    "story": [
      "You sit up. 'I'm awake. Want me to make coffee?' Alex's face lights up. 'Really? You don't have to—' 'I want to,' you say. And you do.",
      "You make coffee in your new kitchen. It's terrible - you haven't figured out the machine yet and the water tastes weird. But you sit together on boxes that should be holding dishes, sipping bad coffee, and it feels perfect.",
      "'I'm nervous,' Alex admits. 'What if I'm not good enough? What if I made a mistake taking this job?' You take their hand. 'You're going to be amazing. And I'm right here, no matter what.'",
      "Alex leaves at 7:15, kiss goodbye at the door, promising to text throughout the day. You watch them disappear down the street and feel... proud. Scared, but proud. You're doing this together."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-day-alone"
      }
    ]
  },
  "new-york-pretend-sleep": {
    "title": "The Easy Lie",
    "story": [
      "You keep your eyes closed. Your breathing slow and steady. You hear Alex moving carefully, trying not to disturb you. The coffee maker. The closet door. The bathroom fan. All the sounds of someone trying to be considerate.",
      "Part of you wants to get up. To wish them luck on their first day. To be the supportive partner. But another part of you is overwhelmed. This city, this apartment, this new life. You need a few more minutes of not having to be okay.",
      "The apartment door closes softly. Alex is gone. You open your eyes to an empty room in an unfamiliar place. You're alone in New York City. Day one of what might be a very long adventure.",
      "You lie there for another twenty minutes before forcing yourself to get up. The apartment feels bigger and lonelier without Alex in it."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-day-alone"
      }
    ]
  },
  "new-york-quiet-support": {
    "title": "Silent Partnership",
    "story": [
      "You get up quietly and start the coffee maker. Alex comes out of the bathroom, surprised. 'Hey, you're up.' You smile. 'Couldn't sleep anyway. New city sounds.'",
      "You move around each other in the small space. Not talking much, but comfortable in the silence. You hand Alex coffee. They nod thanks. There's an understanding between you - we're in this together, but we both need to process it in our own way.",
      "'Big day,' you finally say. 'Huge day,' Alex agrees. They grab their bag, kiss your cheek. 'I'll text you.' And then they're gone, and you're left with your coffee and an entire day in a brand new city.",
      "You watch them from the window until they turn the corner. Then you turn back to the apartment full of unpacked boxes. Time to figure out who you are in New York."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-day-alone"
      }
    ]
  },
  "new-york-first-day-alone": {
    "title": "Day One: Solo",
    "story": [
      "The apartment is quiet. Too quiet. You're surrounded by boxes and the weight of what you've just done. You left your job, your friends, your entire life to follow Alex to New York. It was the right decision. You keep telling yourself it was the right decision.",
      "Your phone buzzes. Alex: 'Office is INSANE. Good insane. Corner office has a view of the Chrysler Building! How's unpacking?' You look around at the disaster zone. You haven't unpacked a single box.",
      "You have two weeks before your remote work starts. Two weeks to figure out how to be a New Yorker. Two weeks to prove to yourself - and maybe to Alex - that you belong here."
    ],
    "options": [
      {
        "text": "Unpack and organize. Make this place feel like home before Alex gets back.",
        "arc": "new-york-unpack-organize"
      },
      {
        "text": "Get out and explore. The boxes can wait - you need to see your new city.",
        "arc": "new-york-explore-city"
      },
      {
        "text": "Call someone from home. You need a familiar voice right now.",
        "arc": "new-york-call-home"
      }
    ]
  },
  "new-york-unpack-organize": {
    "title": "Nesting",
    "story": [
      "You attack the boxes like they're the enemy. Books on shelves. Clothes in drawers. Kitchen stuff in cabinets. Every item you unpack is a small victory against the chaos. By 4 PM, the apartment looks almost livable.",
      "Your back hurts. You're covered in dust. But when Alex texts 'Leaving office, be home around 7,' you feel a surge of pride. You've been productive. You've built something today.",
      "When Alex walks in at 7:15, exhausted and exhilarated, they stop in the doorway. 'Whoa. You did all this?' You shrug like it's no big deal, but it is. You've turned four walls into a home. That counts for something."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-week"
      }
    ]
  },
  "new-york-explore-city": {
    "title": "Urban Explorer",
    "story": [
      "You leave the boxes. They'll still be there tomorrow. You grab your phone, your wallet, and your sense of adventure. Time to meet New York.",
      "You wander without a plan. Find the nearest bodega. Get a coffee that costs twice what it should. Walk until your feet hurt. The High Line. Washington Square Park. You get lost three times. It's perfect.",
      "By the time Alex texts 'Leaving office, be home around 7,' you're exhausted but energized. You've walked 23,000 steps according to your phone. You've seen your new city. You've claimed it as yours.",
      "When Alex comes home to an apartment still full of boxes, they don't say anything. They just ask about your day, and you have stories to tell. That feels more important than organized closets."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-week"
      }
    ]
  },
  "new-york-call-home": {
    "title": "Lifeline",
    "story": [
      "You call your best friend back home. They answer on the second ring. 'How's the big city?' And just like that, you're crying. Not sad crying. Overwhelmed crying. 'It's so much,' you say. 'I know,' they say. 'But you've got this.'",
      "You talk for two hours. About Alex's new job. About the apartment. About your fears that you've made a mistake, that you don't belong here, that you're just the person who tagged along. Your friend listens and reminds you of who you are.",
      "When you hang up, it's 4 PM and you haven't unpacked a single box. But you feel more grounded. Sometimes you need to hear a voice that knows the old you to remember that the new you is still in there somewhere.",
      "Alex texts at 6:45. 'Leaving office! Can't wait to hear about your day.' You look around at the boxes. Maybe tomorrow."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-first-week"
      }
    ]
  },
  "new-york-first-week": {
    "title": "Week One",
    "story": [
      "The first week has a rhythm. Alex leaves at 7 AM. You wake up alone in a city that doesn't know your name. Alex comes home at 7 PM, exhausted but electric with new-job energy. They tell you about meetings, projects, the free lunch catering. You tell them about... what?",
      "By Friday, you've figured out the subway. Located the nearest Target. Found a decent bodega where the owner calls you 'friend' even though you've only been there three times. Small victories that feel both significant and pathetically small.",
      "Friday night, Alex comes home with an announcement. 'The team wants to grab drinks after work next Friday. You should come. Meet everyone. See my office.' There's something in their voice - eagerness mixed with nerves. Like they want to show you off but are also worried you won't fit in.",
      "You have a week to decide how you want to show up to that."
    ],
    "options": [
      {
        "text": "Enthusiastically agree. You want to meet Alex's new world.",
        "arc": "new-york-week-two-excited"
      },
      {
        "text": "Agree but feel nervous. You're not sure you're ready for this.",
        "arc": "new-york-week-two-nervous"
      },
      {
        "text": "Suggest maybe next time. You need more time to settle in first.",
        "arc": "new-york-week-two-decline"
      }
    ]
  },
  "new-york-week-two-excited": {
    "title": "Ready to Shine",
    "story": [
      "The second week flies by. You spend it preparing - mentally rehearsing small talk, planning your outfit, looking up Alex's company online so you sound informed. You want to make a good impression. You want Alex to be proud to introduce you.",
      "You practice saying things like 'I'm transitioning my career remotely' instead of 'I don't have a job yet.' You prepare anecdotes that make you sound interesting and accomplished. You're determined to be the partner who enhances Alex's reputation, not the one who drags it down.",
      "By Friday, you're as ready as you'll ever be. Alex seems excited that you're excited. 'Everyone's going to love you,' they promise. You hope they're right."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-settling"
      }
    ]
  },
  "new-york-week-two-nervous": {
    "title": "The Weight of Expectations",
    "story": [
      "The second week is spent anxious. You keep thinking about that happy hour. What if you don't fit in? What if Alex's colleagues are all Type-A corporate climbers and you're just... you? What if they wonder why Alex brought their tagalong partner to a work event?",
      "You try to distract yourself. Unpack more boxes. Walk through different neighborhoods. Start looking at job postings even though you have two weeks before your remote work begins. Anything to not think about Friday.",
      "But Friday comes anyway. Alex bounces through the door Wednesday evening: 'Can't wait for you to meet everyone!' Your stomach twists. But you smile. 'Me too.'",
      "You're doing this. You're going to show up and be supportive and try not to let your insecurity show."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-settling"
      }
    ]
  },
  "new-york-week-two-decline": {
    "title": "Taking Your Time",
    "story": [
      "You suggest maybe the next one. 'I'm still settling in,' you say. 'I don't want to be overwhelmed yet. Is that okay?' You watch Alex's face carefully. Are they disappointed? Relieved? It's hard to tell.",
      "'Of course,' Alex says. 'No pressure. There will be other events.' They seem genuine, but you notice they don't push back or try to convince you. Is that respect for your boundaries or disappointment in your lack of enthusiasm?",
      "The second week passes quietly. Alex goes to the Friday drinks without you. Comes home around 9 PM, a little tipsy, with stories about colleagues you don't know. You listen and nod and laugh at the right moments. But there's a gap opening up. A world Alex is entering that you're choosing to stay outside of.",
      "For now, that feels safer. But you wonder if safe is the same as smart."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-settling"
      }
    ]
  },
  "new-york-settling-gym": {
    "title": "Endorphins and Strangers",
    "story": [
      "You join a gym in your neighborhood. It's expensive - everything in New York is expensive - but the first class is free. You show up to a 6 PM spin class, self-conscious and sweaty before you even start.",
      "The instructor is aggressively positive. The music is too loud. Everyone else seems to know exactly what they're doing. But by the end, you're drenched in sweat and somehow feel lighter. Not happy, but less heavy.",
      "You start going three times a week. You learn the other regulars' faces even though you never talk. There's the woman who always takes the bike by the window. The guy who mouth-breathes through the whole class. The instructor who yells 'YOU'VE GOT THIS' like she actually believes it.",
      "It's not friendship, but it's routine. It's something that's yours. And right now, that's enough."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-settling-networking": {
    "title": "The Professional Smile",
    "story": [
      "You find a young professionals networking event in your industry. It's at a bar in Midtown, full of people in business casual, clutching drinks and business cards like lifelines. Everyone is performing confidence. You join the performance.",
      "You shake hands. You make small talk. You laugh at jokes that aren't funny. You exchange LinkedIn connections with people you'll never message. It's exhausting and artificial, but you leave with five new contacts and one coffee invitation for next week.",
      "The coffee meeting is with Jenna, a project manager at a tech startup. She's been in New York for three years. 'The first six months are brutal,' she says. 'But it gets better. You find your people. You find your rhythm.' You want to believe her.",
      "You keep going to events. You keep collecting contacts. You're building something, slowly. A professional identity separate from being Alex's partner. That has to count for something."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-settling-hobby": {
    "title": "Finding Joy",
    "story": [
      "You join a cooking class in Chelsea. It's ridiculous and expensive and exactly what you need. Ten strangers making pasta from scratch while drinking wine and laughing when things go wrong. Nobody asks what you do for work. Nobody cares that you just moved here. You're just people making food together.",
      "You meet Sarah, who moved here from Seattle two years ago. Marcus, who's lived in New York his whole life but is 'bad at making friends as an adult.' Kira, who's going through a divorce and taking cooking classes to avoid her empty apartment. Real people with real struggles.",
      "After class, you all go to a bar. You talk about New York, about loneliness, about how hard it is to build a life from scratch. Someone suggests making it a regular thing - cooking class and drinks every other Wednesday.",
      "You say yes. You have friends now. Maybe. Tentative friends. People who know your name and answer your texts. It's a start."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-settling-alex-circle": {
    "title": "Borrowed Social Life",
    "story": [
      "You tell Alex you want to be more involved in their work world. 'Include me,' you say. 'I want to meet your people. Be part of your life here.' Alex lights up. 'Really? Yeah! There's a happy hour next week. And Sofia from marketing is having a dinner party...'",
      "You become a fixture at Alex's work adjacent events. You learn everyone's names. Remember their kids' ages. Ask thoughtful follow-up questions. You become known as Alex's supportive partner. The person who always shows up, always smiles, always plays the role perfectly.",
      "It's fine. Really. These people are nice. The conversations are pleasant. You're being social, getting out of the apartment, supporting Alex's career. All good things.",
      "But you're also always 'Alex's partner' instead of just yourself. You have no stories that don't start with 'we.' You're building Alex's social life, not your own. And slowly, quietly, you're disappearing into their shadow."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-month-one-pre": {
    "title": "The Invitation",
    "story": [
      "One month in, Alex's company throws a happy hour. 'You should come,' Alex says over breakfast. 'Meet the team. See my office. It'll be fun.'",
      "There's something in their voice - eagerness mixed with... is that nervousness? You can't quite place it.",
      "Your remote work has started. You're finding your rhythm with video calls and deadlines. The apartment feels less like a cage and more like a workspace. You have some semblance of a routine. But Alex's work world is still mostly a mystery to you.",
      "Names without faces. Stories without context. Jordan, the colleague Alex keeps mentioning, is especially abstract. They're working on the Morrison account together. Alex talks about Jordan like they're brilliant and hilarious and just a bit intense. You're curious to finally meet this person."
    ],
    "options": [
      {
        "text": "You're excited to meet Alex's colleagues and see their office.",
        "arc": "new-york-month-one-excited"
      },
      {
        "text": "You're nervous but willing. First impressions matter.",
        "arc": "new-york-month-one-nervous"
      },
      {
        "text": "You're skeptical. Work events are always awkward.",
        "arc": "new-york-month-one-skeptical"
      }
    ]
  },
  "new-york-month-one-excited": {
    "title": "Game Face On",
    "story": [
      "You agree enthusiastically. This is what you've been waiting for - a chance to see Alex in their element, to understand this huge part of their life. You spend the day planning your outfit, practicing conversation starters, psyching yourself up.",
      "When you arrive at the office that evening, you're determined to make a good impression. The office is everything Alex described and more. Floor-to-ceiling windows, modern furniture, a coffee bar that would make Starbucks jealous. You can see why Alex loves it here.",
      "Alex introduces you around, clearly proud. Marcus from accounting. Sofia from marketing. Everyone is friendly, polished, confident. You match their energy, smiling and shaking hands and making the kind of small talk that greases the wheels of professional socializing."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-jordan-first-meeting"
      }
    ]
  },
  "new-york-month-one-nervous": {
    "title": "Stepping Into Their World",
    "story": [
      "You agree, but your stomach twists with anxiety. What if you say something wrong? What if Alex's colleagues don't like you? What if you're awkward and Alex regrets inviting you? But you put on your good outfit - the one that says 'I'm successful and definitely not feeling insecure' - and show up anyway.",
      "The office is intimidating. Everything is glass and chrome and expensive. People move with purpose, even at a happy hour. Everyone seems to know exactly who they are and where they belong. You smile and try to project confidence you don't feel.",
      "Alex introduces you around with obvious pride, which helps. Marcus from accounting. Sofia from marketing. Everyone is polite. You shake hands, make appropriate noises, try to remember names you'll probably forget."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-jordan-first-meeting"
      }
    ]
  },
  "new-york-month-one-skeptical": {
    "title": "Professional Theater",
    "story": [
      "You agree, but without much enthusiasm. Work events are always performative. Everyone pretending to be friends, pretending to care about each other's weekends, pretending the forced fun is actually fun. But Alex wants you there, so you'll go.",
      "The office is exactly what you expected - aggressively trendy, trying too hard to be cool. Floor-to-ceiling windows that probably cost more than your apartment. A coffee bar with beans that have their own origin story. Corporate money pretending not to be corporate.",
      "Alex introduces you around. You smile and nod and shake hands. Marcus from accounting seems nice enough. Sofia from marketing has kind eyes. You're going through the motions, waiting for the part where you can leave without being rude."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-jordan-first-meeting"
      }
    ]
  },
  "new-york-jordan-first-meeting": {
    "title": "And Then There's Jordan",
    "story": [
      "Then Alex says, 'Oh, and this is Jordan. We're working on the Morrison account together.'",
      "Jordan is... exactly what you were afraid of. Charming smile, expensive suit, effortless charisma. The kind of person who makes everyone around them feel slightly less interesting. They shake your hand with perfect pressure - firm but not aggressive.",
      "'I've heard so much about you,' Jordan says, making eye contact that lasts just a beat too long. 'Alex talks about you constantly.' But there's something in the way they look at Alex when they say it. Something that makes your stomach twist.",
      "You notice things. Small things, probably meaningless things. The way Jordan touches Alex's arm when they laugh. The inside joke about the Morrison presentation that you're not part of. The way Alex's energy changes when Jordan walks over - more animated, more engaged.",
      "This is Jordan. The name you've been hearing for weeks. And now they have a face, a presence, a reality. You're not sure how you feel about that reality."
    ],
    "options": [
      {
        "text": "Be warm and friendly to Jordan. Maybe your initial discomfort is just in your head.",
        "arc": "new-york-jordan-meeting-friendly"
      },
      {
        "text": "Be polite but reserved. Keep professional distance.",
        "arc": "new-york-jordan-meeting-reserved"
      },
      {
        "text": "Be subtly territorial. Make it clear Alex is spoken for.",
        "arc": "new-york-jordan-meeting-territorial"
      }
    ]
  },
  "new-york-jordan-meeting-friendly": {
    "title": "Benefit of the Doubt",
    "story": [
      "You decide to give Jordan a chance. Your insecurity is probably making you see threats where there aren't any. You smile genuinely, ask about their work on the Morrison account, express interest in their career path. Kill them with kindness.",
      "Jordan responds well. They're actually pretty easy to talk to. Funny, self-deprecating, genuinely complimentary about Alex's work ethic. 'I'd be lost without them,' Jordan says. 'They're carrying half the project.' Alex blushes at the praise.",
      "You spend twenty minutes talking to Jordan about New York, about the company, about adjusting to corporate culture. They're nice. Really nice. Maybe you were overthinking the arm touch, the energy shift. Maybe they're just Alex's colleague and nothing more.",
      "By the time you and Alex leave, you feel silly about your initial reaction. Jordan is fine. This is fine. Everything is fine."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-jordan-meeting-reserved": {
    "title": "Polite Distance",
    "story": [
      "You smile but don't commit. You answer Jordan's questions briefly. You don't ask follow-ups. You're polite - not rude, never rude - but you're not warm either. You're establishing boundaries without saying a word.",
      "Jordan seems to notice the distance. They try a few times to engage you, then gracefully back off, turning their attention back to Alex and the project talk. You stand there, present but not participating, watching the way they interact.",
      "Alex notices too. You catch them glancing at you with a slightly confused expression. Like they're trying to figure out why you're being so reserved. You'll probably have to explain later. Or maybe you won't.",
      "By the time you leave, you haven't learned much about Jordan except that Alex clearly enjoys their company. And that feels like enough information for now."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-jordan-meeting-territorial": {
    "title": "Marking Territory",
    "story": [
      "You slip your arm around Alex's waist. You make a point of mentioning 'our apartment,' 'our move,' 'our life together.' You laugh at Alex's jokes just a bit louder than necessary. You're subtle about it - you think you're subtle about it - but you're making your presence known.",
      "Jordan gets the message. You can see it in the slight tightening around their eyes, the way they take a small step back, the way their hand doesn't land on Alex's arm again. Good. Let them know where things stand.",
      "Alex doesn't seem to notice the undercurrent. They're oblivious, happily talking about work, introducing you to more people, showing off their office. But you notice. And Jordan notices. And now there's a line drawn in the sand, invisible but unmistakable.",
      "On the walk home, Alex seems happy. 'Everyone loved you,' they say. You smile and squeeze their hand. Mission accomplished."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "paris-apartment-choice": {
    "title": "Finding Your Parisian Home",
    "story": [
      "The real estate agent - who speaks rapid French and minimal English - shows you three apartments. Each one represents a different vision of your Paris life.",
      "Option A: 11th arrondissement, fourth floor walkup. Tiny but charming, with shutters that open to rooftops and Sacré-Cœur in the distance. Close to Alex's office. €1,400/month.",
      "Option B: Marais, third floor. More space, exposed beams, a real bathroom. Trendy neighborhood, great cafés, tourists everywhere. Alex would have a 25-minute metro ride. €1,700/month.",
      "Option C: 20th arrondissement, ground floor. Actually affordable, quiet residential area, real Parisians instead of expats. But far from everything. Alex would commute 45 minutes each way. €1,100/month."
    ],
    "options": [
      {
        "text": "11th arrondissement - Prioritize being close to Alex's work and seeing the city from your windows",
        "arc": "paris-apartment-11th"
      },
      {
        "text": "Marais - Balance charm, space, and location in the heart of things",
        "arc": "paris-apartment-marais"
      },
      {
        "text": "20th arrondissement - Prioritize authenticity and affordability over convenience",
        "arc": "paris-apartment-20th"
      }
    ]
  },
  "paris-apartment-11th": {
    "title": "Rooftop Views",
    "story": [
      "You choose the fourth floor walkup in the 11th. The stairs are brutal - you're wheezing by the third floor - but when you open those shutters and see the rooftops stretching toward Sacré-Cœur, it's worth it.",
      "The apartment is tiny. Your bed takes up most of the bedroom. The kitchen is basically a corner. But the light! The light pours through those windows like liquid gold, and you understand why everyone romanticizes Paris.",
      "Moving day is chaos in French. The movers refuse to carry furniture up four flights. You and Alex haul boxes until your legs shake. But that night, exhausted and surrounded by unpacked chaos, you open a bottle of cheap wine and look out at your new city.",
      "'We're really in Paris,' Alex says, arm around your shoulders. 'We're really in Paris,' you echo. And for one perfect moment, everything feels possible."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-morning"
      }
    ]
  },
  "paris-apartment-marais": {
    "title": "Heart of the City",
    "story": [
      "You pick the Marais apartment. It's more expensive, but you can actually have people over. The exposed beams give it character. The bathroom has a real shower, not just a handheld thing over a tub. This is a place you can build a life.",
      "The neighborhood is perfect. Cafés on every corner. A bakery that makes bread so good you want to cry. Museums within walking distance. The only downside: tourists. So many tourists. But you'll learn to navigate around them.",
      "Moving day is surprisingly manageable. The building has an elevator. The super speaks some English. By evening, most of your things are in place. You collapse on your new couch - an actual couch! - and Alex brings you wine from the shop downstairs.",
      "'I think we're going to be happy here,' Alex says. Looking around your beautiful apartment in the heart of Paris, you think they might be right."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-morning"
      }
    ]
  },
  "paris-apartment-20th": {
    "title": "Real Paris",
    "story": [
      "You go for the 20th arrondissement. It's not glamorous. It's not what people picture when they think 'Paris.' But it's real. Families. Immigrants. People who actually live here instead of visiting. And the price is right.",
      "The apartment is ground floor, which means you hear every person walking by. But it also means no stairs. You have space. An actual bedroom separate from your living room. Storage. For Paris, this is luxury.",
      "The commute worries you. Forty-five minutes on the Metro each way means Alex will lose an hour and a half per day. But they wave it off. 'I'll read,' they say. 'It's fine.' You hope they mean it.",
      "Moving day is easy. Ground floor, helpful neighbors who speak no English but help anyway. That night, you sit in your quiet apartment and hear real life happening outside - conversations in Arabic and Portuguese and French, music from the apartment above, a child laughing. This is home now."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-morning"
      }
    ]
  },
  "paris-first-morning": {
    "title": "Premier Matin",
    "story": [
      "Your first morning in Paris. Alex's alarm goes off at 7:00 AM. They fumble for their phone, squinting at the unfamiliar bedroom. The light through the windows is different here. Everything is different here.",
      "You're already awake. You've been awake since 6:00, listening to the sounds of a Paris morning. Church bells. Street cleaners. Someone yelling in French. It's beautiful and terrifying in equal measure.",
      "Alex moves quietly, getting ready for their first day. You can see the nerves in the way they check their outfit twice, practice pronouncing their boss's name, gather their things with trembling hands. This job, this city, this life - it's all about to become real."
    ],
    "options": [
      {
        "text": "Get up and make breakfast. Send them off with coffee and encouragement.",
        "arc": "paris-breakfast-together"
      },
      {
        "text": "Pretend to sleep. Let them have this moment alone to gather themselves.",
        "arc": "paris-pretend-sleep"
      },
      {
        "text": "Get up but let them lead. Be present without being intrusive.",
        "arc": "paris-quiet-presence"
      }
    ]
  },
  "paris-breakfast-together": {
    "title": "Café au Lait",
    "story": [
      "You get up. 'I'm making coffee.' Alex's face floods with relief. You stumble through using the unfamiliar coffee maker, cursing in English when you can't figure out the buttons. Alex laughs, the tension breaking.",
      "You sit together with terrible coffee - you definitely need to figure out this machine - and croissants from yesterday that are still somehow better than anything back home. 'I'm terrified,' Alex admits. 'My French is awful. What if I screw this up?'",
      "'You're going to be amazing,' you say, taking their hand. 'And if you screw up, you'll do it in French, which makes it automatically more sophisticated.' Alex laughs, kisses you, heads out the door.",
      "You watch from the window until they disappear around the corner. Then you turn back to your apartment in Paris and think: what now?"
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-day-alone"
      }
    ]
  },
  "paris-pretend-sleep": {
    "title": "Silent Support",
    "story": [
      "You keep your eyes closed. Let Alex have this morning to themselves. You hear them moving around - the coffee maker, the closet, the bathroom. The sounds of someone trying to be quiet in an unfamiliar space.",
      "Part of you wants to get up. To wish them luck. To be the supportive partner. But you're also overwhelmed. This city, this language, this massive change you've both committed to. You need a few more minutes of not having to be okay.",
      "The door closes. Alex is gone. You open your eyes to morning light in a Paris apartment. You're alone in a city where you don't speak the language. Day one of what might be a beautiful adventure or a terrible mistake.",
      "You lie there for another twenty minutes before forcing yourself up. The apartment feels bigger and lonelier without Alex in it."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-day-alone"
      }
    ]
  },
  "paris-quiet-presence": {
    "title": "Companionable Silence",
    "story": [
      "You get up quietly. Start water boiling. Alex emerges from the bathroom, surprised but pleased to see you. You work in companionable silence - you making coffee, them getting dressed, both of you moving in the careful dance of people who love each other but don't need to fill every moment with words.",
      "You hand them coffee. They accept with a grateful nod. You sit together on boxes that should be furniture, watching Paris wake up through your windows. 'Big day,' you finally say. 'Terrifying day,' Alex admits.",
      "'You've got this.' 'We've got this,' Alex corrects, squeezing your hand. Then they're gone, and you're left with your coffee and a whole day in a brand new country.",
      "You finish your coffee slowly, watching the street below. This is your life now. Time to figure out what that means."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-day-alone"
      }
    ]
  },
  "paris-first-day-alone": {
    "title": "Seule Paris",
    "story": [
      "The apartment is quiet. You're surrounded by boxes and jetlag and the weight of what you've just done. You left your country, your language, your entire familiar world to follow Alex to Paris. It was romantic in theory. In practice, it's terrifying.",
      "Your phone buzzes. Alex: 'Office is beautiful. Everyone speaks so fast! How's unpacking?' You look around at the disaster zone. You haven't unpacked anything. You've barely moved.",
      "You have a month before your remote work starts. A month to learn enough French to survive. A month to prove to yourself - and maybe to Alex - that you belong here."
    ],
    "options": [
      {
        "text": "Unpack and nest. Make this place feel like home.",
        "arc": "paris-unpack-nest"
      },
      {
        "text": "Get out and explore. You need to see your new city.",
        "arc": "paris-explore-city"
      },
      {
        "text": "Find a cafe and people-watch. Ease into Paris slowly.",
        "arc": "paris-cafe-slow"
      }
    ]
  },
  "paris-unpack-nest": {
    "title": "Creating Home",
    "story": [
      "You attack the boxes like they're the enemy. Every item unpacked is a small victory. Books on shelves. Clothes in the armoire. Kitchen items in cabinets that smell like someone else's life. By afternoon, the apartment looks almost livable.",
      "You take breaks to figure out how things work. The washing machine has settings you don't recognize. The stove is gas, not electric. The light switches are in unexpected places. Everything familiar is slightly wrong, and everything new is slightly intimidating.",
      "But by the time Alex texts 'Leaving office! Be home soon!', you've made progress. The apartment has gone from chaos to merely messy. When Alex walks in, exhausted and overwhelmed, they stop in the doorway. 'You did all this?' You shrug. 'We needed a home, not a storage unit.'",
      "That night you eat takeout on actual furniture. Small victories."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-week"
      }
    ]
  },
  "paris-explore-city": {
    "title": "Into the Unknown",
    "story": [
      "You leave the boxes for later. You need to meet Paris. You grab your phone, your wallet, and your courage. Time to get lost.",
      "Everything is beautiful and frustrating in equal measure. The buildings, the bridges, the way the light hits the Seine. But also: you can't read the metro map. You don't know how to ask for directions. You accidentally order three coffees instead of one because your French is terrible.",
      "You wander for hours. Notre-Dame. The Latin Quarter. You get lost six times and nearly cry twice. But you also feel alive. You're in Paris. Actually in Paris. Walking streets Hemingway walked, seeing sights artists painted. It's overwhelming and perfect.",
      "When Alex comes home, the apartment is still full of boxes. But you have stories. About getting lost, about the kind woman who helped you, about the most perfect croissant you've ever eaten. Alex listens and laughs and suddenly the boxes don't matter as much."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-week"
      }
    ]
  },
  "paris-cafe-slow": {
    "title": "The Art of Watching",
    "story": [
      "You find a cafe two blocks from your apartment. Nothing fancy - just tables on the sidewalk and coffee that costs half what it would in New York. You order in broken French. The waiter smiles kindly, responds in English. You feel like a tourist. You are a tourist.",
      "You sit for three hours. Watching. Parisian women in scarves that somehow look elegant instead of trying too hard. Old men reading newspapers. Students arguing passionately about something you can't understand. The rhythm of a city that doesn't care if you figure it out or not.",
      "You realize: you could sit here every day. Learn the patterns. Become a regular. Let Paris reveal itself slowly instead of trying to conquer it all at once. There's no rush. You have time.",
      "When Alex comes home, you're calm. Centered. The boxes can wait. Paris isn't going anywhere, and neither are you."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-first-week"
      }
    ]
  },
  "paris-first-week": {
    "title": "La Première Semaine",
    "story": [
      "The first week establishes a rhythm. Alex leaves at 8:00 AM for the office near Republique. You wake up alone in a city that doesn't speak your language. Alex comes home at 7:00 PM with stories about colleagues, projects, the amazing coffee machine at work.",
      "You're drowning. The French on signs might as well be hieroglyphics. The metro system is a mystery. You went to the grocery store and nearly cried because you couldn't figure out which milk was which. Being incompetent as an adult is humbling and horrible.",
      "But there are small victories. You found a bakery where the owner now recognizes you. You learned how to say 'encore du pain, s'il vous plaeet.' You figured out the washing machine. Tiny steps that feel enormous.",
      "Friday night, Alex comes home with news. 'Riley wants to grab drinks next Friday. Show us around, since they've been here three years. You'll love them - they're originally from the States too.' There's excitement in Alex's voice. And something else. Nervousness?"
    ],
    "options": [
      {
        "text": "Agree enthusiastically. You need someone who can help you navigate Paris.",
        "arc": "paris-week-two-eager"
      },
      {
        "text": "Agree but feel cautious. You remember Riley had feelings for Alex once.",
        "arc": "paris-week-two-cautious"
      },
      {
        "text": "Suggest maybe just Alex goes. You're not ready for socializing yet.",
        "arc": "paris-week-two-decline"
      }
    ]
  },
  "paris-week-two-eager": {
    "title": "Looking for Connection",
    "story": [
      "You jump at the chance. Riley has been here three years. They know the good restaurants, the hidden gems, how to navigate French bureaucracy. You need that knowledge. You need an ally who speaks English and understands what it's like to be foreign.",
      "The second week passes in preparation. You practice French phrases. You Google Riley online (their Instagram is impressive - stylish photos at trendy locations). You tell yourself this is networking. You're building a Paris support system. The fact that Riley once had feelings for Alex is history. Ancient history.",
      "By Friday, you're actually excited. Alex seems pleased that you're pleased. 'Riley's great,' they promise. 'You're going to get along so well.' You hope they're right."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "paris-week-two-cautious": {
    "title": "Guarded Hope",
    "story": [
      "You agree, but you remember what Alex told you. Riley had feelings for Alex in college. Feelings that might have been mutual if timing had been different. That was years ago, sure. But feelings don't always respect timelines.",
      "The second week passes slowly. You prepare mentally - telling yourself not to be jealous, not to be insecure, not to see threats where there aren't any. Riley is Alex's friend and colleague. You can handle this like an adult.",
      "But you also pay attention. You notice how often Riley's name comes up. 'Riley showed me this great cafe.' 'Riley says Parisians are cold until they're warm.' 'Riley thinks my French pronunciation is getting better.' Riley, Riley, Riley.",
      "By Friday, you're nervous. But you smile and act excited because that's what partners do."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "paris-week-two-decline": {
    "title": "Boundaries",
    "story": [
      "You suggest Alex goes without you. 'I'm still adjusting,' you say. 'I don't think I'm ready for socializing in French yet. Is that okay?' You watch Alex's face. Disappointment? Relief?",
      "'Of course,' Alex says. 'No pressure. Riley will understand.' But you notice they don't argue. Don't try to convince you. Is that respecting your boundaries or being relieved they can see Riley alone?",
      "The second week passes. You're alone more. Alex goes to Friday drinks. Comes home around 10 PM, speaking rapid French-accented English about Riley showing them a secret bookshop, a perfect wine bar, a shortcut through the Marais.",
      "You listen and smile and try not to calculate how many hours Alex spent with Riley today. Try not to wonder what you're missing by staying home. Try not to feel like you're already losing a competition you didn't know you were in."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "new-york-weekend-one": {
    "title": "Saturday Morning",
    "story": [
      "It's your first Saturday in New York. Alex wakes up early, energized. 'Want to explore today? We could hit a museum, walk the Brooklyn Bridge, find that brunch place everyone raves about.'",
      "You're exhausted. The week of unpacking, adjusting, trying to figure out your new life has caught up with you. Part of you wants to go, to be the fun adventurous partner. Part of you wants to stay in bed and pretend none of this is real.",
      "You also have work emails piling up. Your remote job starts Monday, and you're not prepared. And the apartment is still half-unpacked. Adulthood is just endless choices between things you should do."
    ],
    "options": [
      {
        "text": "Go explore with Alex. Quality time is more important than productivity right now.",
        "arc": "new-york-weekend-adventure"
      },
      {
        "text": "Suggest a low-key day. Maybe just a walk and then rest.",
        "arc": "new-york-weekend-lowkey"
      },
      {
        "text": "Tell Alex you need to work. They can explore without you.",
        "arc": "new-york-weekend-solo"
      }
    ]
  },
  "new-york-weekend-adventure": {
    "title": "Adventurers",
    "story": [
      "You push through exhaustion. 'Let's do it all,' you say. Alex grins, and you spend the day being tourists in your new city. The Met. The Brooklyn Bridge. Overpriced brunch where you wait forty-five minutes for a table.",
      "It's exhausting and perfect. You take selfies with the Manhattan skyline. You get lost in Central Park. You feel like the couple you were when you first fell in love - adventurous, spontaneous, choosing each other over everything else.",
      "By the time you get home, your feet hurt and you're broke and you haven't dealt with your work emails. But Alex says 'Best day ever' and kisses you, and you think maybe priorities are about what you choose, not what you sacrifice."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-monday-work-starts"
      }
    ]
  },
  "new-york-weekend-lowkey": {
    "title": "Gentle Saturday",
    "story": [
      "'Let's take it easy,' you suggest. 'Just a walk? I need to decompress.' Alex looks slightly disappointed but nods. 'Whatever you need.'",
      "You walk through your neighborhood. No plan, no destination. Find a coffee shop. Sit in a park. Talk about everything and nothing. It's not Instagram-worthy, but it's real. Alex tells you about work stress. You admit you're more overwhelmed than you've been letting on.",
      "'We're in this together,' Alex reminds you. 'We don't have to conquer New York in a week.' You squeeze their hand. Some days, just existing in the same space as someone you love is enough."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-monday-work-starts"
      }
    ]
  },
  "new-york-weekend-solo": {
    "title": "Separate Saturdays",
    "story": [
      "'I really need to prep for Monday,' you say. 'You should go explore. I'll be boring anyway.' Alex's face falls slightly. 'You sure?' You nod, already feeling guilty.",
      "Alex leaves around 10 AM. You work for two hours, then spend three hours scrolling social media and feeling sorry for yourself. You could have gone. You should have gone. But you also needed space, needed time alone to process everything.",
      "Alex comes home at 5 PM with stories and photos. You smile and listen and don't mention that you spent most of the day doing nothing. A gap is forming. Small, barely noticeable. But gaps have a way of growing if you're not careful."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-monday-work-starts"
      }
    ]
  },
  "new-york-monday-work-starts": {
    "title": "Work From Home",
    "story": [
      "Monday. Your remote work officially begins. Alex leaves for the office at 7 AM. You roll out of bed at 8:45, make coffee, and sit at your makeshift desk (a folding table from Target). Welcome to working from home in a city where you have no friends.",
      "The video calls are fine. Your coworkers are nice. The work is familiar. But between meetings, you're alone. So alone. The apartment is quiet except for sirens and car horns outside. You eat lunch at your desk. You don't talk to another human being in person all day.",
      "At 6 PM, you close your laptop. You've been productive. You've done your job. But you're also desperate for Alex to come home so you can hear another voice, see another face, remember that you're not totally alone in this city.",
      "Alex texts at 6:15: 'Jordan and I are stuck on this presentation. Gonna be another hour. Order dinner without me?' Your heart sinks."
    ],
    "options": [
      {
        "text": "Text back supportively. You understand work emergencies.",
        "arc": "new-york-supportive-response"
      },
      {
        "text": "Text back that you're disappointed but try to hide it.",
        "arc": "new-york-hidden-disappointment"
      },
      {
        "text": "Call them. You need to hear their voice, explain you had a hard day.",
        "arc": "new-york-call-explain"
      }
    ]
  },
  "new-york-supportive-response": {
    "title": "Understanding Partner",
    "story": [
      "You text: 'No problem! Good luck with the presentation. I'll save you some dinner.' You mean it. Work is work. Alex is building something important.",
      "But alone in the apartment, eating takeout by yourself, you feel the loneliness like a physical weight. This is your life now. Waiting for Alex to have time for you. Being understanding while feeling invisible.",
      "Alex comes home at 8:30, apologetic and exhausted. You smile and warm up dinner and listen to stories about the presentation. You're being the perfect partner. But inside, you're keeping score. And that never ends well."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-week-three"
      }
    ]
  },
  "new-york-hidden-disappointment": {
    "title": "Swallowed Words",
    "story": [
      "You text: 'Ok. See you when you get home.' Brief. Neutral. With just enough edge that Alex might notice you're upset. Or might not. You watch the three dots appear and disappear. Appear and disappear. Finally: 'Thanks for understanding ❤️'",
      "Do you understand? You're not sure. You eat dinner alone, again. You try to read but can't focus. You're angry and guilty about being angry and lonely and frustrated that you can't just say 'I need you to come home.'",
      "Alex arrives at 8:30. 'Sorry about that.' You shrug. 'It's fine.' It's not fine. But saying so feels needy, feels like you're being the demanding partner. So you swallow the words and let them poison you from the inside."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-week-three"
      }
    ]
  },
  "new-york-call-explain": {
    "title": "Honest Moment",
    "story": [
      "You call. Alex answers, surprised. 'Hey, what's up?' You hear office noise in the background. 'I had a rough first day,' you admit. 'I know you're busy, I just... I needed to hear your voice.'",
      "Silence. Then: 'I'm so sorry. I didn't even think to check in. How was it really?' You talk for five minutes. About the loneliness. About missing human contact. About needing them. It's vulnerable and scary.",
      "'I'm wrapping up right now,' Alex says. 'I'll be home in twenty minutes. We'll order good food and you can tell me everything. Jordan can finish this without me.' You hear Alex closing their laptop. They're choosing you.",
      "They come home. You talk. Really talk. About adjusting, about loneliness, about needing to check in with each other more. It's not easy, but it's honest. And honesty is how you survive hard transitions together."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-week-three"
      }
    ]
  },
  "new-york-week-three": {
    "title": "Three Weeks In",
    "story": [
      "Three weeks. You're finding a rhythm, even if it's not always comfortable. Work, dinner, sleep, repeat. Alex's name for Jordan comes up constantly. 'Jordan suggested...' 'Jordan thinks...' 'Jordan and I are...' You try not to keep count. You keep count anyway.",
      "Wednesday evening, Alex comes home excited. 'Jordan invited us to their place for dinner this weekend. They want to get to know you better. Are you free Saturday?' There's hope in Alex's voice. They want you to like Jordan. They want their worlds to blend.",
      "You think about the happy hour where you met Jordan. The charm, the charisma, the easy connection with Alex. You think about how much Jordan's name has invaded your home. You have to decide how to navigate this."
    ],
    "options": [
      {
        "text": "Accept enthusiastically. Time to give Jordan a real chance.",
        "arc": "new-york-dinner-accept"
      },
      {
        "text": "Accept reluctantly. You'll go but you're not excited about it.",
        "arc": "new-york-dinner-reluctant"
      },
      {
        "text": "Decline politely. You're not ready to socialize with Jordan yet.",
        "arc": "new-york-dinner-decline"
      }
    ]
  },
  "paris-weekend-one": {
    "title": "Premier Weekend",
    "story": [
      "Your first Saturday in Paris. Alex wakes up energized. 'Let's explore! The Louvre, the Eiffel Tower, maybe a boat ride on the Seine?' They're speaking in that excited voice that makes you want to say yes to everything.",
      "But you're exhausted. And overwhelmed. And secretly terrified about trying to navigate a day in a city where you can't speak the language. What if you need to order food? What if you get lost? What if everyone realizes you're a fraud who doesn't belong here?",
      "Also, you should probably unpack more. And maybe study French. And definitely figure out how to set up your work computer before Monday."
    ],
    "options": [
      {
        "text": "Push through anxiety. This is Paris! You're going to explore together.",
        "arc": "paris-weekend-adventure"
      },
      {
        "text": "Suggest staying in the neighborhood. Baby steps into your new city.",
        "arc": "paris-weekend-neighborhood"
      },
      {
        "text": "Tell Alex to go without you. You need more time to adjust.",
        "arc": "paris-weekend-alone"
      }
    ]
  },
  "paris-weekend-adventure": {
    "title": "Tourist Life",
    "story": [
      "'Let's do it all,' you say, ignoring the knot in your stomach. You spend the day being tourists. The Louvre is overwhelming - too much art, too many people, your feet hurt after an hour. But the Mona Lisa is smaller than you expected and somehow that's perfect.",
      "You take selfies in front of the Eiffel Tower. You eat crepes from a street vendor. Alex orders for you in their stilted French, and you feel both grateful and infantilized. But you're doing it. You're being in Paris together.",
      "On the Metro ride home, exhausted and overstimulated, Alex leans against your shoulder. 'Today was perfect.' You're not sure perfect is the word you'd use - more like 'survived' - but you smile. You're trying. That counts for something."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-monday-work"
      }
    ]
  },
  "paris-weekend-neighborhood": {
    "title": "Local Living",
    "story": [
      "'Let's explore our neighborhood first,' you suggest. 'I want to know where we actually live before we tourist all over the city.' Alex looks slightly disappointed but agrees.",
      "You walk the streets near your apartment. Find the best boulangerie (after trying three different ones). Discover a park with old men playing petanque. Sit at a cafe for two hours because nobody rushes you. This is the Paris the guidebooks don't capture.",
      "You're still overwhelmed by the language, but the barista at the corner cafe now recognizes you. That feels like victory. Small, unglamorous victory. But victory nonetheless."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-monday-work"
      }
    ]
  },
  "paris-weekend-alone": {
    "title": "Solitary Saturday",
    "story": [
      "'I think I need a day to myself,' you admit. 'To process everything. Is that okay?' Alex's face falls, but they nod. 'Of course. Take all the time you need.'",
      "Alex leaves. You spend the day unpacking, studying French on Duolingo, and feeling guilty. Should you have gone? Are you being a bad partner? Are you wasting your precious time in Paris by hiding in your apartment?",
      "But you also feel better. Sometimes being in a relationship means knowing when you need to be alone. When Alex comes home with stories and photos, you listen and don't mention that you spent six hours earning imaginary internet points on a language app."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-monday-work"
      }
    ]
  },
  "paris-monday-work": {
    "title": "Remote in Paris",
    "story": [
      "Monday. Your remote work begins. Alex leaves at 8 AM, navigating their commute and their new French colleagues. You sit at your makeshift desk in Paris and join video calls with people who have no idea you're on a different continent.",
      "'How's the weather there?' your boss asks. You glance at your Paris window. Rain streaking the glass, gray Parisian skies. 'Fine,' you say, not mentioning you're 6,000 miles from the office. Time zones are brutal - your 9 AM meeting is their 3 PM. Your day starts and ends later than Alex's.",
      "Between meetings, you're alone. In a foreign country. Unable to just run errands or meet a friend for lunch. The isolation is profound. You eat lunch alone while trying to watch French TV to improve your comprehension. You understand maybe one word in ten.",
      "Alex texts at 6:30 PM: 'Riley wants to grab drinks after work. Show me around the neighborhood. Okay if I'm home around 9?' Your stomach twists."
    ],
    "options": [
      {
        "text": "Respond supportively. Alex should bond with colleagues.",
        "arc": "paris-supportive-response"
      },
      {
        "text": "Ask them to come home. You've had a hard first day.",
        "arc": "paris-ask-come-home"
      },
      {
        "text": "Say it's fine but feel resentful inside.",
        "arc": "paris-resentful-agreement"
      }
    ]
  },
  "paris-supportive-response": {
    "title": "Generous Partner",
    "story": [
      "You text: 'Of course! Have fun. Riley knows all the best places.' You mean it. Alex needs to build connections. You want them to be happy.",
      "But sitting alone in your Paris apartment, eating dinner by yourself, hearing French conversations through the walls that you can't understand, the loneliness is crushing. This is your life now. Waiting. Being understanding. Disappearing.",
      "Alex comes home at 10 PM, slightly tipsy, with stories about a hidden wine bar Riley showed them. You smile and listen. You're being the perfect partner. But you're also building a wall of resentment, one supportive text at a time."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-week-three"
      }
    ]
  },
  "paris-ask-come-home": {
    "title": "Voice Your Needs",
    "story": [
      "You call. 'Hey, I know you're building connections, but I really had a rough day. Any chance you could come home instead? We could order in, you could tell me about work...' You trail off, feeling needy.",
      "Pause. Then: 'Of course. I'll tell Riley another time. Are you okay?' Relief floods you. 'I will be. I just need you.' Twenty minutes later, Alex walks through the door with takeout from the Thai place down the street.",
      "You talk about your day. About the isolation. About how much harder this is than you expected. Alex listens, really listens. 'We need to check in more,' they say. 'I can't forget that you're adjusting to a whole new country.'",
      "It's not a magic fix. But it's communication. And that's how you survive transitions - by actually talking about them instead of suffering in silence."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-week-three"
      }
    ]
  },
  "paris-resentful-agreement": {
    "title": "Poisoned Silence",
    "story": [
      "You text: 'Sure.' One word. You watch the three dots appear, disappear. Appear again. Finally: 'Thanks! Love you!' You don't respond.",
      "You eat dinner alone, scrolling through photos of your friends back home doing normal things in a language they understand. You're resentful and guilty about being resentful. Why can't you just be happy for Alex? Why does their success feel like your failure?",
      "Alex comes home at 10:15. 'Sorry, lost track of time.' You shrug. 'It's fine.' It's not fine. But saying so feels like admitting you're not cut out for this. So you say nothing, and the gap between you grows."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-week-three"
      }
    ]
  },
  "paris-week-three": {
    "title": "Trois Semaines",
    "story": [
      "Three weeks in Paris. Your French is slightly less terrible. You can order coffee without panic-sweating. You've learned which metro lines actually run on time. Small victories in a city that doesn't care if you figure it out.",
      "Riley's name comes up constantly. 'Riley says the best markets are on weekends.' 'Riley showed me this shortcut through the Marais.' 'Riley thinks I should try the regional director position.' Riley, Riley, Riley. You try not to picture them - charming, French-fluent, with years of history with Alex.",
      "Thursday evening, Alex comes home excited. 'Riley invited us to their place Saturday. Dinner party with some other colleagues. You'll finally meet their partner Sam too. Want to go?' There's hope in Alex's voice. They want you to like their people."
    ],
    "options": [
      {
        "text": "Accept eagerly. You need to meet Riley properly and build your own Paris social life.",
        "arc": "paris-dinner-accept"
      },
      {
        "text": "Accept but feel anxious. Meeting Riley feels like a test you didn't study for.",
        "arc": "paris-dinner-anxious"
      },
      {
        "text": "Decline. You're not ready to socialize in French while meeting your partner's work crush.",
        "arc": "paris-dinner-decline"
      }
    ]
  },
  "new-york-dinner-accept": {
    "title": "Open Mind",
    "story": [
      "'That sounds great!' you say with genuine enthusiasm. 'I'd love to get to know Jordan better.' Alex beams. You're being the partner they need - open, social, willing to embrace their new life.",
      "Saturday comes. Jordan's apartment in Murray Hill is gorgeous - high ceilings, minimalist decor, the kind of place that screams 'I have my life together.' Jordan greets you with wine and warmth. 'I'm so glad you could come.'",
      "The evening is... fine. Jordan is charming, funny, a good host. You eat expensive cheese and drink good wine and laugh at the right moments. But you also notice things. The way Jordan touches Alex's arm. The inside jokes. The easy intimacy of people who spend 40 hours a week together.",
      "On the way home, Alex squeezes your hand. 'Thank you for tonight. I know Jordan can be a lot, but they're important to me.' You nod. You're trying. You're really trying."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-dinner-reluctant": {
    "title": "Going Through the Motions",
    "story": [
      "'Sure, we can go,' you say with forced enthusiasm. Alex doesn't seem to notice the lack of genuine excitement. Or maybe they're choosing not to notice.",
      "Saturday. Jordan's apartment is exactly what you expected - impressive, expensive, designed to impress. You smile and make small talk and eat food you can't pronounce. You're playing the role of Supportive Partner at Jordan's Dinner Party.",
      "But your guard is up the whole time. You notice every touch, every look, every laugh between Jordan and Alex. You're cataloging evidence for a case you haven't filed yet. By the time you leave, you're exhausted from performing normalcy.",
      "Alex seems oblivious. 'That was fun, right?' You nod. What else can you say? 'I spent three hours analyzing every interaction between you and your coworker for signs of emotional infidelity'? That sounds insane. Maybe you're being insane."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-dinner-decline": {
    "title": "Drawing Lines",
    "story": [
      "'I think I'll pass,' you say carefully. 'I'm not really feeling up to socializing this weekend.' Alex's face falls. 'Really? Jordan specifically asked me to invite you...' The guilt is immediate.",
      "But you hold firm. 'You should still go. I just need a quiet weekend.' Alex nods, but something shifts in their expression. Disappointment? Relief? You can't quite read it.",
      "Saturday night, you sit alone in your apartment while Alex is at Jordan's. You tell yourself you made the right choice, that you're setting healthy boundaries, that you don't have to like all of Alex's coworkers. But you also feel like you're failing a test you didn't know you signed up for.",
      "Alex comes home at midnight with stories you weren't part of. The gap widens."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "paris-dinner-accept": {
    "title": "Into Riley's World",
    "story": [
      "'Yes, absolutely!' you say. 'I've been wanting to meet Riley properly.' And you mean it. You need to stop seeing Riley as a threat and start seeing them as a person.",
      "Saturday arrives. Riley's apartment in the Marais is stunning - high ceilings, floor-to-ceiling windows, art on the walls that probably costs more than your rent. Riley greets you with la bise, those cheek kisses that still feel foreign. 'Welcome! So glad you could come.'",
      "The evening is actually lovely. Riley is charming, yes, but also kind. Their partner Sam is a graphic designer, warm and funny. Other colleagues are there - interesting people with interesting stories. You drink wine, eat incredible food, practice your terrible French.",
      "But you also notice. The way Riley and Alex slip into inside jokes. The way they touch each other's arms. The easy intimacy of people with history. Sam notices you noticing. Gives you a sympathetic smile. Maybe you're not paranoid after all."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "paris-dinner-anxious": {
    "title": "Test Performance",
    "story": [
      "'Okay,' you say, your stomach already knotting. 'I'll come.' Alex doesn't notice your hesitation, or chooses not to.",
      "Saturday. You spend two hours getting ready, changing outfits three times. Riley's apartment is in the Marais - of course it is. Perfectly decorated, perfectly located, perfectly Riley. You walk in already feeling like you don't measure up.",
      "You smile. You make conversation in broken French and perfect English. You meet Sam, who seems nice but also close to Riley in that way that makes you wonder if they notice the way Riley looks at Alex. You eat cheese you can't pronounce and pretend you're having fun.",
      "But really, you're performing. Performing confidence. Performing like you belong. Performing like you're not threatened. By the time you leave, you're exhausted and Alex is oblivious."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "paris-dinner-decline": {
    "title": "Boundary Line",
    "story": [
      "'I don't think I'm ready for that yet,' you admit. 'My French isn't good enough. I'll just embarrass myself and you.' Alex's face falls. 'Riley specifically wanted to meet you...'",
      "You hold firm. 'You go. Build your connections. I'll be fine.' Alex looks disappointed but doesn't push. They go alone Saturday evening. You sit in your apartment, eating takeout, wondering if you're being smart or self-destructive.",
      "Alex comes home at midnight. Tells you about the dinner, about Riley's amazing apartment, about Sam who you would have liked. Every detail is a reminder of what you missed. Of the gap that's growing between Alex's Paris life and yours.",
      "You made a choice. You just hope it was the right one."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "new-york-phone-moment": {
    "title": "The Phone",
    "story": [
      "It's 11 PM on a Tuesday. Alex is in the shower. Their phone buzzes on the nightstand. Once. Twice. Three times. You glance over. Text notifications from Jordan.",
      "You've never snooped before. You trust Alex. You've always trusted Alex. But the phone is right there. Alex's passcode is your anniversary. It would take five seconds to look.",
      "Three more buzzes. Jordan is really texting a lot for 11 PM on a work night."
    ],
    "options": [
      {
        "text": "Don't look. Trust is more important than curiosity.",
        "arc": "new-york-phone-dont-look"
      },
      {
        "text": "Just glance at the lock screen. That's not really snooping.",
        "arc": "new-york-phone-lock-screen"
      },
      {
        "text": "Open the phone. You need to know.",
        "arc": "new-york-phone-open"
      }
    ]
  },
  "new-york-phone-dont-look": {
    "title": "Choosing Trust",
    "story": [
      "You look away deliberately. Whatever Jordan is texting about is between them and Alex. You're not going to be that partner. You're not going to start snooping.",
      "Alex comes out of the bathroom, picks up their phone, scrolls briefly. 'Jordan is freaking out about the Morrison presentation tomorrow. So dramatic.' They laugh, put the phone down, climb into bed next to you.",
      "'Everything okay with you two?' you ask carefully. Alex looks confused. 'With me and Jordan? Yeah, why?' You shrug. 'Just checking in.' Alex kisses your forehead. 'You're the only one I need to be okay with.'",
      "You chose trust. It feels vulnerable and scary and right."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-two"
      }
    ]
  },
  "new-york-phone-lock-screen": {
    "title": "Just a Glance",
    "story": [
      "You lean over. Just to see the lock screen. That's not really invading privacy, right? The messages preview:",
      "'I need your advice' 'Can I call you?' 'I know it's late but' 'You're the only one who gets it' 'Thanks for today btw'",
      "Your heart sinks. Nothing explicitly inappropriate. But 'you're the only one who gets it'? At 11 PM? You're the only one who should be the only one.",
      "Alex comes out, sees you looking at the phone. 'What's up?' You try to act casual. 'Jordan's texting a lot.' 'Oh yeah, they're stressed about tomorrow. I'll call them back in a sec.'",
      "In a sec. They're going to call Jordan back at 11 PM while you're right here. You swallow the protest. You glanced. That was your choice. Now you have to live with what you saw."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-two"
      }
    ]
  },
  "new-york-phone-open": {
    "title": "Crossing the Line",
    "story": [
      "You open the phone. Your hands are shaking. You know this is wrong but you do it anyway. You open the messages with Jordan.",
      "It's... work stuff. Mostly. Presentation notes. Stressed venting about their boss. But then: 'I don't know what I'd do without you' and 'You make work actually bearable' and 'Dinner tomorrow? Just us?'",
      "Just us? Your stomach drops. Then you hear the shower turn off. You close the phone, put it back exactly where it was. Your heart is pounding.",
      "Alex comes out. Picks up their phone. Sees the notification. 'Jordan's melting down. Give me five minutes?' They step out of the bedroom to call. You sit there, guilt and suspicion warring in your chest.",
      "You snooped. You violated trust. And you found... what? Evidence? Or just work friendship? You don't even know anymore."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-two"
      }
    ]
  },
  "new-york-month-two": {
    "title": "Two Months In",
    "story": [
      "Two months in New York. You've settled into a routine. You know your local spots. Your remote work is going well. You've made a few acquaintance-friends, if not deep connections. Alex is thriving at work - they just got a big project and a raise.",
      "Everything looks perfect from the outside. But you feel the distance growing. Jordan's name is everywhere. 'Jordan and I are working late.' 'Jordan recommended this restaurant.' 'Jordan thinks I should apply for director.'",
      "It's Thursday night. Alex just told you they have a work dinner tomorrow. With Jordan. Just the two of them. 'It's a networking thing,' Alex explains. 'We're meeting a potential client. Super boring, you'd hate it.'",
      "Maybe that's true. Or maybe you're being deliberately excluded. You can't tell anymore."
    ],
    "options": [
      {
        "text": "Ask if you can come. Even if it's boring, you want to be included.",
        "arc": "new-york-ask-to-join"
      },
      {
        "text": "Ask questions. Where? What time? When will you be home?",
        "arc": "new-york-ask-questions"
      },
      {
        "text": "Say fine and don't push. You don't want to seem controlling.",
        "arc": "new-york-say-fine"
      }
    ]
  },
  "new-york-ask-to-join": {
    "title": "Invitation Request",
    "story": [
      "'Can I come?' The words come out before you can stop them. Alex looks surprised. 'To a work dinner? It's going to be three hours of business talk...'",
      "'I don't mind. I want to support you. And I've been wanting to try more networking myself.' You're reaching. You both know it.",
      "Alex hesitates. 'Let me check with Jordan if it's okay to bring a plus-one.' They text. You watch the three dots. Jordan responds: 'Client might find it weird if it's not just us two. Rain check?'",
      "Alex looks apologetic. 'Sorry. Next time?' You nod. But you just asked to come to a work dinner and got told no. That's a new low."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-friday-alone"
      }
    ]
  },
  "new-york-ask-questions": {
    "title": "Due Diligence",
    "story": [
      "'Where's the dinner?' you ask, trying to sound casual. Alex names a restaurant you've never heard of. 'What time?' 'Probably 7 to 10?' 'And Jordan's going?' 'Yeah, we're meeting the client together.'",
      "You're gathering information like you're building a case. Alex notices. 'Are you okay with this?' They look genuinely concerned. You have a choice: say what you're really feeling or pretend everything's fine.",
      "'I'm fine,' you lie. 'Just curious.' Alex relaxes. They don't see that you've just committed to a night of anxiety and worst-case scenarios while they're out with Jordan."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-friday-alone"
      }
    ]
  },
  "new-york-say-fine": {
    "title": "Swallowed Feelings",
    "story": [
      "'That's fine,' you say breezily. 'Have fun.' Alex looks relieved. 'Thanks for being understanding. I'll try not to be too late.'",
      "But you're not understanding. You're seething. A work dinner. Just Alex and Jordan. On a Friday night. Three hours minimum. You imagine them at a restaurant, laughing over wine, Jordan touching Alex's arm, neither of them thinking about you sitting alone at home.",
      "You don't say any of this. You smile. You're fine. Everything's fine. The resentment crystallizes into something hard and cold in your chest."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-friday-alone"
      }
    ]
  },
  "new-york-friday-alone": {
    "title": "Friday Night",
    "story": [
      "Friday. Alex leaves at 6:30 for the dinner. 'I'll text you updates!' they promise. You watch them walk out the door, dressed up, excited, not thinking about how you're spending your Friday night alone. Again.",
      "You try to distract yourself. Start a show. Order takeout. Text friends back home. But mostly you're thinking about Alex and Jordan at a restaurant. Are they talking about work? Or are they talking about life, dreams, the things partners talk about?",
      "At 9:30, you haven't heard from Alex since their text at 7: 'Client is late. Might be longer than expected.' You check Find My Friends. They're still at the restaurant. You check Instagram. Nothing. You check... everything. You're spiraling.",
      "At 10:45, Alex finally texts: 'So sorry! Dinner ran long. Heading home now.' It's been four and a half hours. Who has a work dinner for four and a half hours?"
    ],
    "options": [
      {
        "text": "Confront them when they get home. This is unacceptable.",
        "arc": "new-york-confront-late"
      },
      {
        "text": "Act normal. See if they bring up how late it was.",
        "arc": "new-york-act-normal"
      },
      {
        "text": "Pretend to be asleep. You can't deal with this right now.",
        "arc": "new-york-pretend-asleep"
      }
    ]
  },
  "new-york-confront-late": {
    "title": "The Fight",
    "story": [
      "Alex comes home at 11:15. You're waiting up. 'Four and a half hours?' you say before they can even close the door. 'For a work dinner?'",
      "Alex looks taken aback. 'The client was chatty. We couldn't just leave.' 'You couldn't text more than once in four hours?' Your voice is rising. You can hear it but can't stop it.",
      "'I thought you were fine with this! You said you were fine!' 'I'm not fine! I spent Friday night alone while you were out with Jordan until almost midnight!'",
      "The fight escalates. Things are said. You accuse. Alex defends. Lines are drawn. When you finally go to bed, it's in angry silence. You've crossed a threshold. You can't uncross it."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-morning-after-fight"
      }
    ]
  },
  "new-york-act-normal": {
    "title": "Performance Mode",
    "story": [
      "Alex comes home at 11:15. You're on the couch, pretending to watch TV. 'Hey! Sorry that ran so long. The client was so chatty.' They kiss your forehead like nothing's wrong.",
      "'How was it?' you ask, voice neutral. 'Boring,' Alex says. 'Three hours of sports talk and business jargon. You would have hated it.' They're telling you that you're better off, but you hear that you weren't missed.",
      "You make small talk. Ask about the client. Laugh at Alex's stories. Play the role of Understanding Partner. But inside, you're keeping score. Four and a half hours. One text. This is strike two, or three, or you've lost count.",
      "You're a pressure cooker. Eventually, you're going to explode."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-morning-after-fine"
      }
    ]
  },
  "new-york-pretend-asleep": {
    "title": "Avoidance",
    "story": [
      "You hear Alex come in at 11:15. You're in bed, eyes closed, breathing slow and steady. Pretending. Alex tiptoes around, trying not to wake you. Gets ready for bed quietly. Slides in next to you carefully.",
      "You lie there, back to them, rigid with resentment and pretend sleep. They don't know you're furious. They think you're fine. You're letting them think you're fine while building a case against them in your head.",
      "This is how relationships die. Not with explosions, but with thousands of unsaid things festering in the dark."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-morning-after-avoid"
      }
    ]
  },
  "new-york-morning-after-fight": {
    "title": "Cold Morning",
    "story": [
      "Saturday morning. You wake up with fight-hangover - that heavy feeling of knowing you said things you can't unsay. Alex is already awake, making coffee in silence. The air between you is thick.",
      "'We should talk about last night,' Alex says carefully. You have a choice. Double down on your anger, apologize and reconcile, or continue the silent treatment."
    ],
    "options": [
      {
        "text": "Apologize. You overreacted and you know it.",
        "arc": "new-york-apologize-fight"
      },
      {
        "text": "Stand your ground. You have legitimate concerns.",
        "arc": "new-york-stand-ground"
      }
    ]
  },
  "new-york-apologize-fight": {
    "title": "Olive Branch",
    "story": [
      "'I'm sorry,' you say. 'I shouldn't have attacked you the second you walked in. That wasn't fair.' Alex's shoulders relax. 'I'm sorry too. I should have communicated better. I got caught up and forgot you were home waiting.'",
      "You talk. Really talk. About loneliness, about feeling secondary, about needing more communication. It's not perfect, but it's honest. Alex promises to be better about checking in. You promise to voice concerns before they become explosions.",
      "The fight wasn't fun, but the aftermath brings you closer. Sometimes you have to break a little to rebuild stronger."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-stand-ground": {
    "title": "Holding the Line",
    "story": [
      "'I wasn't wrong,' you say. 'Four hours is excessive. One text in four hours is disrespectful. And doing it with Jordan specifically...' You trail off.",
      "'This is about Jordan,' Alex says flatly. 'You don't trust me.' 'I trust you. I don't trust the situation.' 'There is no situation! Jordan is my coworker!'",
      "The fight reignites. No one apologizes. No one backs down. Eventually Alex leaves - 'I need space' - and you're alone again, wondering if you just pushed your partner away or if they were already gone."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-morning-after-fine": {
    "title": "Normal Facade",
    "story": [
      "Saturday morning. You wake up and continue pretending everything's fine. Alex makes breakfast. You eat together. You talk about weekend plans. Everything is surface-level perfect and underneath completely wrong.",
      "You're not fighting. But you're also not okay. The resentment is there, just buried. Waiting."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-morning-after-avoid": {
    "title": "Continued Silence",
    "story": [
      "Saturday morning. Alex doesn't know anything's wrong. You continue the pretense. You're friendly but distant. Fine but not fine. Alex doesn't push. Maybe they don't notice. Maybe they're choosing not to notice.",
      "The gap grows wider."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "new-york-month-one"
      }
    ]
  },
  "paris-phone-moment": {
    "title": "Le Téléphone",
    "story": [
      "It's 10 PM on a Wednesday. Alex is in the shower. Their phone buzzes on the nightstand. Multiple times. You glance over - texts from Riley. In French. Which you can't read well enough.",
      "You've never been that partner. The one who checks phones. But Riley's texts are constant. And they're in French, which feels like a secret language you're locked out of. The phone is right there. The passcode is your anniversary.",
      "More buzzes. Riley is really texting a lot for 10 PM."
    ],
    "options": [
      {
        "text": "Don't look. Maintain trust even when it's hard.",
        "arc": "paris-phone-trust"
      },
      {
        "text": "Glance at notifications. Just to see if you can understand.",
        "arc": "paris-phone-glance"
      },
      {
        "text": "Open the phone and translate. You need to know.",
        "arc": "paris-phone-translate"
      }
    ]
  },
  "paris-phone-trust": {
    "title": "Choosing Faith",
    "story": [
      "You deliberately look away. Whatever Riley and Alex are discussing is their business. You're not going to snoop. You're going to trust.",
      "Alex emerges, checks their phone. 'Riley's freaking out about something their ex said. So much drama.' They roll their eyes affectionately, put the phone down, climb into bed. 'How was your day?'",
      "You talk. About your day, your struggles with French, your loneliness. Alex listens. You chose trust, and right now, it feels like the right choice."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-month-two"
      }
    ]
  },
  "paris-phone-glance": {
    "title": "Surface Check",
    "story": [
      "You lean over to see the lock screen. The texts are in French but you catch words: 'besoin' (need), 'comprends' (understand), 'seul' (alone), 'merci' (thank you). You can't get the full context but the emotional tone is... intimate?",
      "Alex comes out. Sees you looking. 'Riley being dramatic again. Their ex is causing issues.' You nod. You saw the texts but couldn't understand them. Which is worse - not looking or looking and still not knowing?"
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-month-two"
      }
    ]
  },
  "paris-phone-translate": {
    "title": "Breaking Trust",
    "story": [
      "You open the phone. Screenshot the messages. Use Google Translate. Your hands are shaking. The translation is rough but the gist is clear: Riley saying they need someone who understands them, thanking Alex for always being there, saying they don't know what they'd do without Alex.",
      "Nothing explicitly romantic. But emotionally intimate in a way that makes your chest tight. The shower turns off. You close everything, put the phone back. Your heart hammers.",
      "Alex comes out, checks messages, responds briefly. 'Riley drama. Their ex is back being messy.' They don't know you just violated their privacy. You sit with that guilt and that knowledge."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-month-two"
      }
    ]
  },
  "paris-month-two": {
    "title": "Deux Mois",
    "story": [
      "Two months in Paris. You can order in restaurants without panic. You can navigate the Metro. You've found a favorite cafe. From the outside, you're adapting. From the inside, you're drowning.",
      "Riley is everywhere in Alex's stories. The commute together. The shared jokes. The 'you had to be there' moments. Alex is building a life in Paris, and you're not sure how much of that life includes you versus tolerates you.",
      "Thursday evening. Alex announces they have a work event Friday night. Team drinks, then possibly dinner. With Riley. Obviously with Riley. 'I might be late,' Alex says. 'Don't wait up.'"
    ],
    "options": [
      {
        "text": "Ask to come along. You need to be part of their world.",
        "arc": "paris-ask-come-drinks"
      },
      {
        "text": "Say fine but ask for a time estimate and updates.",
        "arc": "paris-ask-time"
      },
      {
        "text": "Say nothing. You're tired of feeling needy.",
        "arc": "paris-say-nothing"
      }
    ]
  },
  "paris-ask-come-drinks": {
    "title": "Inclusion Request",
    "story": [
      "'Can I come?' you ask. Alex looks surprised. 'It's a work thing... everyone will be speaking French...' 'I can handle it. I want to be there.'",
      "Alex hesitates. 'Let me see if spouses are invited.' They check with Riley. The answer: 'It's employees only tonight. Sorry!' You're shut out. Again."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "paris-ask-time": {
    "title": "Reasonable Questions",
    "story": [
      "'What time should I expect you?' you ask. 'Drinks at 7, so probably home by midnight?' That's five hours. You nod. 'Can you text me updates?' 'Of course,' Alex promises.",
      "Friday comes. You get one text at 8 PM: 'At dinner now.' Then silence until 12:45 AM when Alex stumbles in, apologetic and tipsy. You were reasonable. They weren't."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "paris-say-nothing": {
    "title": "Silent Suffering Begins",
    "story": [
      "You say nothing. Alex leaves Friday evening. You sit alone in your Paris apartment, unable to even comfort-watch TV because everything is in French. You check your phone compulsively. No updates.",
      "Alex comes home at 1 AM. You pretend to be asleep. The resentment crystallizes into something cold and hard."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-settling"
      }
    ]
  },
  "new-york-photo-arrives": {
    "title": "Unknown Number",
    "story": [
      "Friday evening. Alex texts: 'Emergency presentation prep. Gonna be another late one. Don't wait up.' You're staring at your phone when it buzzes again.",
      "But this time it's not from Alex. It's an unknown number. A photo. Your stomach drops before your brain even processes what you're seeing.",
      "The image shows Alex and Jordan at a dimly lit bar. Jordan's hand is on Alex's arm. Both of them are laughing. The angle is deliberate - intimate, suspicious. The message reads: 'Thought you should know what Friday night presentations look like. - A Friend'",
      "Your hands are shaking. Your heart is hammering. This is the moment everything changes. How you react right now will determine everything that comes next."
    ],
    "options": [
      {
        "text": "Call Alex immediately. Demand an explanation right now.",
        "arc": "new-york-photo-call-immediately"
      },
      {
        "text": "Text Alex the photo. Let them see you know.",
        "arc": "new-york-photo-text-it"
      },
      {
        "text": "Sit with it. Process before reacting.",
        "arc": "new-york-photo-process"
      },
      {
        "text": "Show up at that bar. See for yourself what's really happening.",
        "arc": "confrontation"
      }
    ]
  },
  "new-york-photo-call-immediately": {
    "title": "The Phone Call",
    "story": [
      "You call. It rings four times. Five. You're about to hang up when Alex answers, breathless. 'Hey, what's up? I'm in the middle of'",
      "'Where are you?' Your voice is tight. 'I told you, presentation prep with' 'Are you at a bar with Jordan?' Silence. Long, terrible silence.",
      "'Someone sent me a photo,' you say. 'You and Jordan. At a bar. Jordan touching your arm. Both of you looking very cozy for a work emergency.'",
      "More silence. Then: 'Can we talk about this when I get home? This isn't I can't do this over the phone.' That's not a denial. That's not 'you're crazy.' That's 'I can't do this over the phone.'"
    ],
    "options": [
      {
        "text": "Demand they come home right now.",
        "arc": "new-york-photo-demand-home"
      },
      {
        "text": "Hang up and go to the bar yourself.",
        "arc": "confrontation"
      },
      {
        "text": "Agree to wait but you're furious.",
        "arc": "new-york-photo-wait-furious"
      }
    ]
  },
  "new-york-photo-text-it": {
    "title": "Digital Evidence",
    "story": [
      "You screenshot the photo. Send it to Alex with no message. Just the image. Let them interpret. Let them explain. Let them panic.",
      "Three dots appear immediately. Disappear. Appear. Disappear. Your heart is pounding. Finally, a message: 'Where did you get this??' Not 'this isn't what it looks like.' Not 'I can explain.' Just 'where did you get this.'",
      "You type: 'Anonymous number. Is this what presentation prep looks like?' Send. Three dots. Disappear. Your phone rings. Alex calling."
    ],
    "options": [
      {
        "text": "Answer. Hear what they have to say.",
        "arc": "new-york-photo-answer-call"
      },
      {
        "text": "Ignore the call. Let them squirm.",
        "arc": "new-york-photo-ignore-call"
      },
      {
        "text": "Answer but say you're coming to the bar.",
        "arc": "new-york-photo-announce-arrival"
      }
    ]
  },
  "new-york-photo-process": {
    "title": "The Pause",
    "story": [
      "You sit with the photo. Really look at it. They're at a bar. Jordan's hand is on Alex's arm - but is Alex pulling away? Leaning in? You can't tell from a still image. They're laughing - about what? Work? Something else?",
      "Someone sent this to hurt you. To make you doubt. To create drama. But is the photo real? Is the context real? Or is someone manipulating you into destroying your own relationship?",
      "You have evidence of... what exactly? Your partner having a drink with a coworker? Or your partner having an affair? The photo doesn't tell you which. Your response will determine what happens next.",
      "You take a breath. Then another. You're not going to make a decision from a place of panic. You're going to be smart about this."
    ],
    "options": [
      {
        "text": "Wait for Alex to come home. Have a calm conversation like adults.",
        "arc": "patient-talk"
      },
      {
        "text": "Go to the bar but observe first before confronting.",
        "arc": "new-york-photo-observe"
      },
      {
        "text": "Call a friend for advice before doing anything.",
        "arc": "new-york-photo-call-friend"
      }
    ]
  },
  "new-york-photo-demand-home": {
    "title": "The Ultimatum",
    "story": [
      "'Come home. Right now.' Your voice is ice. 'I need to finish' 'I don't care what you need to finish. Come. Home. Now.'",
      "Alex sighs. You hear muffled conversation - probably telling Jordan they have to leave. 'I'll be there in twenty minutes.' They hang up.",
      "You pace the apartment. Twenty minutes feels like hours. You're playing scenarios in your head. Best case: innocent work meeting, bad angle. Worst case: everything you feared is true.",
      "When Alex walks in, they look guilty. Or defensive. Or scared. You can't tell anymore."
    ],
    "options": [
      {
        "text": "Show them the photo silently. Let them explain first.",
        "arc": "new-york-show-photo-silent"
      },
      {
        "text": "Immediately ask: Are you cheating on me?",
        "arc": "new-york-ask-cheating"
      },
      {
        "text": "Start with: Who sent me this and why?",
        "arc": "new-york-ask-who-sent"
      }
    ]
  },
  "new-york-photo-wait-furious": {
    "title": "Controlled Fury",
    "story": [
      "'Fine. Finish your work meeting.' The sarcasm is heavy. 'We'll talk when you get home. If you get home.' You hang up before Alex can respond.",
      "You pace. You make tea you don't drink. You look at the photo fifty more times. You imagine confrontations. You imagine lies. You imagine your life falling apart.",
      "Two hours later, Alex comes home. They look nervous. Good. They should be nervous."
    ],
    "options": [
      {
        "text": "Meet them at the door with the photo.",
        "arc": "new-york-photo-door-confrontation"
      },
      {
        "text": "Sit on the couch. Make them come to you.",
        "arc": "new-york-photo-couch-power"
      }
    ]
  },
  "new-york-photo-answer-call": {
    "title": "The Explanation Begins",
    "story": [
      "You answer. 'I can explain,' Alex says immediately. The worst words. If you have to say you can explain, you probably can't.",
      "'I'm listening.' Your voice is flat. 'We ARE working. Jordan and I are at the bar because the office closed and we needed somewhere to keep going. That photo is taken out of context. Someone is trying to mess with us.'",
      "'Jordan's hand is on your arm.' 'They were pointing at something on my laptop. It's not there's nothing happening here. Please believe me.'",
      "Do you believe them? Can you?"
    ],
    "options": [
      {
        "text": "Ask them to come home immediately to talk in person.",
        "arc": "new-york-photo-come-home-talk"
      },
      {
        "text": "Tell them you're coming to the bar to see for yourself.",
        "arc": "confrontation"
      },
      {
        "text": "Say you need time to think. Hang up.",
        "arc": "space"
      }
    ]
  },
  "new-york-photo-ignore-call": {
    "title": "Silence as Weapon",
    "story": [
      "You silence the call. Let it go to voicemail. Immediately, a text: 'Please pick up. I can explain. It's not what it looks like.'",
      "Another text: 'Someone is trying to cause problems. Please don't let them.'",
      "Another: 'I'm coming home. We need to talk about this face to face.'",
      "Twenty minutes later, Alex bursts through the door, panicked and apologetic. You're waiting."
    ],
    "options": [
      {
        "text": "Let them talk first. See what they say unprompted.",
        "arc": "new-york-photo-let-talk"
      },
      {
        "text": "Immediately confront: Explain that photo. Now.",
        "arc": "new-york-photo-explain-now"
      }
    ]
  },
  "new-york-photo-observe": {
    "title": "Detective Mode",
    "story": [
      "You grab your coat. You're going to the bar, but you're not going to storm in. You're going to observe. See what's really happening before you make accusations you can't take back.",
      "The bar is ten minutes away. You can see them through the window before you go in. They're sitting at a corner table. Laptops open. Papers spread out. Jordan's hand had been on Alex's arm in the photo, but now they're both typing.",
      "It looks like work. It actually looks like work. But the bar is dim, intimate. They're sitting close. Jordan laughs at something, leans toward Alex. Alex smiles back in a way that makes your chest tight.",
      "You could go in. Or you could keep watching. Or you could go home and pretend you never saw any of this."
    ],
    "options": [
      {
        "text": "Go in. Confront them now that you've seen more context.",
        "arc": "confrontation"
      },
      {
        "text": "Keep watching. Gather more information.",
        "arc": "new-york-photo-keep-watching"
      },
      {
        "text": "Leave. You've seen enough. Wait for Alex at home.",
        "arc": "patient-talk"
      }
    ]
  },
  "new-york-photo-call-friend": {
    "title": "Outside Perspective",
    "story": [
      "You call your best friend from back home. They answer on the second ring. 'Hey! What's up!' 'I need advice.' Your voice cracks. 'Tell me everything,' they say.",
      "You explain. The photo. The anonymous message. Jordan's constant presence in your life. Your friend listens. Then: 'What does your gut say?'",
      "'My gut says something's wrong. But my gut also says I might be paranoid.' 'Those aren't mutually exclusive,' your friend points out. 'You can be paranoid AND something can be wrong.'",
      "'What would you do?' you ask. 'I'd need more information,' they say. 'One photo from an anonymous sender isn't enough. But it's enough to ask questions.'"
    ],
    "options": [
      {
        "text": "Take their advice. Wait for Alex and ask calm questions.",
        "arc": "patient-talk"
      },
      {
        "text": "Ignore their advice. Go to the bar. You need to see for yourself.",
        "arc": "confrontation"
      },
      {
        "text": "Ask them to stay on the phone with you while you figure this out.",
        "arc": "new-york-photo-friend-support"
      }
    ]
  },
  "paris-riley-lyon-announced": {
    "title": "Le Week-end Lyon",
    "story": [
      "Four months into your Paris life, Alex comes home with news. 'My company is doing a retreat in Lyon this weekend. Team building, strategy sessions, the usual corporate stuff.' They're folding laundry, not quite meeting your eyes. 'It's employees only, so...'",
      "'So I can't come,' you finish. Alex nods, apologetic. 'I wish you could. It would be more fun with you there.'",
      "You know Riley will be there. Riley, who works directly with Alex. Riley, whose name peppers every conversation. Riley, who had feelings for Alex once upon a time. And now they're spending a weekend together in Lyon while you sit alone in Paris.",
      "That night, you're helping Alex pack when their phone buzzes. You glance over. Riley's text: 'Can't wait for our weekend away! Just like old times '"
    ],
    "options": [
      {
        "text": "Ask Alex directly about that text. What does 'old times' mean?",
        "arc": "paris-lyon-ask-about-text"
      },
      {
        "text": "Say nothing about the text but express general discomfort about the trip.",
        "arc": "paris-lyon-express-discomfort"
      },
      {
        "text": "Pretend you didn't see it. You don't want to seem controlling.",
        "arc": "paris-lyon-pretend-unseen"
      },
      {
        "text": "Make a joke about it to test Alex's reaction.",
        "arc": "paris-lyon-joke-about-it"
      }
    ]
  },
  "paris-lyon-ask-about-text": {
    "title": "Direct Question",
    "story": [
      "'What did Riley mean by just like old times?' you ask, trying to keep your voice neutral. Alex glances at their phone. 'Oh. We used to do weekend trips in college. Road trips, hiking, that kind of thing. Riley's just being nostalgic.'",
      "'Nostalgic about time you spent together before me.' It comes out more bitter than you intended. Alex stops packing. 'Are you uncomfortable with this trip?'",
      "Here's your chance. You can be honest about your fears. Or you can backpedal and pretend everything's fine."
    ],
    "options": [
      {
        "text": "Be honest. Yes, you're uncomfortable with them spending a weekend with someone who used to have feelings for them.",
        "arc": "boundaries"
      },
      {
        "text": "Backpedal. Say you're fine, just making conversation.",
        "arc": "paris-lyon-backpedal"
      },
      {
        "text": "Turn it around. Ask if Riley still has feelings for them.",
        "arc": "paris-lyon-ask-feelings"
      }
    ]
  },
  "paris-lyon-express-discomfort": {
    "title": "Vague Concerns",
    "story": [
      "'I'm not super comfortable with this trip,' you admit. 'A whole weekend with your team. With Riley.' You don't mention the text. You're testing to see if Alex addresses it on their own.",
      "Alex sits down next to you. 'What specifically makes you uncomfortable?' They seem genuinely curious, not defensive. This is your chance to either be specific about Riley or keep it vague."
    ],
    "options": [
      {
        "text": "Be specific about Riley. Their history, the constant presence, your insecurity.",
        "arc": "boundaries"
      },
      {
        "text": "Stay vague. Just say you'll miss them and weekends apart are hard.",
        "arc": "paris-lyon-stay-vague"
      }
    ]
  },
  "paris-lyon-pretend-unseen": {
    "title": "Swallowed Words",
    "story": [
      "You say nothing about the text. You smile. You help Alex pack. You play the role of Supportive Partner Who Isn't Threatened. But inside, 'just like old times' echoes like a warning bell.",
      "Friday morning arrives. Alex leaves for Lyon. You kiss them goodbye. 'Have fun,' you say. You don't say 'don't do anything I wouldn't approve of' or 'remember you have a partner' or any of the thousand anxious thoughts racing through your head.",
      "The door closes. You're alone in Paris for the weekend. And Alex is in Lyon with Riley. Just like old times."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "silent-suffering"
      }
    ]
  },
  "paris-lyon-joke-about-it": {
    "title": "Humor as Defense",
    "story": [
      "'Just like old times?' you say with forced lightness. 'Should I be worried?' You're joking. Except you're not joking. You're testing.",
      "Alex laughs. 'Riley's being dramatic. It's a work retreat, not a college reunion.' They don't seem to register your actual concern beneath the joke. Or they're choosing not to.",
      "'Right. Of course.' You smile. The moment passes. But you didn't get the reassurance you needed. You got dismissed."
    ],
    "options": [
      {
        "text": "Push a little more. Make it clear you're actually concerned.",
        "arc": "boundaries"
      },
      {
        "text": "Let it go. You tried to bring it up and got shut down.",
        "arc": "silent-suffering"
      }
    ]
  },
  "paris-lyon-backpedal": {
    "title": "False Reassurance",
    "story": [
      "'No, I'm fine,' you lie. 'Just making conversation.' Alex looks relieved. 'Good. Because it's really just a boring work thing. You'd hate it anyway - hours of presentations in French.'",
      "They're giving you an out. Telling you that you're better off without this experience. But you hear: you're not part of this part of my life. Friday comes. Alex leaves. You're alone with your thoughts and your fears."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "silent-suffering"
      }
    ]
  },
  "paris-lyon-stay-vague": {
    "title": "Missed Opportunity",
    "story": [
      "'I'll just miss you,' you say. It's true but it's not the whole truth. 'It's weird being apart on weekends.' Alex softens. 'I'll miss you too. I'll text you constantly. Promise.'",
      "They mean it. But they didn't address Riley. Because you didn't give them the chance. You stayed safe instead of honest. Friday arrives. Alex leaves with promises to text. You wait to see if they keep those promises."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "silent-suffering"
      }
    ]
  },
  "paris-lyon-ask-feelings": {
    "title": "The Real Question",
    "story": [
      "'Does Riley still have feelings for you?' The question hangs in the air. Alex looks genuinely surprised. 'What? No. That was years ago. We're friends and colleagues. That's it.'",
      "'You're sure?' 'I'm sure.' Alex takes your hand. 'You're the one I chose. You're the one I moved to Paris with. Riley is in the past.'",
      "You want to believe them. But believing them means trusting them for a whole weekend in Lyon. Can you do that?"
    ],
    "options": [
      {
        "text": "Choose to trust. Set clear boundaries but let them go.",
        "arc": "boundaries"
      },
      {
        "text": "Say you trust them but internally you don't. Silent suffering begins.",
        "arc": "silent-suffering"
      }
    ]
  },
  "new-york-show-photo-silent": {
    "title": "Silent Accusation",
    "story": [
      "You hold up your phone. Show Alex the photo. Say nothing. Let the image speak for itself. Alex's face goes through a journey - confusion, recognition, then something that might be panic or might be anger.",
      "'Where did you get this?' Not 'this isn't what it looks like.' Not 'I can explain.' Just 'where did you get this.' Like the source matters more than the content.",
      "'Anonymous number,' you say. Your voice is surprisingly steady. 'Someone thought I should know what Friday night presentations look like.'",
      "Alex sinks onto the couch. 'This is... someone is trying to mess with us. This is exactly what it looks like - work. Jordan and I were at the bar because we needed somewhere to finish the Morrison presentation. That's Jordan pointing at my laptop screen, not... whatever this is trying to imply.'"
    ],
    "options": [
      {
        "text": "Believe them. Ask who would send this and why.",
        "arc": "new-york-believe-investigate"
      },
      {
        "text": "Question them. Why a bar? Why so late? Why didn't you text more?",
        "arc": "new-york-question-details"
      },
      {
        "text": "Don't believe them. This looks intimate regardless of the excuse.",
        "arc": "new-york-dont-believe"
      }
    ]
  },
  "new-york-ask-cheating": {
    "title": "The Direct Question",
    "story": [
      "'Are you cheating on me?' The words come out raw. Alex's eyes widen. 'What? No! God, no. Why would you' They stop. See your phone. The photo. Understanding dawns.",
      "'Where did that come from?' 'Anonymous number. Someone sent it to me while you were at your work emergency.' You can't keep the sarcasm out of the word 'work.'",
      "Alex sits down heavily. 'I'm not cheating on you. That's Jordan and me working. Someone took a photo at the worst possible moment and sent it to you to cause exactly this reaction. And it's working.'"
    ],
    "options": [
      {
        "text": "You want to believe them but you need more information.",
        "arc": "new-york-need-more-info"
      },
      {
        "text": "The photo speaks for itself. Explain the hand on your arm.",
        "arc": "new-york-explain-touch"
      },
      {
        "text": "Who would do this? Focus on the anonymous sender.",
        "arc": "new-york-who-sent"
      }
    ]
  },
  "new-york-ask-who-sent": {
    "title": "The Mystery",
    "story": [
      "'Who would send this to me?' you ask. 'Who has both our numbers and a reason to want us to fight?' Alex thinks. You can see them processing. 'Someone at work. Someone who doesn't want Jordan and me to succeed on this project. Or...' they trail off.",
      "'Or what?' 'Or someone who's interested in one of us. Someone who wants to create problems.' You hadn't thought of that. This could be about breaking you up so Alex is available. Or so Jordan is available.",
      "'Do you believe that?' you ask. 'Do you really think someone is trying to manipulate us?' 'I think this photo is real but the context is wrong,' Alex says carefully. 'And I think someone knew exactly what buttons to push to make you doubt me.'"
    ],
    "options": [
      {
        "text": "Choose to trust Alex. Focus on finding who sent it.",
        "arc": "new-york-trust-investigate"
      },
      {
        "text": "This feels like deflection. Address the photo first, mystery second.",
        "arc": "new-york-deflection-call"
      },
      {
        "text": "Maybe you're being manipulated. Or maybe Alex is gaslighting you.",
        "arc": "new-york-gaslighting-doubt"
      }
    ]
  },
  "new-york-believe-investigate": {
    "title": "Partnership Mode",
    "story": [
      "'Okay,' you say. 'I believe you. But someone sent this for a reason. Who would want to mess with us?' You've shifted from accusation to investigation. Alex's shoulders drop with relief.",
      "'Someone at work,' Alex says immediately. 'Jordan and I are both up for the same promotion. If we're distracted by personal drama, we're less competitive.' 'So this is corporate sabotage?' 'Maybe. Or someone's interested in one of us and wants to clear the field.'",
      "You sit next to Alex. Look at the photo together. 'We need to figure this out,' you say. 'Together.' Alex takes your hand. 'Thank you for believing me. I know how this looks.'",
      "You chose trust. It's scary and vulnerable and it might be the thing that saves you."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "honest-jealousy"
      }
    ]
  },
  "new-york-question-details": {
    "title": "Interrogation",
    "story": [
      "'Why a bar?' you ask. 'Why not the office? Why not a coffee shop?' 'The office closes at 9. Coffee shops close early. The bar was close and open late.' It makes sense. You hate that it makes sense.",
      "'Why didn't you text me more than once?' 'I was working. I thought you'd be fine. I didn't think—' 'You didn't think I'd be sitting at home, alone, wondering where you were and who you were with?'",
      "Alex winces. 'You're right. I should have communicated better. But I wasn't doing anything wrong. I was literally typing on my laptop the entire time. Ask Jordan.' 'I don't want to ask Jordan. I want you to not put me in situations where I have to wonder.'"
    ],
    "options": [
      {
        "text": "Demand better communication going forward.",
        "arc": "new-york-demand-boundaries"
      },
      {
        "text": "You're still not satisfied. Something feels off.",
        "arc": "new-york-still-suspicious"
      }
    ]
  },
  "new-york-dont-believe": {
    "title": "Trust Broken",
    "story": [
      "'This looks intimate,' you say. 'Work or not, you're sitting close, they're touching you, you're both clearly comfortable in a way that makes me uncomfortable.' Your voice is rising. You can't stop it.",
      "'We were looking at a laptop screen!' 'At a bar! At midnight! While I was home alone!' The fight escalates. Neither of you is listening. You're both just defending, attacking, circling.",
      "Alex stands. 'I can't do this. I can't defend myself against a photo taken out of context by someone trying to sabotage us. Either you trust me or you don't.' 'Right now, I don't,' you say. The words hang there, sharp and final.",
      "Alex grabs their jacket. 'I need space. I'll stay at Jordan's' 'Of course you will!' 'because Jordan has a couch and I can't be here right now.' The door slams."
    ],
    "options": [
      {
        "text": "Let them go. You need space too.",
        "arc": "new-york-let-go-space"
      },
      {
        "text": "Follow them. Don't let them leave angry.",
        "arc": "new-york-follow-stop"
      }
    ]
  },
  "new-york-need-more-info": {
    "title": "Clarification",
    "story": [
      "'I want to believe you,' you say. 'But I need to understand. Walk me through the evening. Every detail.' Alex nods. Takes a breath. Starts explaining.",
      "The office closed at 9. They needed somewhere to work. Jordan suggested the bar - it's quiet on weeknights, has good wifi. They ordered coffee, not alcohol. They worked for three hours straight. The photo must have been taken around 10:30 when Jordan was pointing at something on the screen.",
      "'Who would photograph you?' 'Someone from the office who was there. Marcus maybe - he's competing for the same promotion. Or...' Alex hesitates. 'Or someone interested in me or Jordan who wants to cause problems.'",
      "The story hangs together. But does that mean it's true? Or just well-constructed?"
    ],
    "options": [
      {
        "text": "The story makes sense. Choose to trust.",
        "arc": "new-york-trust-story"
      },
      {
        "text": "Ask to see their phone. Verify the timeline.",
        "arc": "new-york-verify-phone"
      },
      {
        "text": "You want to believe but you can't. Not yet.",
        "arc": "space"
      }
    ]
  },
  "new-york-explain-touch": {
    "title": "The Detail",
    "story": [
      "'Explain Jordan's hand on your arm.' You're looking at the photo again. That touch. It looks... familiar. Comfortable. Too comfortable.",
      "Alex takes the phone. Studies the image. 'They were pointing at the screen. This is mid-gesture. If you had the photo from one second later, you'd see them pulling back. This is one frame of an innocent moment made to look like something else.'",
      "'It doesn't look innocent.' 'Because whoever took this photo framed it that way. That's the point. They knew exactly what angle would make you doubt me.'",
      "You're so tired. Tired of doubting. Tired of defending your doubts. Tired of this conversation. 'I don't know what to believe,' you admit."
    ],
    "options": [
      {
        "text": "Choose to believe Alex's explanation.",
        "arc": "new-york-choose-believe"
      },
      {
        "text": "You need time apart to think clearly.",
        "arc": "space"
      },
      {
        "text": "Suggest couples counseling. You can't navigate this alone.",
        "arc": "new-york-suggest-counseling"
      }
    ]
  },
  "new-york-who-sent": {
    "title": "Detective Work",
    "story": [
      "'Let's figure out who sent this,' you say. 'That feels more productive than fighting.' Alex looks surprised. 'Really?' 'If someone's trying to sabotage us, I want to know who.'",
      "You both sit. Look at the photo forensically instead of emotionally. The angle suggests someone sitting nearby. The bar looks familiar - Alex has mentioned it before. 'This is the bar near your office,' you say. 'Yeah. We go there sometimes after work.'",
      "'Who else was there tonight?' Alex thinks. 'I didn't see anyone from work. But someone could have been there without me noticing.' You check the phone number. It's not in your contacts. You try calling back. Goes straight to a disconnected message. Burner phone.",
      "'Someone went through effort,' you observe. 'This wasn't casual. This was planned.'"
    ],
    "options": [
      {
        "text": "Report it to Alex's HR. This is workplace harassment.",
        "arc": "new-york-report-hr"
      },
      {
        "text": "Focus on your relationship. Don't let whoever sent this win.",
        "arc": "new-york-focus-relationship"
      }
    ]
  },
  "new-york-deflection-call": {
    "title": "Staying Focused",
    "story": [
      "'This feels like you're deflecting,' you say. 'Someone sent a photo of something real. You were at a bar with Jordan at midnight. That happened. Let's talk about that before we talk about conspiracy theories.'",
      "Alex's face hardens. 'It's not a conspiracy theory. Someone literally sent you that photo to manipulate you.' 'And maybe they're manipulating you into thinking that's the issue instead of the actual issue - you prioritizing Jordan and work over me.'",
      "The fight spirals. You're both angry now. Both feeling unheard. Both convinced you're right."
    ],
    "options": [
      {
        "text": "Take a break. Cool down before this gets worse.",
        "arc": "new-york-take-break"
      },
      {
        "text": "Keep pushing. You need resolution tonight.",
        "arc": "new-york-push-resolution"
      }
    ]
  },
  "new-york-gaslighting-doubt": {
    "title": "Spiral",
    "story": [
      "'How do I know you're not gaslighting me?' The question comes out before you can stop it. 'Making me think I'm crazy for being upset about something legitimately upsetting?'",
      "Alex looks hurt. 'I'm not gaslighting you. I'm telling you the truth. Someone took a real moment and made it look like something it wasn't.' 'Or you're lying and making me feel bad for catching you.'",
      "'If you really think that,' Alex says quietly, 'then we have bigger problems than this photo.' They're right. You know they're right. But you can't stop the spiral."
    ],
    "options": [
      {
        "text": "Apologize. You're letting fear make you mean.",
        "arc": "new-york-apologize-mean"
      },
      {
        "text": "Double down. Your feelings are valid even if you're expressing them badly.",
        "arc": "new-york-double-down"
      }
    ]
  },
  "new-york-trust-investigate": {
    "title": "Us vs The Problem",
    "story": [
      "You make a choice. You choose to trust Alex and treat this like you're on the same team against whoever sent the photo. 'Okay. We figure out who did this. Together.' Alex's whole body relaxes.",
      "'Thank you,' they say. 'I know that's hard. I know how the photo looks.' 'It does look bad,' you admit. 'But looking bad and being bad aren't the same thing. And I trust you more than I trust some anonymous person with a camera.'",
      "You spend the next hour analyzing. Who has both your numbers? Who benefits from you two fighting? Who was at that bar? By 2 AM, you have a theory: Marcus from accounting, who's competing with Alex and Jordan for the same promotion.",
      "It's not proof. But it's a theory. And more importantly, you've spent two hours working together instead of tearing each other apart."
    ],
    "options": [
      {
        "text": "Report it to HR first thing Monday.",
        "arc": "new-york-report-monday"
      },
      {
        "text": "Confront Marcus directly.",
        "arc": "new-york-confront-marcus"
      },
      {
        "text": "Let it go. Focus on strengthening your relationship instead.",
        "arc": "new-york-strengthen-relationship"
      }
    ]
  },
  "new-york-trust-story": {
    "title": "Leap of Faith",
    "story": [
      "'Okay,' you say. 'I believe you.' Alex exhales like they've been holding their breath. 'Really?' 'Really. The story makes sense. And more importantly, you've never lied to me before. I'm not going to let an anonymous photo change that.'",
      "Alex pulls you into a hug. 'We should figure out who sent this. This is harassment.' 'Later,' you say. 'Right now, I just need to be with you. Actually with you. Not fighting or investigating. Just... us.'",
      "You order pizza at 1 AM. Talk about everything except the photo. Remember why you're together. By the time you fall asleep at 3 AM, the crisis feels smaller. Not gone, but manageable."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "honest-jealousy-resolution"
      }
    ]
  },
  "new-york-choose-believe": {
    "title": "Active Trust",
    "story": [
      "'I choose to believe you,' you say deliberately. Those words: I choose. This isn't blind faith. This is an active decision to trust despite fear. Alex hears the difference.",
      "'That means everything,' they say. 'I know this is scary. I know how the photo looks. But I'm choosing you too. Every day. This project with Jordan ends in two weeks. Then I'm requesting to work with a different team.'",
      "'You'd do that?' 'I'd do anything to make you feel secure. You're more important than any work project. Any promotion. Anything.' The words matter. But the action - volunteering to change teams - matters more."
    ],
    "options": [
      {
        "text": "Accept the offer. You need that separation.",
        "arc": "new-york-accept-team-change"
      },
      {
        "text": "Don't require it. You trust them to handle Jordan professionally.",
        "arc": "new-york-trust-professional"
      }
    ]
  },
  "new-york-verify-phone": {
    "title": "Trust But Verify",
    "story": [
      "'Can I see your phone?' you ask. 'I want to see the texts with Jordan tonight. See the timeline.' It's invasive. You know it's invasive. But you need it.",
      "Alex hesitates. Not guilt-hesitation. Privacy-hesitation. Then hands over the phone. 'Password is our anniversary.' You unlock it. Open the messages with Jordan.",
      "It's... exactly what Alex said. Work stuff. 'Meet at Hannigan's at 8?' 'Need to finish Morrison tonight.' 'Can you bring the updated numbers?' Nothing romantic. Nothing suspicious. Just two coworkers coordinating.",
      "You hand back the phone. 'Thank you,' Alex says. 'For trusting me enough to verify instead of just assuming the worst.'"
    ],
    "options": [
      {
        "text": "Apologize for doubting. You feel better now.",
        "arc": "new-york-apologize-verify"
      },
      {
        "text": "You verified one thing but you're still uneasy about Jordan.",
        "arc": "new-york-still-uneasy"
      }
    ]
  },
  "new-york-suggest-counseling": {
    "title": "Asking for Help",
    "story": [
      "'I think we need counseling,' you say. 'I don't know how to navigate this. The photo, the jealousy, the trust issues. I can't do this alone.' You expect Alex to resist. To say counseling is for people with real problems.",
      "Instead: 'Okay. Yeah. Let's do that.' Relief floods you. 'Really?' 'Really. I don't want to lose you over a misunderstanding. If a therapist can help us communicate better, I'm in.'",
      "It's 1 AM on a Friday night and you're making an agreement to go to couples therapy. It's not romantic. But it might be the most loving thing you've done for each other."
    ],
    "options": [
      {
        "text": "Research therapists together right now.",
        "arc": "new-york-research-therapists"
      },
      {
        "text": "Just agree to do it and deal with logistics later. You need sleep.",
        "arc": "new-york-sleep-first"
      }
    ]
  },
  "new-york-take-break": {
    "title": "Tactical Retreat",
    "story": [
      "'We need to stop,' you say. 'We're both tired. We're both reactive. We're not going to solve this at 1 AM.' Alex nods reluctantly. 'Okay. But we talk tomorrow? Actually talk?'",
      "'Yes. Tomorrow. When we're both calm.' You go to bed angry. It's not what relationship advice says to do. But sometimes going to bed angry is better than fighting until you say something unforgivable.",
      "In the morning, with coffee and daylight, everything feels less catastrophic."
    ],
    "options": [
      {
        "text": "Have a calm morning conversation.",
        "arc": "new-york-morning-calm"
      },
      {
        "text": "The anger from last night hasn't faded.",
        "arc": "new-york-morning-still-angry"
      }
    ]
  },
  "new-york-push-resolution": {
    "title": "Tonight",
    "story": [
      "'No. We're talking about this tonight. I'm not going to bed with this hanging over us.' Alex sighs. 'Fine. What do you want from me?'",
      "'I want honesty. Real honesty. Are you attracted to Jordan?' The question lands like a bomb. Alex's eyes widen. 'What?' 'Answer the question.'",
      "'Jordan is objectively attractive. But I'm not attracted TO them. There's a difference.' 'Is there?' 'Yes. I find lots of people attractive. I'm only attracted to you. I only want you. There's a difference and you know it.'",
      "Do you know it? Or are you splitting hairs?"
    ],
    "options": [
      {
        "text": "Accept the distinction. You do know the difference.",
        "arc": "new-york-accept-distinction"
      },
      {
        "text": "That's not good enough. The line is too blurry.",
        "arc": "new-york-not-good-enough"
      }
    ]
  },
  "new-york-apologize-mean": {
    "title": "Self-Awareness",
    "story": [
      "'I'm sorry,' you say. 'I'm scared and I'm lashing out. That's not fair to you.' Alex softens. 'I'm scared too. Scared of losing you over something I didn't do.'",
      "'We're both scared,' you realize. 'And fear makes us mean to each other.' 'So what do we do?' Alex asks.",
      "'We choose not to be mean. Even when we're scared. Especially when we're scared.'"
    ],
    "options": [
      {
        "text": "Agree to communicate better going forward.",
        "arc": "new-york-agree-better-communication"
      },
      {
        "text": "Suggest therapy to help navigate fear and communication.",
        "arc": "new-york-suggest-counseling"
      }
    ]
  },
  "new-york-double-down": {
    "title": "Standing Ground",
    "story": [
      "'My feelings are valid even if I'm expressing them badly,' you insist. 'I'm not crazy for being upset.' 'I never said you were crazy,' Alex says carefully. 'I said someone is manipulating you.'",
      "'Same thing!' 'It's really not.' The fight continues. You're both dug in. Both convinced you're right. Both bleeding but refusing to stop swinging.",
      "By 3 AM, you're exhausted. No closer to resolution. Just more hurt."
    ],
    "options": [
      {
        "text": "Suggest sleeping separately tonight. You need space.",
        "arc": "new-york-sleep-separate"
      },
      {
        "text": "One more attempt at reconciliation before giving up.",
        "arc": "new-york-last-attempt"
      }
    ]
  },
  "new-york-demand-boundaries": {
    "title": "Setting Terms",
    "story": [
      "'I need boundaries,' you say. 'Clear ones. No more late nights with Jordan without checking in every hour. No more work bars - if the office is closed, you come home. I need to feel prioritized.'",
      "Alex nods. 'That's fair. I should have been better about communication. I will be better.' 'And I need you to tell Jordan about these boundaries. I need them to know I'm not comfortable with the current arrangement.'",
      "Alex hesitates. 'That might make things awkward at work...' 'I don't care about awkward. I care about us.'"
    ],
    "options": [
      {
        "text": "Insist. Jordan needs to know these boundaries exist.",
        "arc": "new-york-insist-tell-jordan"
      },
      {
        "text": "Compromise. Alex sets boundaries without explicitly mentioning you.",
        "arc": "new-york-compromise-boundaries"
      }
    ]
  },
  "new-york-still-suspicious": {
    "title": "Lingering Doubt",
    "story": [
      "'I hear what you're saying,' you say. 'But I can't shake the feeling that something's off. Not cheating, maybe. But emotional intimacy that crosses lines.'",
      "Alex looks frustrated. 'What would make you feel better? What do you need?' That's the question, isn't it? What would actually help?"
    ],
    "options": [
      {
        "text": "Ask Alex to set boundaries with Jordan at work.",
        "arc": "new-york-request-work-boundaries"
      },
      {
        "text": "Suggest couples therapy to work through trust issues.",
        "arc": "new-york-suggest-counseling"
      },
      {
        "text": "Admit you don't know. You're just... uncomfortable.",
        "arc": "new-york-just-uncomfortable"
      }
    ]
  },
  "paris-riley-weekend-check": {
    "title": "The Lyon Weekend",
    "story": [
      "Saturday morning. Alex left for Lyon yesterday. You're alone in Paris, unable to even comfort-watch TV because everything's in French. You check your phone obsessively. The promised texts haven't come.",
      "Finally, at 2 PM: 'Sorry! Meetings ran long. Miss you!' One text in 19 hours. You stare at it, trying to interpret tone through punctuation. Is 'Miss you!' genuine or guilty?",
      "Another text, 20 minutes later: 'Riley says hi!' Riley says hi. Why? Did Riley see Alex texting you and wanted to be included? Or is Alex trying to make Riley seem harmless by mentioning them casually?"
    ],
    "options": [
      {
        "text": "Respond normally. Ask about the retreat.",
        "arc": "paris-respond-normal"
      },
      {
        "text": "Respond but ask for more frequent updates.",
        "arc": "paris-ask-more-updates"
      },
      {
        "text": "Don't respond. See how long it takes them to follow up.",
        "arc": "paris-dont-respond"
      },
      {
        "text": "Call them. You need to hear their voice.",
        "arc": "paris-call-check-in"
      }
    ]
  },
  "paris-respond-normal": {
    "title": "Playing It Cool",
    "story": [
      "You text back: 'How's it going? What are the meetings about?' Professional interest. Supportive partner. Definitely not sitting alone in Paris feeling abandoned.",
      "Alex responds quickly this time. A paragraph about team building exercises and strategy sessions. It sounds boring. It sounds exactly like what they said it would be. You feel silly for being anxious.",
      "Another text: 'Back to sessions. Talk tonight?' At least they're planning to talk tonight. That's something."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-saturday-night"
      }
    ]
  },
  "paris-ask-more-updates": {
    "title": "Voicing Needs",
    "story": [
      "You text: 'Miss you too! Can you check in more often? It's hard being here alone.' Vulnerable but honest. You hit send before you can overthink it.",
      "Three dots appear. Disappear. Appear again. Finally: 'Of course. Sorry. Getting caught up in work mode. Will text more. Promise.' You want to believe the promise.",
      "An hour later, another text: 'Coffee break. Thinking of you.' Then another hour later: 'Boring presentation about Q4 goals.' They're trying. That counts for something."
    ],
    "options": [
      {
        "text": "Continue",
        "arc": "paris-saturday-night"
      }
    ]
  },
  "paris-dont-respond": {
    "title": "Silent Test",
    "story": [
      "You don't respond. You want to see how long it takes for a follow-up. Testing. You know you're testing. You do it anyway.",
      "Three hours pass. You're checking your phone every five minutes. Nothing. Four hours. Five. At 7 PM, your phone rings. Alex calling.",
      "'Hey, did you get my texts?' They sound worried, not guilty. 'Yeah.' 'Are you mad? You didn't respond and I got worried.' You're silent testing them and they're worried about you. Maybe you're the problem here."
    ],
    "options": [
      {
        "text": "Admit you were testing them. Be honest about insecurity.",
        "arc": "paris-admit-testing"
      },
      {
        "text": "Lie. Say you were busy and forgot to respond.",
        "arc": "paris-lie-busy"
      }
    ]
  },
  "paris-call-check-in": {
    "title": "Voice Connection",
    "story": [
      "You call. Alex answers after three rings. 'Hey! Everything okay?' You can hear people in the background. They're in a social setting.",
      "'Yeah, fine. Just wanted to hear your voice.' 'Hold on.' Shuffling sounds. The background noise fades. 'Okay, stepped outside. What's up?'",
      "'Nothing's up. I just... I miss you.' 'I miss you too. This retreat is honestly pretty boring. Lots of corporate team building nonsense. Riley keeps making jokes about the facilitator which at least makes it bearable.'"
    ],
    "options": [
      {
        "text": "Ask how much time they're spending with Riley specifically.",
        "arc": "paris-ask-riley-time"
      },
      {
        "text": "Just enjoy hearing their voice. Don't make it about Riley.",
        "arc": "paris-enjoy-voice"
      }
    ]
  },
  "paris-saturday-night": {
    "title": "Saturday Evening",
    "story": [
      "Saturday night. 8 PM in Paris. You've been alone all day. You tried to go to a café but your French failed you and you ended up ordering the wrong thing and feeling humiliated. You came home and haven't left since.",
      "Your phone buzzes. Not Alex. Unknown number. Your stomach drops. No. Not here too.",
      "You open it. It's a photo. Alex and Riley at dinner. Wine glasses on the table. They're both laughing. Riley's hand is reaching toward Alex across the table. The message: 'Thought you should know how the work retreat is going. - A Friend'",
      "The same pattern. Different city. Same fear."
    ],
    "options": [
      {
        "text": "Call Alex immediately. Demand explanation.",
        "arc": "paris-call-about-photo"
      },
      {
        "text": "Send the photo to Alex. No words. Just the image.",
        "arc": "paris-send-photo"
      },
      {
        "text": "Process first. This could be the same manipulation as NY.",
        "arc": "paris-process-photo"
      },
      {
        "text": "Book a train to Lyon. See for yourself.",
        "arc": "surprise-visit"
      }
    ]
  },
  "new-york-career-opportunity": {
    "title": "Your Turn",
    "story": [
      "Wednesday afternoon, middle of month two. You're on a video call with your boss. 'We want to promote you to senior position,' they say. 'But there's a catch - we need you in the office. Full time. Starting next month.'",
      "Your stomach drops. You're in New York. Your company is back home. 'You want me to move back?' 'Or we open a New York office. You'd be the first employee there, building it from scratch. But that means long hours. Lots of travel back to headquarters. It's a big ask.'",
      "It's your dream job. The position you've been working toward for three years. But it means competing with Alex's job for priority. It means late nights and stress and possibly the same problems you're giving Alex grief about.",
      "You tell your boss you need 24 hours to think about it. Now you need to tell Alex."
    ],
    "options": [
      {
        "text": "Tell Alex immediately. This is a partnership decision.",
        "arc": "new-york-tell-alex-promotion"
      },
      {
        "text": "Think it through alone first. Know what YOU want before discussing.",
        "arc": "new-york-think-alone-promotion"
      },
      {
        "text": "Decline the promotion. Alex's career is already stressful enough.",
        "arc": "new-york-decline-promotion"
      },
      {
        "text": "Accept immediately. This is YOUR career. You don't need permission.",
        "arc": "new-york-accept-promotion-solo"
      }
    ]
  },
  "new-york-tell-alex-promotion": {
    "title": "Partnership Decision",
    "story": [
      "That evening, you tell Alex about the offer. They listen carefully. When you're done, they ask: 'What do you want to do?' Not 'what should we do.' What do YOU want.",
      "'I don't know,' you admit. 'It's my dream job. But the timing is terrible. You're dealing with work stress, the Jordan situation, and now I'd be adding my own chaos to the mix.' 'That shouldn't matter,' Alex says. 'This is your career. Your opportunity.'",
      "'But it does matter. We're a team.' 'We are. Which means I support whatever you decide. If you want this promotion, we figure out how to make it work. If you don't, that's valid too. But don't not take it because of me.'",
      "They're giving you permission. But is that what you need?"
    ],
    "options": [
      {
        "text": "Accept the promotion. You both can have demanding careers.",
        "arc": "new-york-accept-promotion-together"
      },
      {
        "text": "Decline it. One high-stress job per relationship is enough.",
        "arc": "new-york-decline-for-relationship"
      },
      {
        "text": "Negotiate. Ask for the promotion but with flexible hours.",
        "arc": "new-york-negotiate-promotion"
      }
    ]
  },
  "new-york-think-alone-promotion": {
    "title": "Solo Processing",
    "story": [
      "You don't tell Alex yet. You need to know what you want before you can discuss what's best for 'us.' You spend the evening walking through Central Park, weighing options.",
      "Pro: Dream job. Money. Career advancement. Your own identity in New York beyond 'Alex's partner.' Con: Stress. Long hours. Becoming exactly what you've been criticizing Alex for. Hypocrisy.",
      "By the time you get home, you've made a decision. Now you just need to tell Alex."
    ],
    "options": [
      {
        "text": "You've decided to accept. Tell Alex.",
        "arc": "new-york-decided-accept"
      },
      {
        "text": "You've decided to decline. Tell Alex.",
        "arc": "new-york-decided-decline"
      },
      {
        "text": "You still can't decide. Ask Alex for input.",
        "arc": "new-york-ask-input"
      }
    ]
  },
  "new-york-decline-promotion": {
    "title": "Sacrifice",
    "story": [
      "You email your boss: 'Thank you for the opportunity, but I need to decline. The timing isn't right for my personal life.' Send. Done. You've made the decision unilaterally.",
      "You don't tell Alex about the offer. Why make them feel guilty about something you've already decided? But the decision sits heavy. You gave up your dream job. For the relationship. Will Alex ever know? Should they?"
    ],
    "options": [
      {
        "text": "Tell Alex anyway. They should know what you sacrificed.",
        "arc": "new-york-reveal-sacrifice"
      },
      {
        "text": "Never mention it. This was your choice. No guilt required.",
        "arc": "new-york-silent-sacrifice"
      }
    ]
  },
  "new-york-accept-promotion-solo": {
    "title": "Independent Choice",
    "story": [
      "You email your boss: 'I accept. Let's build the New York office.' You make the decision alone. It's YOUR career. You don't need Alex's permission to advance it.",
      "That evening, you tell Alex. Frame it as done deal, not discussion. 'I got promoted. I'll be opening our New York office. Starts next month.' Alex looks surprised. 'Wow. Congratulations. That's... when did this happen?'",
      "'Today. I needed to decide fast.' 'Without talking to me?' There's hurt in their voice. 'It's my job,' you say defensively. 'Right,' Alex says. 'Your job. Got it.'"
    ],
    "options": [
      {
        "text": "Recognize you handled this badly. Apologize.",
        "arc": "new-york-apologize-solo-choice"
      },
      {
        "text": "Stand your ground. You don't need permission for your own career.",
        "arc": "new-york-defend-solo-choice"
      }
    ]
  },
  "new-york-mom-sick": {
    "title": "The Call From Home",
    "story": [
      "Thursday morning, month three. Your phone rings. It's your dad. He never calls. 'Your mom's in the hospital,' he says without preamble. 'They found something on her mammogram. We're waiting for biopsy results.'",
      "The floor drops out from under you. 'What? When? Why didn't you call sooner?' 'It just happened yesterday. We didn't want to worry you until we knew more. But... I thought you should know.'",
      "You hang up. Stare at your phone. Your mom might have cancer. You're in New York. She's a six-hour flight away. Alex is at work. You're completely alone with this news."
    ],
    "options": [
      {
        "text": "Book a flight home immediately. You need to be there.",
        "arc": "new-york-fly-home-mom"
      },
      {
        "text": "Wait for biopsy results. No point flying if it's nothing serious.",
        "arc": "new-york-wait-results"
      },
      {
        "text": "Call Alex. You need support right now.",
        "arc": "new-york-call-alex-mom"
      },
      {
        "text": "Call a friend from home. You need someone who knows your mom.",
        "arc": "new-york-call-friend-mom"
      }
    ]
  },
  "new-york-fly-home-mom": {
    "title": "Emergency Flight",
    "story": [
      "You book the next available flight. Leaves in four hours. You text Alex: 'Mom's in hospital. Flying home. Call me.' You throw clothes in a bag. Call your boss. 'Family emergency. I need a week.'",
      "At the airport, Alex calls. 'What happened? Are you okay?' You explain while boarding. 'I'll come with you,' Alex offers. 'You can't just leave work' 'Screw work. You need support.'",
      "Do you want Alex to come? Would it help or add stress?"
    ],
    "options": [
      {
        "text": "Yes, come with me. I need you there.",
        "arc": "new-york-alex-comes-home"
      },
      {
        "text": "No, stay in New York. I need to focus on family.",
        "arc": "new-york-alex-stays"
      }
    ]
  },
  "new-york-wait-results": {
    "title": "The Long Wait",
    "story": [
      "You decide to wait. Results in 2-3 days. You can always fly then if needed. You text your dad: 'Let me know the second you hear anything. I can be there in 8 hours.'",
      "But waiting is agony. You can't focus on work. Can't focus on anything. Alex comes home and finds you staring at your phone. 'What's wrong?'",
      "You tell them. Alex immediately: 'Book a flight. You should be there.' 'But the results aren't' 'You should be with your family. Results or no results.'"
    ],
    "options": [
      {
        "text": "Take Alex's advice. Book the flight.",
        "arc": "new-york-fly-after-all"
      },
      {
        "text": "Stick with waiting. You'll go if results are bad.",
        "arc": "new-york-stick-with-waiting"
      }
    ]
  },
  "new-york-friend-divorce": {
    "title": "Crisis Call",
    "story": [
      "11 PM on a Tuesday. Your phone rings. Your best friend from college. 'Sam left me,' they say through tears. 'I came home and half our stuff was gone. No note. No explanation. Just... gone.'",
      "You've known your friend for ten years. You were in their wedding. And now they're having the worst night of their life and you're in a different city.",
      "'I'm catching the train,' you say. 'I'll be there in three hours.' You live in Connecticut, three hours from New York by train. You can be there by 2 AM. But you have an important work presentation at 9 AM tomorrow.",
      "Alex is asleep next to you. You're about to leave in the middle of the night."
    ],
    "options": [
      {
        "text": "Wake Alex, tell them where you're going, and leave.",
        "arc": "new-york-tell-alex-friend"
      },
      {
        "text": "Leave a note. Don't wake them.",
        "arc": "new-york-note-for-alex"
      },
      {
        "text": "Stay. Support your friend by phone. You can visit this weekend.",
        "arc": "new-york-phone-support-only"
      },
      {
        "text": "Ask Alex what you should do.",
        "arc": "new-york-ask-alex-friend"
      }
    ]
  },
  "paris-job-ultimatum": {
    "title": "Return to Office",
    "story": [
      "Month three in Paris. Video call with your boss. 'We need to talk about your remote arrangement. The team is struggling without you in person. We need you back in the office. If you can't return within a month, we'll have to let you go.'",
      "Your heart stops. You moved to Paris for Alex. You sacrificed your in-person job to be remote. And now they're taking that away too. You can't commute from Paris to the US. The math doesn't work.",
      "'Can I have some time to think?' 'Two weeks,' your boss says. 'Then we need an answer.' They disconnect. You're sitting in your Paris apartment, alone, facing impossible choices."
    ],
    "options": [
      {
        "text": "Tell Alex immediately. This affects both of you.",
        "arc": "paris-tell-alex-job"
      },
      {
        "text": "Start job hunting in Paris. Find a solution before panicking Alex.",
        "arc": "paris-job-hunt-secret"
      },
      {
        "text": "Ask your boss to reconsider. Fight for remote work.",
        "arc": "paris-fight-for-remote"
      },
      {
        "text": "Accept you'll lose your job. Focus on finding work in Paris.",
        "arc": "paris-accept-job-loss"
      }
    ]
  },
  "paris-family-visit-bad-timing": {
    "title": "Your Parents Want to Visit",
    "story": [
      "Your mom calls. 'Dad and I want to visit! See your new life in Paris. We're thinking next month. That weekend you mentioned Alex has the work retreat in Lyon. Perfect timing - we can keep you company!'",
      "Your heart sinks. That's the Riley retreat weekend. The weekend you're already anxious about. The weekend you planned to either go with Alex or spiral alone at home. Adding your parents to that equation feels... complicated.",
      "'Mom, that might not be the best timing...' 'Oh, but the flights are so cheap that weekend! And we haven't seen you in four months. We miss you, sweetie.'"
    ],
    "options": [
      {
        "text": "Say yes. Your parents' visit might be a good distraction.",
        "arc": "paris-parents-visit-yes"
      },
      {
        "text": "Say no. You need that weekend to focus on your relationship.",
        "arc": "paris-parents-visit-no"
      },
      {
        "text": "Ask them to come a different weekend instead.",
        "arc": "paris-parents-different-weekend"
      },
      {
        "text": "Tell them about the Riley situation. Ask their advice.",
        "arc": "paris-parents-advice"
      }
    ]
  },
  "paris-friend-moving-to-europe": {
    "title": "Familiar Face",
    "story": [
      "Your college roommate texts: 'Moving to London for work! Can I crash with you in Paris for a week while I apartment hunt? Would love to catch up and see your new life!'",
      "You haven't seen them in two years. You miss having a friend who knows the old you. But the timing is difficult - you're struggling with loneliness, French, Alex's work situation. Do you want a witness to how hard this is?",
      "Also, your apartment is tiny. You and Alex barely fit. Adding a third person for a week means no privacy, no space, constant social performance. But they're your friend. They'd do it for you."
    ],
    "options": [
      {
        "text": "Say yes enthusiastically. You need familiar company.",
        "arc": "paris-friend-stay-yes"
      },
      {
        "text": "Say yes but set boundaries. Three days, not a week.",
        "arc": "paris-friend-stay-boundaries"
      },
      {
        "text": "Suggest they stay in a hostel. You'll hang out but can't host.",
        "arc": "paris-friend-stay-no"
      },
      {
        "text": "Check with Alex first before committing.",
        "arc": "paris-friend-check-alex"
      }
    ]
  },
  "money-crisis-shared": {
    "title": "Financial Reality Check",
    "story": [
      "You're looking at your bank account. Rent is due tomorrow. Your freelance payment is late. Alex's paycheck covers their student loans and part of rent, but not everything. You're $800 short.",
      "You have a credit card. You could put rent on it. But you're already carrying a balance. Or you could ask Alex to cover your portion this month. But they've been stressed about money too. Or you could call your parents and borrow it. But that means admitting you're struggling financially in your new life.",
      "This is the unsexy part of adulting. The part where love and partnership meet reality and bills."
    ],
    "options": [
      {
        "text": "Put it on the credit card. Deal with it later.",
        "arc": "money-credit-card"
      },
      {
        "text": "Ask Alex to cover you this month. That's what partners do.",
        "arc": "money-ask-alex"
      },
      {
        "text": "Call your parents. Borrow the money.",
        "arc": "money-borrow-parents"
      },
      {
        "text": "Look for emergency freelance work. Figure it out yourself.",
        "arc": "money-emergency-work"
      }
    ]
  },
  "new-york-accept-promotion-together": {
    "title": "Power Couple",
    "story": [
      "You accept the promotion. You and Alex are now both working intense jobs in New York. The next three months are chaos - late nights, competing deadlines, takeout dinners at 10 PM, exhausted weekends.",
      "But you're equals. You're both building careers. Neither one is sacrificing for the other. When Alex works late, you work late. When you need support, Alex gives it because they understand. You're partners in ambition.",
      "It's not easy. But it's fair. And fairness might matter more than easy."
    ],
    "options": [
      {
        "text": "Continue with your relationship journey",
        "arc": "new-york-month-one"
      }
    ]
  },
  "new-york-reveal-sacrifice": {
    "title": "The Weight of Unsaid Things",
    "story": [
      "'I got offered a promotion,' you tell Alex one night. 'Senior position. New York office. My dream job.' Alex's eyes light up. 'That's amazing! When do you start?'",
      "'I don't. I turned it down. Two weeks ago.' Alex's face falls. 'What? Why didn't you tell me?' 'Because you're dealing with enough. And I didn't want you to feel guilty.'",
      "'So instead you're resentful.' They're right. You are resentful. You sacrificed your dream job and now you're holding it over Alex's head without them even knowing it was happening.",
      "The fight that follows is ugly. Necessary, but ugly."
    ],
    "options": [
      {
        "text": "Work through it. This is a communication issue you can fix.",
        "arc": "new-york-work-through-sacrifice"
      },
      {
        "text": "This reveals a bigger problem. You need space.",
        "arc": "space"
      }
    ]
  },
  "paris-tell-alex-job": {
    "title": "Shared Crisis",
    "story": [
      "When Alex comes home, you tell them everything. The ultimatum. The two-week deadline. The impossible choice. Alex listens, then pulls you close. 'We'll figure this out. Together.'",
      "'How? I can't commute from Paris to the US.' 'So we find you work in Paris. Or... we consider other options.' 'Like what?' 'Like... maybe I look for work in the US too. If Paris isn't working for you, maybe we go back together.'",
      "You didn't expect that. Alex offering to leave their Paris job. For you. The way you left your in-person job for them."
    ],
    "options": [
      {
        "text": "Accept the offer. Maybe Paris was a mistake.",
        "arc": "paris-consider-returning"
      },
      {
        "text": "Refuse. You'll figure out Paris work. They shouldn't sacrifice their job.",
        "arc": "paris-refuse-return"
      },
      {
        "text": "Table it for now. Focus on finding Paris work first.",
        "arc": "paris-job-hunt-together"
      }
    ]
  },
  "paris-parents-visit-yes": {
    "title": "Family Distraction",
    "story": [
      "'Yes! Come!' you say. Maybe having your parents there will keep you from spiraling about Alex and Riley. Maybe showing them Paris will remind you why you made this choice.",
      "Your parents arrive the Friday Alex leaves for Lyon. You spend the weekend being a tour guide. The Eiffel Tower. Notre-Dame. The Louvre. You translate menus and order for them and show them your favorite boulangerie.",
      "You're so busy entertaining them that you barely think about Alex in Lyon with Riley. Well. That's not true. You think about it constantly. But at least you're thinking about it while eating croissants with your mom instead of alone in your apartment.",
      "When Alex comes home Sunday night, your parents meet them for the first time in months. 'You look exhausted,' your mom observes. Alex does look exhausted. And something else. Stressed? Guilty?"
    ],
    "options": [
      {
        "text": "Continue with Lyon aftermath",
        "arc": "boundaries-return"
      }
    ]
  },
  "therapy-first-session-detail": {
    "title": "Session One",
    "story": [
      "Week one of couples therapy. Dr. Martinez's office in Brooklyn. Plants everywhere. You and Alex sit on opposite ends of the couch. Not touching.",
      "'So,' Dr. Martinez begins. 'Tell me why you're here.' Simple question. Complicated answer. You and Alex look at each other. Who starts?",
      "Alex gestures: you go. You take a breath."
    ],
    "options": [
      {
        "text": "Start with the photo/Riley incident. That's the crisis that brought you here.",
        "arc": "therapy-start-with-crisis"
      },
      {
        "text": "Start with the move. The foundation of current stress.",
        "arc": "therapy-start-with-move"
      },
      {
        "text": "Start with communication. The root issue beneath everything.",
        "arc": "therapy-start-with-communication"
      },
      {
        "text": "Let Alex start. You want to hear their perspective first.",
        "arc": "therapy-alex-starts"
      }
    ]
  },
  "therapy-start-with-crisis": {
    "title": "The Triggering Event",
    "story": [
      "You tell Dr. Martinez about the photo. The anonymous message. Jordan/Riley's constant presence. The fight. The fear. Alex listens, face carefully neutral.",
      "'What I'm hearing,' Dr. Martinez says, 'is that a third party created a crisis in your relationship. But the crisis found fertile ground. If your relationship was secure, an anonymous photo wouldn't have caused this much damage. So what was already there?'",
      "You don't have an answer. Or you do, but you don't want to say it out loud. Alex shifts uncomfortably."
    ],
    "options": [
      {
        "text": "Admit you've been feeling secondary to Alex's career.",
        "arc": "therapy-admit-secondary"
      },
      {
        "text": "Admit you've been anxious and projecting insecurity.",
        "arc": "therapy-admit-anxiety"
      },
      {
        "text": "Ask Alex to answer. What do THEY think was already there?",
        "arc": "therapy-ask-alex-answer"
      }
    ]
  },
  "therapy-start-with-move": {
    "title": "The Foundation",
    "story": [
      "You talk about the move. How hard it's been. How lonely. How you feel like you sacrificed your life to follow Alex's career and now you're drowning in a city that doesn't want you.",
      "Alex's face crumbles. 'I didn't know you felt that way.' 'I didn't want to tell you. You were so happy. I didn't want to ruin it.'",
      "Dr. Martinez leans forward. 'So you've been protecting Alex from your true feelings. And Alex, you haven't been asking. Two people living parallel lives, each one hiding from the other.'"
    ],
    "options": [
      {
        "text": "Commit to radical honesty going forward.",
        "arc": "therapy-commit-honesty"
      },
      {
        "text": "Question if you can actually do radical honesty. It sounds exhausting.",
        "arc": "therapy-question-honesty"
      }
    ]
  },
  "therapy-start-with-communication": {
    "title": "The Real Problem",
    "story": [
      "'We don't talk,' you say. 'Not really. We ask about surface things. But the real stuff - fears, resentments, needs - we both swallow that. And then it builds until we explode.'",
      "Dr. Martinez nods. 'Communication isn't just talking. It's being willing to be uncomfortable. To say the things that might hurt. To hear the things that might hurt. Can you both do that?'",
      "You and Alex look at each other. Can you?"
    ],
    "options": [
      {
        "text": "Yes. We're ready to be uncomfortable.",
        "arc": "therapy-ready-uncomfortable"
      },
      {
        "text": "Try. We'll try to be uncomfortable.",
        "arc": "therapy-try-uncomfortable"
      },
      {
        "text": "Honestly? Not sure. That sounds terrifying.",
        "arc": "therapy-not-sure"
      }
    ]
  },
  "happy-ending-proposal-planning": {
    "title": "The Question",
    "story": [
      "You've made it. Through the fights, the jealousy, the anonymous photos, the hard conversations. You've chosen each other again and again. And now Alex wants to make it permanent.",
      "But HOW they propose matters. Location matters. Timing matters. You've dropped hints over the months about what your dream proposal would look like. Did Alex listen?"
    ],
    "options": [
      {
        "text": "Private moment - just the two of you, intimate and personal",
        "arc": "proposal-private"
      },
      {
        "text": "Public gesture - grand, romantic, witnesses to your love",
        "arc": "proposal-public"
      },
      {
        "text": "Casual integration - proposal woven into ordinary life",
        "arc": "proposal-casual"
      }
    ]
  },
  "proposal-private": {
    "title": "Just Us",
    "story": [
      "Sunday morning. You're making breakfast in your apartment - now decorated, lived in, truly home. Alex comes up behind you, wraps arms around your waist. 'I need to ask you something.'",
      "You turn. Alex is holding a ring. No grand speech. No performance. Just: 'I want to spend the rest of my life choosing you. Will you marry me?'",
      "It's perfect. Quiet. Private. Exactly what you would have wanted if you'd known what you wanted."
    ],
    "options": [
      {
        "text": "Say yes immediately. This is everything.",
        "arc": "proposal-yes-immediate"
      },
      {
        "text": "Say yes but cry first. You need a moment.",
        "arc": "proposal-yes-emotional"
      },
      {
        "text": "Make a joke. 'About time.' Then say yes.",
        "arc": "proposal-yes-joke"
      }
    ]
  },
  "proposal-public": {
    "title": "Grand Gesture",
    "story": [
      "Alex takes you to the Brooklyn Bridge at sunset. There are photographers. Friends hiding nearby. When you get to the middle of the bridge, they're all there. A setup. A production.",
      "Part of you loves it - the romance, the effort, the declaration. Part of you feels uncomfortable - all these people watching, the pressure to react perfectly, the performance of intimacy.",
      "Alex drops to one knee. Everyone has their phones out. This will be on social media within minutes. 'Will you marry me?'"
    ],
    "options": [
      {
        "text": "Say yes. Get swept up in the romance of it all.",
        "arc": "proposal-public-yes"
      },
      {
        "text": "Say yes but feel weird about the public nature.",
        "arc": "proposal-public-mixed"
      }
    ]
  },
  "proposal-casual": {
    "title": "Ordinary Magic",
    "story": [
      "You're grocery shopping. Arguing about whether to get the expensive cheese or the cheap cheese. Alex says, 'We're going to be having this argument for the rest of our lives, you know.'",
      "'Probably,' you agree. 'Good thing I like arguing with you.' 'Good thing I like you.' Alex pauses. 'Actually... will you marry me?'",
      "Between the dairy aisle and the checkout line. No ring visible. No preparation. Just a question that feels like the most natural thing in the world."
    ],
    "options": [
      {
        "text": "Say yes in the grocery store. Perfect is overrated.",
        "arc": "proposal-casual-yes"
      },
      {
        "text": "Ask if they're serious or joking first.",
        "arc": "proposal-casual-clarify"
      }
    ]
  },
  "tragic-ending-who-leaves": {
    "title": "The End Approaching",
    "story": [
      "You've reached the point of no return. The relationship is ending. You both know it. The only question now is logistics. Who leaves? Who stays? How do you untangle a life you built together?",
      "The apartment lease is in both your names. Your stuff is mixed together. Your lives are entwined in a thousand small ways. This is going to hurt."
    ],
    "options": [
      {
        "text": "You'll leave. This was Alex's city first.",
        "arc": "tragic-you-leave"
      },
      {
        "text": "Ask Alex to leave. You need the familiar space to heal.",
        "arc": "tragic-alex-leaves"
      },
      {
        "text": "Neither of you leaves yet. Figure out logistics slowly.",
        "arc": "tragic-cohabitate-breakup"
      },
      {
        "text": "Both leave. Fresh start for both of you.",
        "arc": "tragic-both-leave"
      }
    ]
  },
  "tragic-you-leave": {
    "title": "Packing Your Life",
    "story": [
      "You pack. Alex tries to help. You don't want their help. Every item you put in a box is a memory you're leaving behind. The coffee maker you bought together. Books with both your names in them. That weird lamp from IKEA that took four hours to assemble.",
      "Alex sits on the couch, watching. 'I'm sorry,' they say. For the hundredth time. You don't respond. There's nothing left to say that hasn't been said a hundred times already.",
      "The last box is packed. Your Uber is coming. This is it."
    ],
    "options": [
      {
        "text": "Hug Alex goodbye. End with kindness even if you're ending.",
        "arc": "tragic-kind-goodbye"
      },
      {
        "text": "Leave without ceremony. Clean break is better.",
        "arc": "tragic-clean-break"
      },
      {
        "text": "One last conversation. Try to explain what went wrong.",
        "arc": "tragic-last-conversation"
      }
    ]
  },
  "bittersweet-staying-friends": {
    "title": "Redefining Love",
    "story": [
      "Six months after the breakup. You and Alex meet for coffee. It's the first time you've seen each other since you divided up the furniture. Awkward at first. Then easier than you expected.",
      "You talk about your lives now. Alex is seeing someone new. You're happy for them. Genuinely happy, which surprises you. You're seeing someone too. You show Alex a picture. 'They're cute,' Alex says. 'They are,' you agree.",
      "The romantic love is gone. But there's still love. Different love. Softer love. The kind that wants the other person to be happy even if it's not with you."
    ],
    "options": [
      {
        "text": "Commit to being friends. Real friends. This is your new chapter.",
        "arc": "bittersweet-real-friends"
      },
      {
        "text": "Stay friendly but distant. Some things are better left in the past.",
        "arc": "bittersweet-friendly-distance"
      },
      {
        "text": "Realize you're not over them yet. This was a mistake.",
        "arc": "bittersweet-not-over"
      }
    ]
  },
  "reconciliation-rebuilding-trust": {
    "title": "One Day at a Time",
    "story": [
      "Trust, once broken, doesn't rebuild overnight. Dr. Martinez warned you. Healing is slow. Nonlinear. Some days you feel secure. Other days you spiral.",
      "Today is a spiral day. Alex is ten minutes late coming home. Your brain goes: late means something bad means betrayal means it's happening again. You know this is irrational. You spiral anyway.",
      "Alex comes through the door. 'Sorry, the subway was delayed.' Just the subway. Not a conspiracy. Just trains."
    ],
    "options": [
      {
        "text": "Tell Alex you were spiraling. Vulnerability is part of healing.",
        "arc": "reconciliation-share-spiral"
      },
      {
        "text": "Keep the spiral to yourself. Work through it internally.",
        "arc": "reconciliation-private-spiral"
      },
      {
        "text": "Use the tools from therapy. Check the facts. Ground yourself.",
        "arc": "reconciliation-use-tools"
      }
    ]
  },
  "wedding-planning-style": {
    "title": "The Wedding",
    "story": [
      "You're engaged. The hard part is over, right? Wrong. Now you have to plan a wedding. And you and Alex have very different ideas about what that should look like.",
      "Alex wants big - family, friends, celebration, the works. You want intimate - close friends only, simple ceremony, nothing flashy. Or maybe it's reversed. Either way, you don't agree.",
      "Your first fight as an engaged couple is about wedding venues."
    ],
    "options": [
      {
        "text": "Compromise. Medium wedding. Some family, some friends.",
        "arc": "wedding-compromise"
      },
      {
        "text": "Elope. Skip the drama entirely.",
        "arc": "wedding-elope"
      },
      {
        "text": "Let Alex plan it. Their vision matters more.",
        "arc": "wedding-alex-plans"
      },
      {
        "text": "Long engagement. Figure it out slowly.",
        "arc": "wedding-long-engagement"
      }
    ]
  },
  "therapy-breakthrough-moment": {
    "title": "The Breakthrough",
    "story": [
      "Month four of therapy. You're in session. Talking about the same patterns you've talked about for months. Suddenly Dr. Martinez stops you.",
      "'Do you hear what you just did?' You don't. Alex doesn't. 'You both just communicated a need, listened to each other, and found compromise. In real time. Without fighting. That's growth.'",
      "You and Alex look at each other. We did? We did. Holy shit, we did.",
      "It's a small moment. But it's everything. You're actually getting better at this."
    ],
    "options": [
      {
        "text": "Celebrate the breakthrough. Acknowledge the progress.",
        "arc": "therapy-celebrate"
      },
      {
        "text": "Be cautious. One good moment doesn't mean you're fixed.",
        "arc": "therapy-cautious"
      },
      {
        "text": "Ask if you're ready to reduce therapy frequency.",
        "arc": "therapy-reduce-frequency"
      }
    ]
  },
  "future-together-location": {
    "title": "Where Do We Go From Here?",
    "story": [
      "You've made it through the crisis. You're together. You're committed. But practical question: where do you actually want to build your life?",
      "New York/Paris was never the forever plan. It was the Alex's job plan. But now you're both here, both established. Do you stay? Go back home? Try somewhere new entirely?",
      "This is the rest of your life you're planning. No pressure."
    ],
    "options": [
      {
        "text": "Stay here. You've built a life. Why start over?",
        "arc": "future-stay-current-city"
      },
      {
        "text": "Move back home. Be near family and old friends.",
        "arc": "future-return-home"
      },
      {
        "text": "New city entirely. Fresh start together.",
        "arc": "future-new-city"
      },
      {
        "text": "Wherever we both have good job opportunities.",
        "arc": "future-follow-jobs"
      }
    ]
  },
  "breakup-conversation-detail": {
    "title": "The Words",
    "story": [
      "You're sitting across from each other. Someone has to say it. Someone has to make it real. You've been dancing around it for weeks. Maybe months. But now it's time.",
      "Who says it first matters. It's not fair, but it's true. The person who says 'I think we should break up' becomes the bad guy in the story you tell yourself later."
    ],
    "options": [
      {
        "text": "You say it. 'I think we need to break up.'",
        "arc": "breakup-you-initiate"
      },
      {
        "text": "Wait for Alex to say it. They're thinking it too.",
        "arc": "breakup-alex-initiates"
      },
      {
        "text": "Say it together. 'I think we both know...'",
        "arc": "breakup-mutual"
      },
      {
        "text": "One last attempt. 'Unless... is there any way to fix this?'",
        "arc": "breakup-last-attempt"
      }
    ]
  },
  "therapy-graduation": {
    "title": "Graduation",
    "story": [
      "Dr. Martinez smiles. 'I think you're ready. You don't need me anymore. You have the tools. You've done the work. You're good.'",
      "It's your last therapy session. You're graduating couples counseling. Which sounds either triumphant or terrifying depending on how you look at it.",
      "'What if we backslide?' you ask. 'Then you come back,' Dr. Martinez says simply. 'This isn't pass/fail. It's just... you're ready to try without training wheels.'"
    ],
    "options": [
      {
        "text": "Feel confident. You've got this.",
        "arc": "therapy-graduate-confident"
      },
      {
        "text": "Feel nervous. What if you forget everything you learned?",
        "arc": "therapy-graduate-nervous"
      },
      {
        "text": "Schedule a follow-up in three months. Just in case.",
        "arc": "therapy-graduate-followup"
      }
    ]
  },
  "anniversary-of-move": {
    "title": "One Year Later",
    "story": [
      "It's been exactly one year since you moved here. One year since you packed your entire life into boxes and followed Alex to a new city. One year of growth, pain, fights, love, and learning.",
      "Alex remembers. Brings home flowers. 'Happy anniversary. We made it.' You made it. Through everything. You're still here. Still together. Still choosing each other.",
      "How do you want to mark this milestone?"
    ],
    "options": [
      {
        "text": "Go out. Celebrate big. You earned this.",
        "arc": "anniversary-celebrate"
      },
      {
        "text": "Stay in. Quiet reflection. Remember how far you've come.",
        "arc": "anniversary-quiet"
      },
      {
        "text": "Recreate your first date. Full circle moment.",
        "arc": "anniversary-first-date"
      }
    ]
  },
  "final-reflection": {
    "title": "Looking Back",
    "story": [
      "Years later, you're asked what made your relationship work. Or not work. Depending on which ending you got. You think about all the choices. All the moments. All the times you could have gone left instead of right.",
      "What was the thing that mattered most? The thing that determined your fate?"
    ],
    "options": [
      {
        "text": "Communication. We learned to actually talk to each other.",
        "arc": "happy-ending"
      },
      {
        "text": "Trust. We chose to trust even when it was scary.",
        "arc": "happy-ending"
      },
      {
        "text": "Timing. Sometimes love isn't enough if the timing is wrong.",
        "arc": "bittersweet-ending"
      },
      {
        "text": "Self-awareness. We realized we wanted different things.",
        "arc": "bittersweet-ending"
      }
    ]
  }
}
